whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual AXBS_MGPCR1 bitfields
 */

/*!
 * @name Register AXBS_MGPCR1, field AULB[2:0] (RW)
 *
 * Determines whether, and when, the crossbar switch arbitrates away the slave
 * port the master owns when the master is performing undefined length burst
 * accesses.
 *
 * Values:
 * - 0b000 - No arbitration is allowed during an undefined length burst
 * - 0b001 - Arbitration is allowed at any time during an undefined length burst
 * - 0b010 - Arbitration is allowed after four beats of an undefined length burst
 * - 0b011 - Arbitration is allowed after eight beats of an undefined length
 *     burst
 * - 0b100 - Arbitration is allowed after 16 beats of an undefined length burst
 * - 0b101 - Reserved
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the AXBS_MGPCR1_AULB field. */
#define AXBS_RD_MGPCR1_AULB(base) ((AXBS_MGPCR1_REG(base) & AXBS_MGPCR1_AULB_MASK) >> AXBS_MGPCR1_AULB_SHIFT)
#define AXBS_BRD_MGPCR1_AULB(base) (BME_UBFX32(&AXBS_MGPCR1_REG(base), AXBS_MGPCR1_AULB_SHIFT, AXBS_MGPCR1_AULB_WIDTH))

/*! @brief Set the AULB field to a new value. */
#define AXBS_WR_MGPCR1_AULB(base, value) (AXBS_RMW_MGPCR1(base, AXBS_MGPCR1_AULB_MASK, AXBS_MGPCR1_AULB(value)))
#define AXBS_BWR_MGPCR1_AULB(base, value) (BME_BFI32(&AXBS_MGPCR1_REG(base), ((uint32_t)(value) << AXBS_MGPCR1_AULB_SHIFT), AXBS_MGPCR1_AULB_SHIFT, AXBS_MGPCR1_AULB_WIDTH))
/*@}*/

/*******************************************************************************
 * AXBS_MGPCR2 - Master General Purpose Control Register
 ******************************************************************************/

/*!
 * @brief AXBS_MGPCR2 - Master General Purpose Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MGPCR controls only whether the master's undefined length burst accesses
 * are allowed to complete uninterrupted or whether they can be broken by
 * requests from higher priority masters. The MGPCR can be accessed only in Supervisor
 * mode with 32-bit accesses. If there are fewer than eight master ports, only the
 * registers associated with those masters are present. Register addresses
 * associated with master ports that are not present are reserved. Please see this
 * module's chip-specific information for which master ports are present on this
 * module.
 */
/*!
 * @name Constants and macros for entire AXBS_MGPCR2 register
 */
/*@{*/
#define AXBS_RD_MGPCR2(base)     (AXBS_MGPCR2_REG(base))
#define AXBS_WR_MGPCR2(base, value) (AXBS_MGPCR2_REG(base) = (value))
#define AXBS_RMW_MGPCR2(base, mask, value) (AXBS_WR_MGPCR2(base, (AXBS_RD_MGPCR2(base) & ~(mask)) | (value)))
#define AXBS_SET_MGPCR2(base, value) (BME_OR32(&AXBS_MGPCR2_REG(base), (uint32_t)(value)))
#define AXBS_CLR_MGPCR2(base, value) (BME_AND32(&AXBS_MGPCR2_REG(base), (uint32_t)(~(value))))
#define AXBS_TOG_MGPCR2(base, value) (BME_XOR32(&AXBS_MGPCR2_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AXBS_MGPCR2 bitfields
 */

/*!
 * @name Register AXBS_MGPCR2, field AULB[2:0] (RW)
 *
 * Determines whether, and when, the crossbar switch arbitrates away the slave
 * port the master owns when the master is performing undefined length burst
 * accesses.
 *
 * Values:
 * - 0b000 - No arbitration is allowed during an undefined length burst
 * - 0b001 - Arbitration is allowed at any time during an undefined length burst
 * - 0b010 - Arbitration is allowed after four beats of an undefined length burst
 * - 0b011 - Arbitration is allowed after eight beats of an undefined length
 *     burst
 * - 0b100 - Arbitration is allowed after 16 beats of an undefined length burst
 * - 0b101 - Reserved
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the AXBS_MGPCR2_AULB field. */
#define AXBS_RD_MGPCR2_AULB(base) ((AXBS_MGPCR2_REG(base) & AXBS_MGPCR2_AULB_MASK) >> AXBS_MGPCR2_AULB_SHIFT)
#define AXBS_BRD_MGPCR2_AULB(base) (BME_UBFX32(&AXBS_MGPCR2_REG(base), AXBS_MGPCR2_AULB_SHIFT, AXBS_MGPCR2_AULB_WIDTH))

/*! @brief Set the AULB field to a new value. */
#define AXBS_WR_MGPCR2_AULB(base, value) (AXBS_RMW_MGPCR2(base, AXBS_MGPCR2_AULB_MASK, AXBS_MGPCR2_AULB(value)))
#define AXBS_BWR_MGPCR2_AULB(base, value) (BME_BFI32(&AXBS_MGPCR2_REG(base), ((uint32_t)(value) << AXBS_MGPCR2_AULB_SHIFT), AXBS_MGPCR2_AULB_SHIFT, AXBS_MGPCR2_AULB_WIDTH))
/*@}*/

/*******************************************************************************
 * AXBS_MGPCR3 - Master General Purpose Control Register
 ******************************************************************************/

/*!
 * @brief AXBS_MGPCR3 - Master General Purpose Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MGPCR controls only whether the master's undefined length burst accesses
 * are allowed to complete uninterrupted or whether they can be broken by
 * requests from higher priority masters. The MGPCR can be accessed only in Supervisor
 * mode with 32-bit accesses. If there are fewer than eight master ports, only the
 * registers associated with those masters are present. Register addresses
 * associated with master ports that are not present are reserved. Please see this
 * module's chip-specific information for which master ports are present on this
 * module.
 */
/*!
 * @name Constants and macros for entire AXBS_MGPCR3 register
 */
/*@{*/
#define AXBS_RD_MGPCR3(base)     (AXBS_MGPCR3_REG(base))
#define AXBS_WR_MGPCR3(base, value) (AXBS_MGPCR3_REG(base) = (value))
#define AXBS_RMW_MGPCR3(base, mask, value) (AXBS_WR_MGPCR3(base, (AXBS_RD_MGPCR3(base) & ~(mask)) | (value)))
#define AXBS_SET_MGPCR3(base, value) (BME_OR32(&AXBS_MGPCR3_REG(base), (uint32_t)(value)))
#define AXBS_CLR_MGPCR3(base, value) (BME_AND32(&AXBS_MGPCR3_REG(base), (uint32_t)(~(value))))
#define AXBS_TOG_MGPCR3(base, value) (BME_XOR32(&AXBS_MGPCR3_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AXBS_MGPCR3 bitfields
 */

/*!
 * @name Register AXBS_MGPCR3, field AULB[2:0] (RW)
 *
 * Determines whether, and when, the crossbar switch arbitrates away the slave
 * port the master owns when the master is performing undefined length burst
 * accesses.
 *
 * Values:
 * - 0b000 - No arbitration is allowed during an undefined length burst
 * - 0b001 - Arbitration is allowed at any time during an undefined length burst
 * - 0b010 - Arbitration is allowed after four beats of an undefined length burst
 * - 0b011 - Arbitration is allowed after eight beats of an undefined length
 *     burst
 * - 0b100 - Arbitration is allowed after 16 beats of an undefined length burst
 * - 0b101 - Reserved
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the AXBS_MGPCR3_AULB field. */
#define AXBS_RD_MGPCR3_AULB(base) ((AXBS_MGPCR3_REG(base) & AXBS_MGPCR3_AULB_MASK) >> AXBS_MGPCR3_AULB_SHIFT)
#define AXBS_BRD_MGPCR3_AULB(base) (BME_UBFX32(&AXBS_MGPCR3_REG(base), AXBS_MGPCR3_AULB_SHIFT, AXBS_MGPCR3_AULB_WIDTH))

/*! @brief Set the AULB field to a new value. */
#define AXBS_WR_MGPCR3_AULB(base, value) (AXBS_RMW_MGPCR3(base, AXBS_MGPCR3_AULB_MASK, AXBS_MGPCR3_AULB(value)))
#define AXBS_BWR_MGPCR3_AULB(base, value) (BME_BFI32(&AXBS_MGPCR3_REG(base), ((uint32_t)(value) << AXBS_MGPCR3_AULB_SHIFT), AXBS_MGPCR3_AULB_SHIFT, AXBS_MGPCR3_AULB_WIDTH))
/*@}*/

