whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the ERQ17 field to a new value. */
#define DMA_WR_ERQ_ERQ17(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ17_MASK, DMA_ERQ_ERQ17(value)))
#define DMA_BWR_ERQ_ERQ17(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ17_SHIFT), DMA_ERQ_ERQ17_SHIFT, DMA_ERQ_ERQ17_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ18[18] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ18 field. */
#define DMA_RD_ERQ_ERQ18(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ18_MASK) >> DMA_ERQ_ERQ18_SHIFT)
#define DMA_BRD_ERQ_ERQ18(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ18_SHIFT, DMA_ERQ_ERQ18_WIDTH))

/*! @brief Set the ERQ18 field to a new value. */
#define DMA_WR_ERQ_ERQ18(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ18_MASK, DMA_ERQ_ERQ18(value)))
#define DMA_BWR_ERQ_ERQ18(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ18_SHIFT), DMA_ERQ_ERQ18_SHIFT, DMA_ERQ_ERQ18_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ19[19] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ19 field. */
#define DMA_RD_ERQ_ERQ19(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ19_MASK) >> DMA_ERQ_ERQ19_SHIFT)
#define DMA_BRD_ERQ_ERQ19(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ19_SHIFT, DMA_ERQ_ERQ19_WIDTH))

/*! @brief Set the ERQ19 field to a new value. */
#define DMA_WR_ERQ_ERQ19(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ19_MASK, DMA_ERQ_ERQ19(value)))
#define DMA_BWR_ERQ_ERQ19(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ19_SHIFT), DMA_ERQ_ERQ19_SHIFT, DMA_ERQ_ERQ19_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ20[20] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ20 field. */
#define DMA_RD_ERQ_ERQ20(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ20_MASK) >> DMA_ERQ_ERQ20_SHIFT)
#define DMA_BRD_ERQ_ERQ20(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ20_SHIFT, DMA_ERQ_ERQ20_WIDTH))

/*! @brief Set the ERQ20 field to a new value. */
#define DMA_WR_ERQ_ERQ20(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ20_MASK, DMA_ERQ_ERQ20(value)))
#define DMA_BWR_ERQ_ERQ20(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ20_SHIFT), DMA_ERQ_ERQ20_SHIFT, DMA_ERQ_ERQ20_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ21[21] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ21 field. */
#define DMA_RD_ERQ_ERQ21(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ21_MASK) >> DMA_ERQ_ERQ21_SHIFT)
#define DMA_BRD_ERQ_ERQ21(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ21_SHIFT, DMA_ERQ_ERQ21_WIDTH))

/*! @brief Set the ERQ21 field to a new value. */
#define DMA_WR_ERQ_ERQ21(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ21_MASK, DMA_ERQ_ERQ21(value)))
#define DMA_BWR_ERQ_ERQ21(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ21_SHIFT), DMA_ERQ_ERQ21_SHIFT, DMA_ERQ_ERQ21_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ22[22] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ22 field. */
#define DMA_RD_ERQ_ERQ22(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ22_MASK) >> DMA_ERQ_ERQ22_SHIFT)
#define DMA_BRD_ERQ_ERQ22(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ22_SHIFT, DMA_ERQ_ERQ22_WIDTH))

/*! @brief Set the ERQ22 field to a new value. */
#define DMA_WR_ERQ_ERQ22(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ22_MASK, DMA_ERQ_ERQ22(value)))
#define DMA_BWR_ERQ_ERQ22(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ22_SHIFT), DMA_ERQ_ERQ22_SHIFT, DMA_ERQ_ERQ22_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ23[23] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ23 field. */
#define DMA_RD_ERQ_ERQ23(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ23_MASK) >> DMA_ERQ_ERQ23_SHIFT)
#define DMA_BRD_ERQ_ERQ23(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ23_SHIFT, DMA_ERQ_ERQ23_WIDTH))

/*! @brief Set the ERQ23 field to a new value. */
#define DMA_WR_ERQ_ERQ23(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ23_MASK, DMA_ERQ_ERQ23(value)))
#define DMA_BWR_ERQ_ERQ23(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ23_SHIFT), DMA_ERQ_ERQ23_SHIFT, DMA_ERQ_ERQ23_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ24[24] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ24 field. */
#define DMA_RD_ERQ_ERQ24(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ24_MASK) >> DMA_ERQ_ERQ24_SHIFT)
#define DMA_BRD_ERQ_ERQ24(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ24_SHIFT, DMA_ERQ_ERQ24_WIDTH))

/*! @brief Set the ERQ24 field to a new value. */
#define DMA_WR_ERQ_ERQ24(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ24_MASK, DMA_ERQ_ERQ24(value)))
#define DMA_BWR_ERQ_ERQ24(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ24_SHIFT), DMA_ERQ_ERQ24_SHIFT, DMA_ERQ_ERQ24_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ25[25] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ25 field. */
#define DMA_RD_ERQ_ERQ25(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ25_MASK) >> DMA_ERQ_ERQ25_SHIFT)
#define DMA_BRD_ERQ_ERQ25(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ25_SHIFT, DMA_ERQ_ERQ25_WIDTH))

