whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the INT29 field to a new value. */
#define DMA_WR_INT_INT29(base, value) (DMA_RMW_INT(base, (DMA_INT_INT29_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT29(value)))
#define DMA_BWR_INT_INT29(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT29_SHIFT), DMA_INT_INT29_SHIFT, DMA_INT_INT29_WIDTH))
/*@}*/

/*!
 * @name Register DMA_INT, field INT30[30] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT30 field. */
#define DMA_RD_INT_INT30(base) ((DMA_INT_REG(base) & DMA_INT_INT30_MASK) >> DMA_INT_INT30_SHIFT)
#define DMA_BRD_INT_INT30(base) (BME_UBFX32(&DMA_INT_REG(base), DMA_INT_INT30_SHIFT, DMA_INT_INT30_WIDTH))

/*! @brief Set the INT30 field to a new value. */
#define DMA_WR_INT_INT30(base, value) (DMA_RMW_INT(base, (DMA_INT_INT30_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT31_MASK), DMA_INT_INT30(value)))
#define DMA_BWR_INT_INT30(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT30_SHIFT), DMA_INT_INT30_SHIFT, DMA_INT_INT30_WIDTH))
/*@}*/

/*!
 * @name Register DMA_INT, field INT31[31] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT31 field. */
#define DMA_RD_INT_INT31(base) ((DMA_INT_REG(base) & DMA_INT_INT31_MASK) >> DMA_INT_INT31_SHIFT)
#define DMA_BRD_INT_INT31(base) (BME_UBFX32(&DMA_INT_REG(base), DMA_INT_INT31_SHIFT, DMA_INT_INT31_WIDTH))

/*! @brief Set the INT31 field to a new value. */
#define DMA_WR_INT_INT31(base, value) (DMA_RMW_INT(base, (DMA_INT_INT31_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK), DMA_INT_INT31(value)))
#define DMA_BWR_INT_INT31(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT31_SHIFT), DMA_INT_INT31_SHIFT, DMA_INT_INT31_WIDTH))
/*@}*/

/*******************************************************************************
 * DMA_ERR - Error Register
 ******************************************************************************/

/*!
 * @brief DMA_ERR - Error Register (W1C)
 *
 * Reset value: 0x00000000U
 *
 * The ERR provides a bit map for the 32 channels, signaling the presence of an
 * error for each channel. The eDMA engine signals the occurrence of an error
 * condition by setting the appropriate bit in this register. The outputs of this
 * register are enabled by the contents of the EEI, then logically summed across
 * groups of 16 and 32 channels to form several group error interrupt requests,
 * which are then routed to the interrupt controller. During the execution of the
 * interrupt-service routine associated with any DMA errors, it is software's
 * responsibility to clear the appropriate bit, negating the error-interrupt request.
 * Typically, a write to the CERR in the interrupt-service routine is used for
 * this purpose. The normal DMA channel completion indicators (setting the transfer
 * control descriptor DONE flag and the possible assertion of an interrupt
 * request) are not affected when an error is detected. The contents of this register
 * can also be polled because a non-zero value indicates the presence of a
 * channel error regardless of the state of the EEI. The state of any given channel's
 * error indicators is affected by writes to this register; it is also affected by
 * writes to the CERR. On writes to the ERR, a one in any bit position clears
 * the corresponding channel's error status. A zero in any bit position has no
 * affect on the corresponding channel's current error status. The CERR is provided
 * so the error indicator for a single channel can easily be cleared.
 */
/*!
 * @name Constants and macros for entire DMA_ERR register
 */
/*@{*/
#define DMA_RD_ERR(base)         (DMA_ERR_REG(base))
#define DMA_WR_ERR(base, value)  (DMA_ERR_REG(base) = (value))
#define DMA_RMW_ERR(base, mask, value) (DMA_WR_ERR(base, (DMA_RD_ERR(base) & ~(mask)) | (value)))
#define DMA_SET_ERR(base, value) (BME_OR32(&DMA_ERR_REG(base), (uint32_t)(value)))
#define DMA_CLR_ERR(base, value) (BME_AND32(&DMA_ERR_REG(base), (uint32_t)(~(value))))
#define DMA_TOG_ERR(base, value) (BME_XOR32(&DMA_ERR_REG(base), (uint32_t)(value)))
/*@}*/

