whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the ERR24 field to a new value. */
#define DMA_WR_ERR_ERR24(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR24_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR24(value)))
#define DMA_BWR_ERR_ERR24(base, value) (BME_BFI32(&DMA_ERR_REG(base), ((uint32_t)(value) << DMA_ERR_ERR24_SHIFT), DMA_ERR_ERR24_SHIFT, DMA_ERR_ERR24_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR25[25] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR25 field. */
#define DMA_RD_ERR_ERR25(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR25_MASK) >> DMA_ERR_ERR25_SHIFT)
#define DMA_BRD_ERR_ERR25(base) (BME_UBFX32(&DMA_ERR_REG(base), DMA_ERR_ERR25_SHIFT, DMA_ERR_ERR25_WIDTH))

/*! @brief Set the ERR25 field to a new value. */
#define DMA_WR_ERR_ERR25(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR25_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR25(value)))
#define DMA_BWR_ERR_ERR25(base, value) (BME_BFI32(&DMA_ERR_REG(base), ((uint32_t)(value) << DMA_ERR_ERR25_SHIFT), DMA_ERR_ERR25_SHIFT, DMA_ERR_ERR25_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR26[26] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR26 field. */
#define DMA_RD_ERR_ERR26(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR26_MASK) >> DMA_ERR_ERR26_SHIFT)
#define DMA_BRD_ERR_ERR26(base) (BME_UBFX32(&DMA_ERR_REG(base), DMA_ERR_ERR26_SHIFT, DMA_ERR_ERR26_WIDTH))

/*! @brief Set the ERR26 field to a new value. */
#define DMA_WR_ERR_ERR26(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR26_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR26(value)))
#define DMA_BWR_ERR_ERR26(base, value) (BME_BFI32(&DMA_ERR_REG(base), ((uint32_t)(value) << DMA_ERR_ERR26_SHIFT), DMA_ERR_ERR26_SHIFT, DMA_ERR_ERR26_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR27[27] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR27 field. */
#define DMA_RD_ERR_ERR27(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR27_MASK) >> DMA_ERR_ERR27_SHIFT)
#define DMA_BRD_ERR_ERR27(base) (BME_UBFX32(&DMA_ERR_REG(base), DMA_ERR_ERR27_SHIFT, DMA_ERR_ERR27_WIDTH))

/*! @brief Set the ERR27 field to a new value. */
#define DMA_WR_ERR_ERR27(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR27_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR27(value)))
#define DMA_BWR_ERR_ERR27(base, value) (BME_BFI32(&DMA_ERR_REG(base), ((uint32_t)(value) << DMA_ERR_ERR27_SHIFT), DMA_ERR_ERR27_SHIFT, DMA_ERR_ERR27_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR28[28] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR28 field. */
#define DMA_RD_ERR_ERR28(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR28_MASK) >> DMA_ERR_ERR28_SHIFT)
#define DMA_BRD_ERR_ERR28(base) (BME_UBFX32(&DMA_ERR_REG(base), DMA_ERR_ERR28_SHIFT, DMA_ERR_ERR28_WIDTH))

/*! @brief Set the ERR28 field to a new value. */
#define DMA_WR_ERR_ERR28(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR28_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR28(value)))
#define DMA_BWR_ERR_ERR28(base, value) (BME_BFI32(&DMA_ERR_REG(base), ((uint32_t)(value) << DMA_ERR_ERR28_SHIFT), DMA_ERR_ERR28_SHIFT, DMA_ERR_ERR28_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR29[29] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR29 field. */
#define DMA_RD_ERR_ERR29(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR29_MASK) >> DMA_ERR_ERR29_SHIFT)
#define DMA_BRD_ERR_ERR29(base) (BME_UBFX32(&DMA_ERR_REG(base), DMA_ERR_ERR29_SHIFT, DMA_ERR_ERR29_WIDTH))

/*! @brief Set the ERR29 field to a new value. */
#define DMA_WR_ERR_ERR29(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR29_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR29(value)))
#define DMA_BWR_ERR_ERR29(base, value) (BME_BFI32(&DMA_ERR_REG(base), ((uint32_t)(value) << DMA_ERR_ERR29_SHIFT), DMA_ERR_ERR29_SHIFT, DMA_ERR_ERR29_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR30[30] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR30 field. */
#define DMA_RD_ERR_ERR30(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR30_MASK) >> DMA_ERR_ERR30_SHIFT)
#define DMA_BRD_ERR_ERR30(base) (BME_UBFX32(&DMA_ERR_REG(base), DMA_ERR_ERR30_SHIFT, DMA_ERR_ERR30_WIDTH))

/*! @brief Set the ERR30 field to a new value. */
#define DMA_WR_ERR_ERR30(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR30_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR30(value)))
#define DMA_BWR_ERR_ERR30(base, value) (BME_BFI32(&DMA_ERR_REG(base), ((uint32_t)(value) << DMA_ERR_ERR30_SHIFT), DMA_ERR_ERR30_SHIFT, DMA_ERR_ERR30_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR31[31] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR31 field. */
#define DMA_RD_ERR_ERR31(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR31_MASK) >> DMA_ERR_ERR31_SHIFT)
#define DMA_BRD_ERR_ERR31(base) (BME_UBFX32(&DMA_ERR_REG(base), DMA_ERR_ERR31_SHIFT, DMA_ERR_ERR31_WIDTH))

