whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the EDREQ_24 field to a new value. */
#define DMA_WR_EARS_EDREQ_24(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_24_MASK, DMA_EARS_EDREQ_24(value)))
#define DMA_BWR_EARS_EDREQ_24(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_24_SHIFT), DMA_EARS_EDREQ_24_SHIFT, DMA_EARS_EDREQ_24_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_25[25] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 25
 * - 0b1 - Enable asynchronous DMA request for channel 25
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_25 field. */
#define DMA_RD_EARS_EDREQ_25(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_25_MASK) >> DMA_EARS_EDREQ_25_SHIFT)
#define DMA_BRD_EARS_EDREQ_25(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_25_SHIFT, DMA_EARS_EDREQ_25_WIDTH))

/*! @brief Set the EDREQ_25 field to a new value. */
#define DMA_WR_EARS_EDREQ_25(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_25_MASK, DMA_EARS_EDREQ_25(value)))
#define DMA_BWR_EARS_EDREQ_25(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_25_SHIFT), DMA_EARS_EDREQ_25_SHIFT, DMA_EARS_EDREQ_25_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_26[26] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 26
 * - 0b1 - Enable asynchronous DMA request for channel 26
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_26 field. */
#define DMA_RD_EARS_EDREQ_26(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_26_MASK) >> DMA_EARS_EDREQ_26_SHIFT)
#define DMA_BRD_EARS_EDREQ_26(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_26_SHIFT, DMA_EARS_EDREQ_26_WIDTH))

/*! @brief Set the EDREQ_26 field to a new value. */
#define DMA_WR_EARS_EDREQ_26(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_26_MASK, DMA_EARS_EDREQ_26(value)))
#define DMA_BWR_EARS_EDREQ_26(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_26_SHIFT), DMA_EARS_EDREQ_26_SHIFT, DMA_EARS_EDREQ_26_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_27[27] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 27
 * - 0b1 - Enable asynchronous DMA request for channel 27
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_27 field. */
#define DMA_RD_EARS_EDREQ_27(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_27_MASK) >> DMA_EARS_EDREQ_27_SHIFT)
#define DMA_BRD_EARS_EDREQ_27(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_27_SHIFT, DMA_EARS_EDREQ_27_WIDTH))

/*! @brief Set the EDREQ_27 field to a new value. */
#define DMA_WR_EARS_EDREQ_27(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_27_MASK, DMA_EARS_EDREQ_27(value)))
#define DMA_BWR_EARS_EDREQ_27(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_27_SHIFT), DMA_EARS_EDREQ_27_SHIFT, DMA_EARS_EDREQ_27_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_28[28] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 28
 * - 0b1 - Enable asynchronous DMA request for channel 28
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_28 field. */
#define DMA_RD_EARS_EDREQ_28(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_28_MASK) >> DMA_EARS_EDREQ_28_SHIFT)
#define DMA_BRD_EARS_EDREQ_28(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_28_SHIFT, DMA_EARS_EDREQ_28_WIDTH))

/*! @brief Set the EDREQ_28 field to a new value. */
#define DMA_WR_EARS_EDREQ_28(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_28_MASK, DMA_EARS_EDREQ_28(value)))
#define DMA_BWR_EARS_EDREQ_28(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_28_SHIFT), DMA_EARS_EDREQ_28_SHIFT, DMA_EARS_EDREQ_28_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_29[29] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 29
 * - 0b1 - Enable asynchronous DMA request for channel 29
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_29 field. */
#define DMA_RD_EARS_EDREQ_29(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_29_MASK) >> DMA_EARS_EDREQ_29_SHIFT)
#define DMA_BRD_EARS_EDREQ_29(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_29_SHIFT, DMA_EARS_EDREQ_29_WIDTH))

/*! @brief Set the EDREQ_29 field to a new value. */
#define DMA_WR_EARS_EDREQ_29(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_29_MASK, DMA_EARS_EDREQ_29(value)))
#define DMA_BWR_EARS_EDREQ_29(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_29_SHIFT), DMA_EARS_EDREQ_29_SHIFT, DMA_EARS_EDREQ_29_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_30[30] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 30
 * - 0b1 - Enable asynchronous DMA request for channel 30
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_30 field. */
#define DMA_RD_EARS_EDREQ_30(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_30_MASK) >> DMA_EARS_EDREQ_30_SHIFT)
#define DMA_BRD_EARS_EDREQ_30(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_30_SHIFT, DMA_EARS_EDREQ_30_WIDTH))

/*! @brief Set the EDREQ_30 field to a new value. */
#define DMA_WR_EARS_EDREQ_30(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_30_MASK, DMA_EARS_EDREQ_30(value)))
#define DMA_BWR_EARS_EDREQ_30(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_30_SHIFT), DMA_EARS_EDREQ_30_SHIFT, DMA_EARS_EDREQ_30_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_31[31] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 31
 * - 0b1 - Enable asynchronous DMA request for channel 31
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_31 field. */
#define DMA_RD_EARS_EDREQ_31(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_31_MASK) >> DMA_EARS_EDREQ_31_SHIFT)
#define DMA_BRD_EARS_EDREQ_31(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_31_SHIFT, DMA_EARS_EDREQ_31_WIDTH))

/*! @brief Set the EDREQ_31 field to a new value. */
#define DMA_WR_EARS_EDREQ_31(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_31_MASK, DMA_EARS_EDREQ_31(value)))
#define DMA_BWR_EARS_EDREQ_31(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_31_SHIFT), DMA_EARS_EDREQ_31_SHIFT, DMA_EARS_EDREQ_31_WIDTH))
/*@}*/

