whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI28 bitfields
 */

/*!
 * @name Register DMA_DCHPRI28, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] = 0b01111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_CHPRI field. */
#define DMA_RD_DCHPRI28_CHPRI(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_CHPRI_MASK) >> DMA_DCHPRI28_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI28_CHPRI(base) (BME_UBFX8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_CHPRI_SHIFT, DMA_DCHPRI28_CHPRI_WIDTH))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI28_CHPRI(base, value) (DMA_RMW_DCHPRI28(base, DMA_DCHPRI28_CHPRI_MASK, DMA_DCHPRI28_CHPRI(value)))
#define DMA_BWR_DCHPRI28_CHPRI(base, value) (BME_BFI8(&DMA_DCHPRI28_REG(base), ((uint8_t)(value) << DMA_DCHPRI28_CHPRI_SHIFT), DMA_DCHPRI28_CHPRI_SHIFT, DMA_DCHPRI28_CHPRI_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI28, field GRPPRI[5:4] (RO)
 *
 * Group priority assigned to this channel group when fixed-priority arbitration
 * is enabled. This field is read-only; writes are ignored. Reset value for the
 * group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] equals 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_GRPPRI field. */
#define DMA_RD_DCHPRI28_GRPPRI(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_GRPPRI_MASK) >> DMA_DCHPRI28_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI28_GRPPRI(base) (BME_UBFX8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_GRPPRI_SHIFT, DMA_DCHPRI28_GRPPRI_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI28, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_DPA field. */
#define DMA_RD_DCHPRI28_DPA(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_DPA_MASK) >> DMA_DCHPRI28_DPA_SHIFT)
#define DMA_BRD_DCHPRI28_DPA(base) (BME_UBFX8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_DPA_SHIFT, DMA_DCHPRI28_DPA_WIDTH))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI28_DPA(base, value) (DMA_RMW_DCHPRI28(base, DMA_DCHPRI28_DPA_MASK, DMA_DCHPRI28_DPA(value)))
#define DMA_BWR_DCHPRI28_DPA(base, value) (BME_BFI8(&DMA_DCHPRI28_REG(base), ((uint8_t)(value) << DMA_DCHPRI28_DPA_SHIFT), DMA_DCHPRI28_DPA_SHIFT, DMA_DCHPRI28_DPA_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI28, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_ECP field. */
#define DMA_RD_DCHPRI28_ECP(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_ECP_MASK) >> DMA_DCHPRI28_ECP_SHIFT)
#define DMA_BRD_DCHPRI28_ECP(base) (BME_UBFX8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_ECP_SHIFT, DMA_DCHPRI28_ECP_WIDTH))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI28_ECP(base, value) (DMA_RMW_DCHPRI28(base, DMA_DCHPRI28_ECP_MASK, DMA_DCHPRI28_ECP(value)))
#define DMA_BWR_DCHPRI28_ECP(base, value) (BME_BFI8(&DMA_DCHPRI28_REG(base), ((uint8_t)(value) << DMA_DCHPRI28_ECP_SHIFT), DMA_DCHPRI28_ECP_SHIFT, DMA_DCHPRI28_ECP_WIDTH))
/*@}*/

/*******************************************************************************
 * DMA_SADDR - TCD Source Address
 ******************************************************************************/

/*!
 * @brief DMA_SADDR - TCD Source Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_SADDR register
 */
/*@{*/
#define DMA_RD_SADDR(base, index) (DMA_SADDR_REG(base, index))
#define DMA_WR_SADDR(base, index, value) (DMA_SADDR_REG(base, index) = (value))
#define DMA_RMW_SADDR(base, index, mask, value) (DMA_WR_SADDR(base, index, (DMA_RD_SADDR(base, index) & ~(mask)) | (value)))
#define DMA_SET_SADDR(base, index, value) (BME_OR32(&DMA_SADDR_REG(base, index), (uint32_t)(value)))
#define DMA_CLR_SADDR(base, index, value) (BME_AND32(&DMA_SADDR_REG(base, index), (uint32_t)(~(value))))
#define DMA_TOG_SADDR(base, index, value) (BME_XOR32(&DMA_SADDR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * DMA_SOFF - TCD Signed Source Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_SOFF - TCD Signed Source Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_SOFF register
 */
/*@{*/
#define DMA_RD_SOFF(base, index) (DMA_SOFF_REG(base, index))
#define DMA_WR_SOFF(base, index, value) (DMA_SOFF_REG(base, index) = (value))
#define DMA_RMW_SOFF(base, index, mask, value) (DMA_WR_SOFF(base, index, (DMA_RD_SOFF(base, index) & ~(mask)) | (value)))
#define DMA_SET_SOFF(base, index, value) (BME_OR16(&DMA_SOFF_REG(base, index), (uint16_t)(value)))
#define DMA_CLR_SOFF(base, index, value) (BME_AND16(&DMA_SOFF_REG(base, index), (uint16_t)(~(value))))
#define DMA_TOG_SOFF(base, index, value) (BME_XOR16(&DMA_SOFF_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * DMA_ATTR - TCD Transfer Attributes
 ******************************************************************************/

/*!
 * @brief DMA_ATTR - TCD Transfer Attributes (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_ATTR register
 */
/*@{*/
#define DMA_RD_ATTR(base, index) (DMA_ATTR_REG(base, index))
#define DMA_WR_ATTR(base, index, value) (DMA_ATTR_REG(base, index) = (value))
#define DMA_RMW_ATTR(base, index, mask, value) (DMA_WR_ATTR(base, index, (DMA_RD_ATTR(base, index) & ~(mask)) | (value)))
#define DMA_SET_ATTR(base, index, value) (BME_OR16(&DMA_ATTR_REG(base, index), (uint16_t)(value)))
#define DMA_CLR_ATTR(base, index, value) (BME_AND16(&DMA_ATTR_REG(base, index), (uint16_t)(~(value))))
#define DMA_TOG_ATTR(base, index, value) (BME_XOR16(&DMA_ATTR_REG(base, index), (uint16_t)(value)))
/*@}*/

