whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the RCV_EN field to a new value. */
#define EMVSIM_WR_CTRL_RCV_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_RCV_EN_MASK, EMVSIM_CTRL_RCV_EN(value)))
#define EMVSIM_BWR_CTRL_RCV_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_RCV_EN_SHIFT), EMVSIM_CTRL_RCV_EN_SHIFT, EMVSIM_CTRL_RCV_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field XMT_EN[17] (RW)
 *
 * Used to enable/disable the EMV SIM transmitter block. It can be set to 0
 * during the auto power down sequence. Note: Setting this bit (transition from 0 to
 * 1) will reset the CRC and LRC values.
 *
 * Values:
 * - 0b0 - EMV SIM Transmitter disabled (default)
 * - 0b1 - EMV SIM Transmitter enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_XMT_EN field. */
#define EMVSIM_RD_CTRL_XMT_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_XMT_EN_MASK) >> EMVSIM_CTRL_XMT_EN_SHIFT)
#define EMVSIM_BRD_CTRL_XMT_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_XMT_EN_SHIFT, EMVSIM_CTRL_XMT_EN_WIDTH))

/*! @brief Set the XMT_EN field to a new value. */
#define EMVSIM_WR_CTRL_XMT_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_XMT_EN_MASK, EMVSIM_CTRL_XMT_EN(value)))
#define EMVSIM_BWR_CTRL_XMT_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_XMT_EN_SHIFT), EMVSIM_CTRL_XMT_EN_SHIFT, EMVSIM_CTRL_XMT_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field RCVR_11[18] (RW)
 *
 * Used to configure the EMV SIM module receiver for 11 ETU operation (that is,
 * 1 Stop bit). This bit is provided for support of T=1 cards.
 *
 * Values:
 * - 0b0 - Receiver configured for 12 ETU operation mode (default)
 * - 0b1 - Receiver configured for 11 ETU operation mode
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_RCVR_11 field. */
#define EMVSIM_RD_CTRL_RCVR_11(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_RCVR_11_MASK) >> EMVSIM_CTRL_RCVR_11_SHIFT)
#define EMVSIM_BRD_CTRL_RCVR_11(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_RCVR_11_SHIFT, EMVSIM_CTRL_RCVR_11_WIDTH))

/*! @brief Set the RCVR_11 field to a new value. */
#define EMVSIM_WR_CTRL_RCVR_11(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_RCVR_11_MASK, EMVSIM_CTRL_RCVR_11(value)))
#define EMVSIM_BWR_CTRL_RCVR_11(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_RCVR_11_SHIFT), EMVSIM_CTRL_RCVR_11_SHIFT, EMVSIM_CTRL_RCVR_11_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field RX_DMA_EN[19] (RW)
 *
 * Enables assertion of DMA read request when Receive FIFO reaches the
 * programmed data threshold value. Request is held asserted till all the programmed
 * threshold bytes are read out. Receiver Data Interrupt will not be generated when
 * this bit is asserted.
 *
 * Values:
 * - 0b0 - No DMA Read Request asserted for Receiver (default)
 * - 0b1 - DMA Read Request asserted for Receiver
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_RX_DMA_EN field. */
#define EMVSIM_RD_CTRL_RX_DMA_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_RX_DMA_EN_MASK) >> EMVSIM_CTRL_RX_DMA_EN_SHIFT)
#define EMVSIM_BRD_CTRL_RX_DMA_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_RX_DMA_EN_SHIFT, EMVSIM_CTRL_RX_DMA_EN_WIDTH))

/*! @brief Set the RX_DMA_EN field to a new value. */
#define EMVSIM_WR_CTRL_RX_DMA_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_RX_DMA_EN_MASK, EMVSIM_CTRL_RX_DMA_EN(value)))
#define EMVSIM_BWR_CTRL_RX_DMA_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_RX_DMA_EN_SHIFT), EMVSIM_CTRL_RX_DMA_EN_SHIFT, EMVSIM_CTRL_RX_DMA_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field TX_DMA_EN[20] (RW)
 *
 * Enables assertion of DMA write request when Transmit FIFO is empty. Request
 * is held asserted till Transmit FIFO reaches the programmed data threshold
 * value. Transmit Data Threshold Interrupt will not be generated when this bit is
 * asserted.
 *
 * Values:
 * - 0b0 - No DMA Write Request asserted for Transmitter (default)
 * - 0b1 - DMA Write Request asserted for Transmitter
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_TX_DMA_EN field. */
#define EMVSIM_RD_CTRL_TX_DMA_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_TX_DMA_EN_MASK) >> EMVSIM_CTRL_TX_DMA_EN_SHIFT)
#define EMVSIM_BRD_CTRL_TX_DMA_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_TX_DMA_EN_SHIFT, EMVSIM_CTRL_TX_DMA_EN_WIDTH))

/*! @brief Set the TX_DMA_EN field to a new value. */
#define EMVSIM_WR_CTRL_TX_DMA_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_TX_DMA_EN_MASK, EMVSIM_CTRL_TX_DMA_EN(value)))
#define EMVSIM_BWR_CTRL_TX_DMA_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_TX_DMA_EN_SHIFT), EMVSIM_CTRL_TX_DMA_EN_SHIFT, EMVSIM_CTRL_TX_DMA_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field INV_CRC_VAL[24] (RW)
 *
 * This bit control whether the bits within the CRC Output value will be
 * inverted (1's complement) or not. For CCITT CRC calculation, this bit should be set
 * to '1'. For any other CRC using same polynomial, this bit can be set
 * accordingly.
 *
 * Values:
 * - 0b0 - Bits in CRC Output value will not be inverted.
 * - 0b1 - Bits in CRC Output value will be inverted. (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_INV_CRC_VAL field. */
#define EMVSIM_RD_CTRL_INV_CRC_VAL(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_INV_CRC_VAL_MASK) >> EMVSIM_CTRL_INV_CRC_VAL_SHIFT)
#define EMVSIM_BRD_CTRL_INV_CRC_VAL(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_INV_CRC_VAL_SHIFT, EMVSIM_CTRL_INV_CRC_VAL_WIDTH))

/*! @brief Set the INV_CRC_VAL field to a new value. */
#define EMVSIM_WR_CTRL_INV_CRC_VAL(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_INV_CRC_VAL_MASK, EMVSIM_CTRL_INV_CRC_VAL(value)))
#define EMVSIM_BWR_CTRL_INV_CRC_VAL(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_INV_CRC_VAL_SHIFT), EMVSIM_CTRL_INV_CRC_VAL_SHIFT, EMVSIM_CTRL_INV_CRC_VAL_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field CRC_OUT_FLIP[25] (RW)
 *
 * This bit control whether the bits in the CRC output bytes will be reversed or
 * not. When set to '1', the bits within the two bytes for CRC Output will
 * change from 15:0 to {8:15,0:7}. For CCITT CRC calculation, this bit should be set
 * to '1'. For any other CRC using same polynomial, this bit can be set
 * accordingly.
 *
 * Values:
 * - 0b0 - Bits within the CRC output bytes will not be reversed i.e. 15:0 will
 *     remain 15:0 (default)
 * - 0b1 - Bits within the CRC output bytes will be reversed i.e. 15:0 will
 *     become {8:15,0:7}
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_CRC_OUT_FLIP field. */
#define EMVSIM_RD_CTRL_CRC_OUT_FLIP(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_CRC_OUT_FLIP_MASK) >> EMVSIM_CTRL_CRC_OUT_FLIP_SHIFT)
#define EMVSIM_BRD_CTRL_CRC_OUT_FLIP(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_CRC_OUT_FLIP_SHIFT, EMVSIM_CTRL_CRC_OUT_FLIP_WIDTH))

/*! @brief Set the CRC_OUT_FLIP field to a new value. */
#define EMVSIM_WR_CTRL_CRC_OUT_FLIP(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_CRC_OUT_FLIP_MASK, EMVSIM_CTRL_CRC_OUT_FLIP(value)))
#define EMVSIM_BWR_CTRL_CRC_OUT_FLIP(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_CRC_OUT_FLIP_SHIFT), EMVSIM_CTRL_CRC_OUT_FLIP_SHIFT, EMVSIM_CTRL_CRC_OUT_FLIP_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field CRC_IN_FLIP[26] (RW)
 *
 * This bit control whether the bits in the CRC input byte will be reversed
 * before CRC calculation or not. When set to '1', the bits within the input byte for
 * CRC will change from 7:0 to 0:7. For CCITT CRC calculation, this bit should
 * be set to '1'. For any other CRC using same polynomial, this bit can be set
 * accordingly.
 *
 * Values:
 * - 0b0 - Bits in the input byte will not be reversed (i.e. 7:0 will remain
 *     7:0) before the CRC calculation (default)
 * - 0b1 - Bits in the input byte will be reversed (i.e. 7:0 will become 0:7)
 *     before CRC calculation
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_CRC_IN_FLIP field. */
#define EMVSIM_RD_CTRL_CRC_IN_FLIP(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_CRC_IN_FLIP_MASK) >> EMVSIM_CTRL_CRC_IN_FLIP_SHIFT)
#define EMVSIM_BRD_CTRL_CRC_IN_FLIP(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_CRC_IN_FLIP_SHIFT, EMVSIM_CTRL_CRC_IN_FLIP_WIDTH))

/*! @brief Set the CRC_IN_FLIP field to a new value. */
#define EMVSIM_WR_CTRL_CRC_IN_FLIP(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_CRC_IN_FLIP_MASK, EMVSIM_CTRL_CRC_IN_FLIP(value)))
#define EMVSIM_BWR_CTRL_CRC_IN_FLIP(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_CRC_IN_FLIP_SHIFT), EMVSIM_CTRL_CRC_IN_FLIP_SHIFT, EMVSIM_CTRL_CRC_IN_FLIP_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field CWT_EN[27] (RW)
 *
 * Enables the character wait time counter. Clearing this bit resets the counter
 * to zero.
 *
 * Values:
 * - 0b0 - Character Wait time Counter is disabled (default)
 * - 0b1 - Character Wait time counter is enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_CWT_EN field. */
#define EMVSIM_RD_CTRL_CWT_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_CWT_EN_MASK) >> EMVSIM_CTRL_CWT_EN_SHIFT)
#define EMVSIM_BRD_CTRL_CWT_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_CWT_EN_SHIFT, EMVSIM_CTRL_CWT_EN_WIDTH))

/*! @brief Set the CWT_EN field to a new value. */
#define EMVSIM_WR_CTRL_CWT_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_CWT_EN_MASK, EMVSIM_CTRL_CWT_EN(value)))
#define EMVSIM_BWR_CTRL_CWT_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_CWT_EN_SHIFT), EMVSIM_CTRL_CWT_EN_SHIFT, EMVSIM_CTRL_CWT_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field LRC_EN[28] (RW)
 *
 * This bit enables the calculation of the 8-bit LRC value for both receiver and
 * transmitter. The result of the calculation is continuously compared to zero
 * and reflected in the LRC_OK bit in the RX_STATUS register. Clearing this bit
 * resets the current LRC value in the EMV SIM hardware.
 *
 * Values:
 * - 0b0 - 8-bit Linear Redundancy Checking disabled (default)
 * - 0b1 - 8-bit Linear Redundancy Checking enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_LRC_EN field. */
#define EMVSIM_RD_CTRL_LRC_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_LRC_EN_MASK) >> EMVSIM_CTRL_LRC_EN_SHIFT)
#define EMVSIM_BRD_CTRL_LRC_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_LRC_EN_SHIFT, EMVSIM_CTRL_LRC_EN_WIDTH))

