whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the RNACK_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_RNACK_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_RNACK_IM_MASK, EMVSIM_INT_MASK_RNACK_IM(value)))
#define EMVSIM_BWR_INT_MASK_RNACK_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_RNACK_IM_SHIFT), EMVSIM_INT_MASK_RNACK_IM_SHIFT, EMVSIM_INT_MASK_RNACK_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field BWT_ERR_IM[11] (RW)
 *
 * Used to enable/disable the ability of the BWT_ERR flag in the RX_STATUS
 * register to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - BWT_ERR interrupt enabled
 * - 0b1 - BWT_ERR interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_BWT_ERR_IM field. */
#define EMVSIM_RD_INT_MASK_BWT_ERR_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_BWT_ERR_IM_MASK) >> EMVSIM_INT_MASK_BWT_ERR_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_BWT_ERR_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_BWT_ERR_IM_SHIFT, EMVSIM_INT_MASK_BWT_ERR_IM_WIDTH))

/*! @brief Set the BWT_ERR_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_BWT_ERR_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_BWT_ERR_IM_MASK, EMVSIM_INT_MASK_BWT_ERR_IM(value)))
#define EMVSIM_BWR_INT_MASK_BWT_ERR_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_BWT_ERR_IM_SHIFT), EMVSIM_INT_MASK_BWT_ERR_IM_SHIFT, EMVSIM_INT_MASK_BWT_ERR_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field BGT_ERR_IM[12] (RW)
 *
 * Used to enable/disable the ability of the BGT_ERR flag in the RX_STATUS
 * register to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - BGT_ERR interrupt enabled
 * - 0b1 - BGT_ERR interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_BGT_ERR_IM field. */
#define EMVSIM_RD_INT_MASK_BGT_ERR_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_BGT_ERR_IM_MASK) >> EMVSIM_INT_MASK_BGT_ERR_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_BGT_ERR_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_BGT_ERR_IM_SHIFT, EMVSIM_INT_MASK_BGT_ERR_IM_WIDTH))

/*! @brief Set the BGT_ERR_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_BGT_ERR_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_BGT_ERR_IM_MASK, EMVSIM_INT_MASK_BGT_ERR_IM(value)))
#define EMVSIM_BWR_INT_MASK_BGT_ERR_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_BGT_ERR_IM_SHIFT), EMVSIM_INT_MASK_BGT_ERR_IM_SHIFT, EMVSIM_INT_MASK_BGT_ERR_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field GPCNT1_IM[13] (RW)
 *
 * Used to enable/disable the ability of the GPCNT1_TO flag in the TX_STATUS
 * register to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - GPCNT1_TO interrupt enabled
 * - 0b1 - GPCNT1_TO interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_GPCNT1_IM field. */
#define EMVSIM_RD_INT_MASK_GPCNT1_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_GPCNT1_IM_MASK) >> EMVSIM_INT_MASK_GPCNT1_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_GPCNT1_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_GPCNT1_IM_SHIFT, EMVSIM_INT_MASK_GPCNT1_IM_WIDTH))

/*! @brief Set the GPCNT1_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_GPCNT1_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_GPCNT1_IM_MASK, EMVSIM_INT_MASK_GPCNT1_IM(value)))
#define EMVSIM_BWR_INT_MASK_GPCNT1_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_GPCNT1_IM_SHIFT), EMVSIM_INT_MASK_GPCNT1_IM_SHIFT, EMVSIM_INT_MASK_GPCNT1_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field RX_DATA_IM[14] (RW)
 *
 * Used to enable/disable the ability of the RX_DATA flag in the RX_STATUS
 * register to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - RX_DATA interrupt enabled
 * - 0b1 - RX_DATA interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_RX_DATA_IM field. */
#define EMVSIM_RD_INT_MASK_RX_DATA_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_RX_DATA_IM_MASK) >> EMVSIM_INT_MASK_RX_DATA_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_RX_DATA_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_RX_DATA_IM_SHIFT, EMVSIM_INT_MASK_RX_DATA_IM_WIDTH))

/*! @brief Set the RX_DATA_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_RX_DATA_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_RX_DATA_IM_MASK, EMVSIM_INT_MASK_RX_DATA_IM(value)))
#define EMVSIM_BWR_INT_MASK_RX_DATA_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_RX_DATA_IM_SHIFT), EMVSIM_INT_MASK_RX_DATA_IM_SHIFT, EMVSIM_INT_MASK_RX_DATA_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field PEF_IM[15] (RW)
 *
 * Used to enable/disable the ability of the PEF flag in the RX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - PEF interrupt enabled
 * - 0b1 - PEF interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_PEF_IM field. */
#define EMVSIM_RD_INT_MASK_PEF_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_PEF_IM_MASK) >> EMVSIM_INT_MASK_PEF_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_PEF_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_PEF_IM_SHIFT, EMVSIM_INT_MASK_PEF_IM_WIDTH))

/*! @brief Set the PEF_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_PEF_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_PEF_IM_MASK, EMVSIM_INT_MASK_PEF_IM(value)))
#define EMVSIM_BWR_INT_MASK_PEF_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_PEF_IM_SHIFT), EMVSIM_INT_MASK_PEF_IM_SHIFT, EMVSIM_INT_MASK_PEF_IM_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_RX_THD - Receiver Threshold Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_RX_THD - Receiver Threshold Register (RW)
 *
 * Reset value: 0x00000001U
 */
/*!
 * @name Constants and macros for entire EMVSIM_RX_THD register
 */
/*@{*/
#define EMVSIM_RD_RX_THD(base)   (EMVSIM_RX_THD_REG(base))
#define EMVSIM_WR_RX_THD(base, value) (EMVSIM_RX_THD_REG(base) = (value))
#define EMVSIM_RMW_RX_THD(base, mask, value) (EMVSIM_WR_RX_THD(base, (EMVSIM_RD_RX_THD(base) & ~(mask)) | (value)))
#define EMVSIM_SET_RX_THD(base, value) (BME_OR32(&EMVSIM_RX_THD_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_RX_THD(base, value) (BME_AND32(&EMVSIM_RX_THD_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_RX_THD(base, value) (BME_XOR32(&EMVSIM_RX_THD_REG(base), (uint32_t)(value)))
/*@}*/

