whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the ETCF field to a new value. */
#define EMVSIM_WR_TX_STATUS_ETCF(base, value) (EMVSIM_RMW_TX_STATUS(base, (EMVSIM_TX_STATUS_ETCF_MASK | EMVSIM_TX_STATUS_TNTE_MASK | EMVSIM_TX_STATUS_TFE_MASK | EMVSIM_TX_STATUS_TCF_MASK | EMVSIM_TX_STATUS_TFF_MASK | EMVSIM_TX_STATUS_GPCNT0_TO_MASK | EMVSIM_TX_STATUS_GPCNT1_TO_MASK), EMVSIM_TX_STATUS_ETCF(value)))
#define EMVSIM_BWR_TX_STATUS_ETCF(base, value) (BME_BFI32(&EMVSIM_TX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_TX_STATUS_ETCF_SHIFT), EMVSIM_TX_STATUS_ETCF_SHIFT, EMVSIM_TX_STATUS_ETCF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field TCF[5] (W1C)
 *
 * Used to indicate whether the EMV SIM transmitter is ready for a new
 * transmission. The TC flag becomes set when the guard time has expired after the last
 * byte in the transmit FIFO (if XMT_CRC_LRC = 0) or the LRC or CRC byte (if
 * XMT_CRC_LRC bit = 1) has been transmitted. The TC flag will create an interrupt if
 * TC_IM in the INT_MASK register is low. The TC bit is a write-one-to-clear bit.
 *
 * Values:
 * - 0b0 - Transmit pending or in progress
 * - 0b1 - Transmit complete (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_TCF field. */
#define EMVSIM_RD_TX_STATUS_TCF(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_TCF_MASK) >> EMVSIM_TX_STATUS_TCF_SHIFT)
#define EMVSIM_BRD_TX_STATUS_TCF(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_TCF_SHIFT, EMVSIM_TX_STATUS_TCF_WIDTH))

/*! @brief Set the TCF field to a new value. */
#define EMVSIM_WR_TX_STATUS_TCF(base, value) (EMVSIM_RMW_TX_STATUS(base, (EMVSIM_TX_STATUS_TCF_MASK | EMVSIM_TX_STATUS_TNTE_MASK | EMVSIM_TX_STATUS_TFE_MASK | EMVSIM_TX_STATUS_ETCF_MASK | EMVSIM_TX_STATUS_TFF_MASK | EMVSIM_TX_STATUS_GPCNT0_TO_MASK | EMVSIM_TX_STATUS_GPCNT1_TO_MASK), EMVSIM_TX_STATUS_TCF(value)))
#define EMVSIM_BWR_TX_STATUS_TCF(base, value) (BME_BFI32(&EMVSIM_TX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_TX_STATUS_TCF_SHIFT), EMVSIM_TX_STATUS_TCF_SHIFT, EMVSIM_TX_STATUS_TCF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field TFF[6] (W1C)
 *
 * Used to indicate when the Transmit FIFO has been written with maximum number
 * of bytes that it can store. Subsequent writes may get ignored. The TFF bit can
 * only be cleared by writing 1 to this bit or setting the FLUSH_XMT or
 * SOFT_RESET bit in the RESET_CNTL register.
 *
 * Values:
 * - 0b0 - Transmit FIFO Full condition has not occurred (default)
 * - 0b1 - A Transmit FIFO Full condition has occurred
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_TFF field. */
#define EMVSIM_RD_TX_STATUS_TFF(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_TFF_MASK) >> EMVSIM_TX_STATUS_TFF_SHIFT)
#define EMVSIM_BRD_TX_STATUS_TFF(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_TFF_SHIFT, EMVSIM_TX_STATUS_TFF_WIDTH))

/*! @brief Set the TFF field to a new value. */
#define EMVSIM_WR_TX_STATUS_TFF(base, value) (EMVSIM_RMW_TX_STATUS(base, (EMVSIM_TX_STATUS_TFF_MASK | EMVSIM_TX_STATUS_TNTE_MASK | EMVSIM_TX_STATUS_TFE_MASK | EMVSIM_TX_STATUS_ETCF_MASK | EMVSIM_TX_STATUS_TCF_MASK | EMVSIM_TX_STATUS_GPCNT0_TO_MASK | EMVSIM_TX_STATUS_GPCNT1_TO_MASK), EMVSIM_TX_STATUS_TFF(value)))
#define EMVSIM_BWR_TX_STATUS_TFF(base, value) (BME_BFI32(&EMVSIM_TX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_TX_STATUS_TFF_SHIFT), EMVSIM_TX_STATUS_TFF_SHIFT, EMVSIM_TX_STATUS_TFF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field TDTF[7] (RO)
 *
 * Interrupt flag asserted when total bytes in the Transmit FIFO is less than or
 * equal to the programmed transmit data threshold TDT[3:0]. The TDTF flag will
 * be set any time the number of bytes in the transmit FIFO is less than or equal
 * to the value set by TDT[3:0]. The flag can be cleared by writing enough bytes
 * into the transmit FIFO so as to take the number of bytes in the FIFO above
 * the TDT[3:0] level. Another way to clear the flag is to set the TDT[3:0] level
 * lower than the number of bytes currently in the FIFO. The TDTF flag will create
 * an interrupt if the TDT_IM bit in the INT_MASK register is cleared.
 *
 * Values:
 * - 0b0 - Number of bytes in FIFO is greater than TDT[3:0], or bit has been
 *     cleared
 * - 0b1 - Number of bytes in FIFO is less than or equal to TDT[3:0] (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_TDTF field. */
#define EMVSIM_RD_TX_STATUS_TDTF(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_TDTF_MASK) >> EMVSIM_TX_STATUS_TDTF_SHIFT)
#define EMVSIM_BRD_TX_STATUS_TDTF(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_TDTF_SHIFT, EMVSIM_TX_STATUS_TDTF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field GPCNT0_TO[8] (W1C)
 *
 * Used to indicate when the General Purpose Counter 0 has reached the
 * GPCNT0_VAL value in the GPCNT_VAL register.
 *
 * Values:
 * - 0b0 - GPCNT0_VAL time not reached, or bit has been cleared. (default)
 * - 0b1 - General Purpose counter has reached the GPCNT0_VAL value
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_GPCNT0_TO field. */
#define EMVSIM_RD_TX_STATUS_GPCNT0_TO(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_GPCNT0_TO_MASK) >> EMVSIM_TX_STATUS_GPCNT0_TO_SHIFT)
#define EMVSIM_BRD_TX_STATUS_GPCNT0_TO(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_GPCNT0_TO_SHIFT, EMVSIM_TX_STATUS_GPCNT0_TO_WIDTH))

/*! @brief Set the GPCNT0_TO field to a new value. */
#define EMVSIM_WR_TX_STATUS_GPCNT0_TO(base, value) (EMVSIM_RMW_TX_STATUS(base, (EMVSIM_TX_STATUS_GPCNT0_TO_MASK | EMVSIM_TX_STATUS_TNTE_MASK | EMVSIM_TX_STATUS_TFE_MASK | EMVSIM_TX_STATUS_ETCF_MASK | EMVSIM_TX_STATUS_TCF_MASK | EMVSIM_TX_STATUS_TFF_MASK | EMVSIM_TX_STATUS_GPCNT1_TO_MASK), EMVSIM_TX_STATUS_GPCNT0_TO(value)))
#define EMVSIM_BWR_TX_STATUS_GPCNT0_TO(base, value) (BME_BFI32(&EMVSIM_TX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_TX_STATUS_GPCNT0_TO_SHIFT), EMVSIM_TX_STATUS_GPCNT0_TO_SHIFT, EMVSIM_TX_STATUS_GPCNT0_TO_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field GPCNT1_TO[9] (W1C)
 *
 * Used to indicate when the General Purpose Counter 1 has reached the
 * GPCNT1_VAL value in the GPCNT_VAL register.
 *
 * Values:
 * - 0b0 - GPCNT1_VAL time not reached, or bit has been cleared. (default)
 * - 0b1 - General Purpose counter has reached the GPCNT1_VAL value
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_GPCNT1_TO field. */
#define EMVSIM_RD_TX_STATUS_GPCNT1_TO(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_GPCNT1_TO_MASK) >> EMVSIM_TX_STATUS_GPCNT1_TO_SHIFT)
#define EMVSIM_BRD_TX_STATUS_GPCNT1_TO(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_GPCNT1_TO_SHIFT, EMVSIM_TX_STATUS_GPCNT1_TO_WIDTH))

/*! @brief Set the GPCNT1_TO field to a new value. */
#define EMVSIM_WR_TX_STATUS_GPCNT1_TO(base, value) (EMVSIM_RMW_TX_STATUS(base, (EMVSIM_TX_STATUS_GPCNT1_TO_MASK | EMVSIM_TX_STATUS_TNTE_MASK | EMVSIM_TX_STATUS_TFE_MASK | EMVSIM_TX_STATUS_ETCF_MASK | EMVSIM_TX_STATUS_TCF_MASK | EMVSIM_TX_STATUS_TFF_MASK | EMVSIM_TX_STATUS_GPCNT0_TO_MASK), EMVSIM_TX_STATUS_GPCNT1_TO(value)))
#define EMVSIM_BWR_TX_STATUS_GPCNT1_TO(base, value) (BME_BFI32(&EMVSIM_TX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_TX_STATUS_GPCNT1_TO_SHIFT), EMVSIM_TX_STATUS_GPCNT1_TO_SHIFT, EMVSIM_TX_STATUS_GPCNT1_TO_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field TX_RPTR[19:16] (RO)
 *
 * Value of the read pointer of transmit FIFO.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_TX_RPTR field. */
#define EMVSIM_RD_TX_STATUS_TX_RPTR(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_TX_RPTR_MASK) >> EMVSIM_TX_STATUS_TX_RPTR_SHIFT)
#define EMVSIM_BRD_TX_STATUS_TX_RPTR(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_TX_RPTR_SHIFT, EMVSIM_TX_STATUS_TX_RPTR_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field TX_CNT[28:24] (RO)
 *
 * These bits indicate the number of bytes stored in the transmit FIFO.
 *
 * Values:
 * - 0b00000 - FIFO is emtpy
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_TX_CNT field. */
#define EMVSIM_RD_TX_STATUS_TX_CNT(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_TX_CNT_MASK) >> EMVSIM_TX_STATUS_TX_CNT_SHIFT)
#define EMVSIM_BRD_TX_STATUS_TX_CNT(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_TX_CNT_SHIFT, EMVSIM_TX_STATUS_TX_CNT_WIDTH))
/*@}*/

