whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the SCEN field to a new value. */
#define EMVSIM_WR_PCSR_SCEN(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SCEN_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SCEN(value)))
#define EMVSIM_BWR_PCSR_SCEN(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SCEN_SHIFT), EMVSIM_PCSR_SCEN_SHIFT, EMVSIM_PCSR_SCEN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SCSP[5] (RW)
 *
 * Used to control the polarity of the idle EMV SIM clock when the clock is
 * disabled by SCEN.
 *
 * Values:
 * - 0b0 - Clock is logic 0 when stopped by SCEN
 * - 0b1 - Clock is logic 1 when stopped by SCEN
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SCSP field. */
#define EMVSIM_RD_PCSR_SCSP(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SCSP_MASK) >> EMVSIM_PCSR_SCSP_SHIFT)
#define EMVSIM_BRD_PCSR_SCSP(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SCSP_SHIFT, EMVSIM_PCSR_SCSP_WIDTH))

/*! @brief Set the SCSP field to a new value. */
#define EMVSIM_WR_PCSR_SCSP(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SCSP_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SCSP(value)))
#define EMVSIM_BWR_PCSR_SCSP(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SCSP_SHIFT), EMVSIM_PCSR_SCSP_SHIFT, EMVSIM_PCSR_SCSP_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SPD[7] (RW)
 *
 * Writing a '1' to this location will start the autopower down sequence
 * provided the auto power down feature is enabled by writing '1' to SAPD bit of this
 * register. The SPD bit will autoclear when power down is complete.
 *
 * Values:
 * - 0b0 - No effect (default)
 * - 0b1 - Start Auto Powerdown or Power Down is in progress
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SPD field. */
#define EMVSIM_RD_PCSR_SPD(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SPD_MASK) >> EMVSIM_PCSR_SPD_SHIFT)
#define EMVSIM_BRD_PCSR_SPD(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SPD_SHIFT, EMVSIM_PCSR_SPD_WIDTH))

/*! @brief Set the SPD field to a new value. */
#define EMVSIM_WR_PCSR_SPD(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SPD_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SPD(value)))
#define EMVSIM_BWR_PCSR_SPD(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SPD_SHIFT), EMVSIM_PCSR_SPD_SHIFT, EMVSIM_PCSR_SPD_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SPDIM[24] (RW)
 *
 * Interrupt mask for the presence detect interrupt flag (SPDIF).
 *
 * Values:
 * - 0b0 - SIM presence detect interrupt is enabled
 * - 0b1 - SIM presence detect interrupt is masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SPDIM field. */
#define EMVSIM_RD_PCSR_SPDIM(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SPDIM_MASK) >> EMVSIM_PCSR_SPDIM_SHIFT)
#define EMVSIM_BRD_PCSR_SPDIM(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SPDIM_SHIFT, EMVSIM_PCSR_SPDIM_WIDTH))

/*! @brief Set the SPDIM field to a new value. */
#define EMVSIM_WR_PCSR_SPDIM(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SPDIM_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SPDIM(value)))
#define EMVSIM_BWR_PCSR_SPDIM(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SPDIM_SHIFT), EMVSIM_PCSR_SPDIM_SHIFT, EMVSIM_PCSR_SPDIM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SPDIF[25] (W1C)
 *
 * Status flag to indicate that an insertion or removal of a Smart Card has been
 * detected on port. Can create an interrupt to the MCU if SPDIM is low and/or
 * initiate the auto power down sequence if SAPD bit is '1'. Write a '1' to this
 * bit to clear.
 *
 * Values:
 * - 0b0 - No insertion or removal of Smart Card detected on Port (default)
 * - 0b1 - Insertion or removal of Smart Card detected on Port
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SPDIF field. */
#define EMVSIM_RD_PCSR_SPDIF(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SPDIF_MASK) >> EMVSIM_PCSR_SPDIF_SHIFT)
#define EMVSIM_BRD_PCSR_SPDIF(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SPDIF_SHIFT, EMVSIM_PCSR_SPDIF_WIDTH))

/*! @brief Set the SPDIF field to a new value. */
#define EMVSIM_WR_PCSR_SPDIF(base, value) (EMVSIM_RMW_PCSR(base, EMVSIM_PCSR_SPDIF_MASK, EMVSIM_PCSR_SPDIF(value)))
#define EMVSIM_BWR_PCSR_SPDIF(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SPDIF_SHIFT), EMVSIM_PCSR_SPDIF_SHIFT, EMVSIM_PCSR_SPDIF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SPDP[26] (RO)
 *
 * This bit reflects the state of the Smart Card Presence Detect pin. It is not
 * a latched register bit, but instead a synchronized version of the state of the
 * pin itself.
 *
 * Values:
 * - 0b0 - SIM Presence Detect pin is logic low
 * - 0b1 - SIM Presence Detectpin is logic high
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SPDP field. */
#define EMVSIM_RD_PCSR_SPDP(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SPDP_MASK) >> EMVSIM_PCSR_SPDP_SHIFT)
#define EMVSIM_BRD_PCSR_SPDP(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SPDP_SHIFT, EMVSIM_PCSR_SPDP_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SPDES[27] (RW)
 *
 * Controls which edge of the Smart Card Presence Detect pin is used to detect
 * the presence of the Smart Card.
 *
 * Values:
 * - 0b0 - Falling edge on the pin (default)
 * - 0b1 - Rising edge on the pin
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SPDES field. */
#define EMVSIM_RD_PCSR_SPDES(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SPDES_MASK) >> EMVSIM_PCSR_SPDES_SHIFT)
#define EMVSIM_BRD_PCSR_SPDES(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SPDES_SHIFT, EMVSIM_PCSR_SPDES_WIDTH))

/*! @brief Set the SPDES field to a new value. */
#define EMVSIM_WR_PCSR_SPDES(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SPDES_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SPDES(value)))
#define EMVSIM_BWR_PCSR_SPDES(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SPDES_SHIFT), EMVSIM_PCSR_SPDES_SHIFT, EMVSIM_PCSR_SPDES_WIDTH))
/*@}*/

