whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * EMVSIM_RX_BUF - Receive Data Read Buffer
 ******************************************************************************/

/*!
 * @brief EMVSIM_RX_BUF - Receive Data Read Buffer (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire EMVSIM_RX_BUF register
 */
/*@{*/
#define EMVSIM_RD_RX_BUF(base)   (EMVSIM_RX_BUF_REG(base))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_RX_BUF bitfields
 */

/*!
 * @name Register EMVSIM_RX_BUF, field RX_BYTE[7:0] (RO)
 *
 * Provides the byte value from the top of the receive FIFO. Each read access to
 * this register will increment the read pointer of the Receive FIFO.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_BUF_RX_BYTE field. */
#define EMVSIM_RD_RX_BUF_RX_BYTE(base) ((EMVSIM_RX_BUF_REG(base) & EMVSIM_RX_BUF_RX_BYTE_MASK) >> EMVSIM_RX_BUF_RX_BYTE_SHIFT)
#define EMVSIM_BRD_RX_BUF_RX_BYTE(base) (BME_UBFX32(&EMVSIM_RX_BUF_REG(base), EMVSIM_RX_BUF_RX_BYTE_SHIFT, EMVSIM_RX_BUF_RX_BYTE_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_TX_BUF - Transmit Data Buffer
 ******************************************************************************/

/*!
 * @brief EMVSIM_TX_BUF - Transmit Data Buffer (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire EMVSIM_TX_BUF register
 */
/*@{*/
#define EMVSIM_RD_TX_BUF(base)   (EMVSIM_TX_BUF_REG(base))
#define EMVSIM_WR_TX_BUF(base, value) (EMVSIM_TX_BUF_REG(base) = (value))
#define EMVSIM_RMW_TX_BUF(base, mask, value) (EMVSIM_WR_TX_BUF(base, (EMVSIM_RD_TX_BUF(base) & ~(mask)) | (value)))
#define EMVSIM_SET_TX_BUF(base, value) (BME_OR32(&EMVSIM_TX_BUF_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_TX_BUF(base, value) (BME_AND32(&EMVSIM_TX_BUF_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_TX_BUF(base, value) (BME_XOR32(&EMVSIM_TX_BUF_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_TX_BUF bitfields
 */

/*!
 * @name Register EMVSIM_TX_BUF, field TX_BYTE[7:0] (WORZ)
 *
 * Write to this register to fill the transmit FIFO with the bytes to be
 * transmitted. The Tx FIFO can be written to only when the transmitter is enabled.
 * Writing to this register while transmitter is disabled will lead to ignoring of
 * all write accesses to this register. Reads to this register will return zeros.
 * Writing more data to the transmit FIFO than it can hold, will cause a Transmit
 * FIFO Full (TFF) error.
 */
/*@{*/
/*! @brief Set the TX_BYTE field to a new value. */
#define EMVSIM_WR_TX_BUF_TX_BYTE(base, value) (EMVSIM_RMW_TX_BUF(base, EMVSIM_TX_BUF_TX_BYTE_MASK, EMVSIM_TX_BUF_TX_BYTE(value)))
#define EMVSIM_BWR_TX_BUF_TX_BYTE(base, value) (BME_BFI32(&EMVSIM_TX_BUF_REG(base), ((uint32_t)(value) << EMVSIM_TX_BUF_TX_BYTE_SHIFT), EMVSIM_TX_BUF_TX_BYTE_SHIFT, EMVSIM_TX_BUF_TX_BYTE_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_TX_GETU - Transmitter Guard ETU Value Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_TX_GETU - Transmitter Guard ETU Value Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire EMVSIM_TX_GETU register
 */
/*@{*/
#define EMVSIM_RD_TX_GETU(base)  (EMVSIM_TX_GETU_REG(base))
#define EMVSIM_WR_TX_GETU(base, value) (EMVSIM_TX_GETU_REG(base) = (value))
#define EMVSIM_RMW_TX_GETU(base, mask, value) (EMVSIM_WR_TX_GETU(base, (EMVSIM_RD_TX_GETU(base) & ~(mask)) | (value)))
#define EMVSIM_SET_TX_GETU(base, value) (BME_OR32(&EMVSIM_TX_GETU_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_TX_GETU(base, value) (BME_AND32(&EMVSIM_TX_GETU_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_TX_GETU(base, value) (BME_XOR32(&EMVSIM_TX_GETU_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_TX_GETU bitfields
 */

/*!
 * @name Register EMVSIM_TX_GETU, field GETU[7:0] (RW)
 *
 * Used to control the number of additional Elementary Time Units (ETUs)
 * inserted between bytes transmitted by the EMV SIM transmitter. An ETU is equivalent
 * to one bit time at the given baud rate (for example, the length of a START
 * bit). The guard time has no effect on the EMV SIM receiver. A value of 0x00
 * inserts no additional ETUs, while a value of 0xFE inserts 254 additional ETUs. A
 * value of 0xFF subtracts one ETU by reducing the number of STOP bits from two to
 * one.
 *
 * Values:
 * - 0b00000000 - no additional ETUs inserted (default)
 * - 0b00000001 - 1 additional ETU inserted
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_GETU_GETU field. */
#define EMVSIM_RD_TX_GETU_GETU(base) ((EMVSIM_TX_GETU_REG(base) & EMVSIM_TX_GETU_GETU_MASK) >> EMVSIM_TX_GETU_GETU_SHIFT)
#define EMVSIM_BRD_TX_GETU_GETU(base) (BME_UBFX32(&EMVSIM_TX_GETU_REG(base), EMVSIM_TX_GETU_GETU_SHIFT, EMVSIM_TX_GETU_GETU_WIDTH))

/*! @brief Set the GETU field to a new value. */
#define EMVSIM_WR_TX_GETU_GETU(base, value) (EMVSIM_RMW_TX_GETU(base, EMVSIM_TX_GETU_GETU_MASK, EMVSIM_TX_GETU_GETU(value)))
#define EMVSIM_BWR_TX_GETU_GETU(base, value) (BME_BFI32(&EMVSIM_TX_GETU_REG(base), ((uint32_t)(value) << EMVSIM_TX_GETU_GETU_SHIFT), EMVSIM_TX_GETU_GETU_SHIFT, EMVSIM_TX_GETU_GETU_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_CWT_VAL - Character Wait Time Value Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_CWT_VAL - Character Wait Time Value Register (RW)
 *
 * Reset value: 0x0000FFFFU
 */
/*!
 * @name Constants and macros for entire EMVSIM_CWT_VAL register
 */
/*@{*/
#define EMVSIM_RD_CWT_VAL(base)  (EMVSIM_CWT_VAL_REG(base))
#define EMVSIM_WR_CWT_VAL(base, value) (EMVSIM_CWT_VAL_REG(base) = (value))
#define EMVSIM_RMW_CWT_VAL(base, mask, value) (EMVSIM_WR_CWT_VAL(base, (EMVSIM_RD_CWT_VAL(base) & ~(mask)) | (value)))
#define EMVSIM_SET_CWT_VAL(base, value) (BME_OR32(&EMVSIM_CWT_VAL_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_CWT_VAL(base, value) (BME_AND32(&EMVSIM_CWT_VAL_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_CWT_VAL(base, value) (BME_XOR32(&EMVSIM_CWT_VAL_REG(base), (uint32_t)(value)))
/*@}*/

