whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * MK82F25615 FMC
 *
 * Flash Memory Controller
 *
 * Registers defined in this header file:
 * - FMC_PFAPR - Flash Access Protection Register
 * - FMC_PFB0CR - Flash Bank 0 Control Register
 * - FMC_RESERVED - Reserved
 * - FMC_TAGVDW0S - Cache Tag Storage
 * - FMC_TAGVDW1S - Cache Tag Storage
 * - FMC_TAGVDW2S - Cache Tag Storage
 * - FMC_TAGVDW3S - Cache Tag Storage
 * - FMC_DATA_UM - Cache Data Storage (uppermost word)
 * - FMC_DATA_MU - Cache Data Storage (mid-upper word)
 * - FMC_DATA_ML - Cache Data Storage (mid-lower word)
 * - FMC_DATA_LM - Cache Data Storage (lowermost word)
 */

#define FMC_INSTANCE_COUNT (1U) /*!< Number of instances of the FMC module. */
#define FMC_IDX (0U) /*!< Instance number for FMC. */

/*******************************************************************************
 * FMC_PFAPR - Flash Access Protection Register
 ******************************************************************************/

/*!
 * @brief FMC_PFAPR - Flash Access Protection Register (RW)
 *
 * Reset value: 0x0000003FU
 */
/*!
 * @name Constants and macros for entire FMC_PFAPR register
 */
/*@{*/
#define FMC_RD_PFAPR(base)       (FMC_PFAPR_REG(base))
#define FMC_WR_PFAPR(base, value) (FMC_PFAPR_REG(base) = (value))
#define FMC_RMW_PFAPR(base, mask, value) (FMC_WR_PFAPR(base, (FMC_RD_PFAPR(base) & ~(mask)) | (value)))
#define FMC_SET_PFAPR(base, value) (BME_OR32(&FMC_PFAPR_REG(base), (uint32_t)(value)))
#define FMC_CLR_PFAPR(base, value) (BME_AND32(&FMC_PFAPR_REG(base), (uint32_t)(~(value))))
#define FMC_TOG_PFAPR(base, value) (BME_XOR32(&FMC_PFAPR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FMC_PFAPR bitfields
 */

/*!
 * @name Register FMC_PFAPR, field M0AP[1:0] (RW)
 *
 * This field controls whether read and write access to the flash is allowed,
 * based on the logical master number of the requesting crossbar switch master.
 *
 * Values:
 * - 0b00 - No access may be performed by this master
 * - 0b01 - Only read accesses may be performed by this master
 * - 0b10 - Only write accesses may be performed by this master
 * - 0b11 - Both read and write accesses may be performed by this master
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M0AP field. */
#define FMC_RD_PFAPR_M0AP(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M0AP_MASK) >> FMC_PFAPR_M0AP_SHIFT)
#define FMC_BRD_PFAPR_M0AP(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M0AP_SHIFT, FMC_PFAPR_M0AP_WIDTH))

/*! @brief Set the M0AP field to a new value. */
#define FMC_WR_PFAPR_M0AP(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M0AP_MASK, FMC_PFAPR_M0AP(value)))
#define FMC_BWR_PFAPR_M0AP(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M0AP_SHIFT), FMC_PFAPR_M0AP_SHIFT, FMC_PFAPR_M0AP_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M1AP[3:2] (RW)
 *
 * This field controls whether read and write access to the flash is allowed,
 * based on the logical master number of the requesting crossbar switch master.
 *
 * Values:
 * - 0b00 - No access may be performed by this master
 * - 0b01 - Only read accesses may be performed by this master
 * - 0b10 - Only write accesses may be performed by this master
 * - 0b11 - Both read and write accesses may be performed by this master
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M1AP field. */
#define FMC_RD_PFAPR_M1AP(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M1AP_MASK) >> FMC_PFAPR_M1AP_SHIFT)
#define FMC_BRD_PFAPR_M1AP(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M1AP_SHIFT, FMC_PFAPR_M1AP_WIDTH))

/*! @brief Set the M1AP field to a new value. */
#define FMC_WR_PFAPR_M1AP(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M1AP_MASK, FMC_PFAPR_M1AP(value)))
#define FMC_BWR_PFAPR_M1AP(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M1AP_SHIFT), FMC_PFAPR_M1AP_SHIFT, FMC_PFAPR_M1AP_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M2AP[5:4] (RW)
 *
 * This field controls whether read and write access to the flash is allowed,
 * based on the logical master number of the requesting crossbar switch master.
 *
 * Values:
 * - 0b00 - No access may be performed by this master
 * - 0b01 - Only read accesses may be performed by this master
 * - 0b10 - Only write accesses may be performed by this master
 * - 0b11 - Both read and write accesses may be performed by this master
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M2AP field. */
#define FMC_RD_PFAPR_M2AP(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M2AP_MASK) >> FMC_PFAPR_M2AP_SHIFT)
#define FMC_BRD_PFAPR_M2AP(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M2AP_SHIFT, FMC_PFAPR_M2AP_WIDTH))

/*! @brief Set the M2AP field to a new value. */
#define FMC_WR_PFAPR_M2AP(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M2AP_MASK, FMC_PFAPR_M2AP(value)))
#define FMC_BWR_PFAPR_M2AP(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M2AP_SHIFT), FMC_PFAPR_M2AP_SHIFT, FMC_PFAPR_M2AP_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M3AP[7:6] (RW)
 *
 * This field controls whether read and write access to the flash is allowed,
 * based on the logical master number of the requesting crossbar switch master.
 *
 * Values:
 * - 0b00 - No access may be performed by this master
 * - 0b01 - Only read accesses may be performed by this master
 * - 0b10 - Only write accesses may be performed by this master
 * - 0b11 - Both read and write accesses may be performed by this master
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M3AP field. */
#define FMC_RD_PFAPR_M3AP(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M3AP_MASK) >> FMC_PFAPR_M3AP_SHIFT)
#define FMC_BRD_PFAPR_M3AP(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M3AP_SHIFT, FMC_PFAPR_M3AP_WIDTH))

/*! @brief Set the M3AP field to a new value. */
#define FMC_WR_PFAPR_M3AP(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M3AP_MASK, FMC_PFAPR_M3AP(value)))
#define FMC_BWR_PFAPR_M3AP(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M3AP_SHIFT), FMC_PFAPR_M3AP_SHIFT, FMC_PFAPR_M3AP_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M4AP[9:8] (RW)
 *
 * This field controls whether read and write access to the flash is allowed,
 * based on the logical master number of the requesting crossbar switch master.
 *
 * Values:
 * - 0b00 - No access may be performed by this master
 * - 0b01 - Only read accesses may be performed by this master
 * - 0b10 - Only write accesses may be performed by this master
 * - 0b11 - Both read and write accesses may be performed by this master
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M4AP field. */
#define FMC_RD_PFAPR_M4AP(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M4AP_MASK) >> FMC_PFAPR_M4AP_SHIFT)
#define FMC_BRD_PFAPR_M4AP(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M4AP_SHIFT, FMC_PFAPR_M4AP_WIDTH))

/*! @brief Set the M4AP field to a new value. */
#define FMC_WR_PFAPR_M4AP(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M4AP_MASK, FMC_PFAPR_M4AP(value)))
#define FMC_BWR_PFAPR_M4AP(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M4AP_SHIFT), FMC_PFAPR_M4AP_SHIFT, FMC_PFAPR_M4AP_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M0PFD[16] (RW)
 *
 * These bits control whether prefetching is enabled, based on the logical
 * number of the requesting crossbar switch master. This field is further qualified by
 * the PFBnCR[BxDPE,BxIPE] bits.
 *
 * Values:
 * - 0b0 - Prefetching for this master is enabled.
 * - 0b1 - Prefetching for this master is disabled.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M0PFD field. */
#define FMC_RD_PFAPR_M0PFD(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M0PFD_MASK) >> FMC_PFAPR_M0PFD_SHIFT)
#define FMC_BRD_PFAPR_M0PFD(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M0PFD_SHIFT, FMC_PFAPR_M0PFD_WIDTH))

/*! @brief Set the M0PFD field to a new value. */
#define FMC_WR_PFAPR_M0PFD(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M0PFD_MASK, FMC_PFAPR_M0PFD(value)))
#define FMC_BWR_PFAPR_M0PFD(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M0PFD_SHIFT), FMC_PFAPR_M0PFD_SHIFT, FMC_PFAPR_M0PFD_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M1PFD[17] (RW)
 *
 * These bits control whether prefetching is enabled, based on the logical
 * number of the requesting crossbar switch master. This field is further qualified by
 * the PFBnCR[BxDPE,BxIPE] bits.
 *
 * Values:
 * - 0b0 - Prefetching for this master is enabled.
 * - 0b1 - Prefetching for this master is disabled.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M1PFD field. */
#define FMC_RD_PFAPR_M1PFD(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M1PFD_MASK) >> FMC_PFAPR_M1PFD_SHIFT)
#define FMC_BRD_PFAPR_M1PFD(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M1PFD_SHIFT, FMC_PFAPR_M1PFD_WIDTH))

/*! @brief Set the M1PFD field to a new value. */
#define FMC_WR_PFAPR_M1PFD(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M1PFD_MASK, FMC_PFAPR_M1PFD(value)))
#define FMC_BWR_PFAPR_M1PFD(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M1PFD_SHIFT), FMC_PFAPR_M1PFD_SHIFT, FMC_PFAPR_M1PFD_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M2PFD[18] (RW)
 *
 * These bits control whether prefetching is enabled, based on the logical
 * number of the requesting crossbar switch master. This field is further qualified by
 * the PFBnCR[BxDPE,BxIPE] bits.
 *
 * Values:
 * - 0b0 - Prefetching for this master is enabled.
 * - 0b1 - Prefetching for this master is disabled.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M2PFD field. */
#define FMC_RD_PFAPR_M2PFD(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M2PFD_MASK) >> FMC_PFAPR_M2PFD_SHIFT)
#define FMC_BRD_PFAPR_M2PFD(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M2PFD_SHIFT, FMC_PFAPR_M2PFD_WIDTH))

/*! @brief Set the M2PFD field to a new value. */
#define FMC_WR_PFAPR_M2PFD(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M2PFD_MASK, FMC_PFAPR_M2PFD(value)))
#define FMC_BWR_PFAPR_M2PFD(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M2PFD_SHIFT), FMC_PFAPR_M2PFD_SHIFT, FMC_PFAPR_M2PFD_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M3PFD[19] (RW)
 *
 * These bits control whether prefetching is enabled, based on the logical
 * number of the requesting crossbar switch master. This field is further qualified by
 * the PFBnCR[BxDPE,BxIPE] bits.
 *
 * Values:
 * - 0b0 - Prefetching for this master is enabled.
 * - 0b1 - Prefetching for this master is disabled.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M3PFD field. */
#define FMC_RD_PFAPR_M3PFD(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M3PFD_MASK) >> FMC_PFAPR_M3PFD_SHIFT)
#define FMC_BRD_PFAPR_M3PFD(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M3PFD_SHIFT, FMC_PFAPR_M3PFD_WIDTH))

/*! @brief Set the M3PFD field to a new value. */
#define FMC_WR_PFAPR_M3PFD(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M3PFD_MASK, FMC_PFAPR_M3PFD(value)))
#define FMC_BWR_PFAPR_M3PFD(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M3PFD_SHIFT), FMC_PFAPR_M3PFD_SHIFT, FMC_PFAPR_M3PFD_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFAPR, field M4PFD[20] (RW)
 *
 * These bits control whether prefetching is enabled, based on the logical
 * number of the requesting crossbar switch master. This field is further qualified by
 * the PFBnCR[BxDPE,BxIPE] bits.
 *
 * Values:
 * - 0b0 - Prefetching for this master is enabled.
 * - 0b1 - Prefetching for this master is disabled.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFAPR_M4PFD field. */
#define FMC_RD_PFAPR_M4PFD(base) ((FMC_PFAPR_REG(base) & FMC_PFAPR_M4PFD_MASK) >> FMC_PFAPR_M4PFD_SHIFT)
#define FMC_BRD_PFAPR_M4PFD(base) (BME_UBFX32(&FMC_PFAPR_REG(base), FMC_PFAPR_M4PFD_SHIFT, FMC_PFAPR_M4PFD_WIDTH))

/*! @brief Set the M4PFD field to a new value. */
#define FMC_WR_PFAPR_M4PFD(base, value) (FMC_RMW_PFAPR(base, FMC_PFAPR_M4PFD_MASK, FMC_PFAPR_M4PFD(value)))
#define FMC_BWR_PFAPR_M4PFD(base, value) (BME_BFI32(&FMC_PFAPR_REG(base), ((uint32_t)(value) << FMC_PFAPR_M4PFD_SHIFT), FMC_PFAPR_M4PFD_SHIFT, FMC_PFAPR_M4PFD_WIDTH))
/*@}*/

