whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * FMC_RESERVED - Reserved
 ******************************************************************************/

/*!
 * @brief FMC_RESERVED - Reserved (RO)
 *
 * Reset value: 0x30000000U
 *
 * This register address is reserved.
 */
/*!
 * @name Constants and macros for entire FMC_RESERVED register
 */
/*@{*/
#define FMC_RD_RESERVED(base)    (FMC_RESERVED_REG(base))
/*@}*/

/*******************************************************************************
 * FMC_TAGVDW0S - Cache Tag Storage
 ******************************************************************************/

/*!
 * @brief FMC_TAGVDW0S - Cache Tag Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The 128-entry cache is a 4-way, set-associative cache with 4 sets. The ways
 * are numbered 0-3 and the sets are numbered 0-3. In TAGVDWxSy, x denotes the
 * way, and y denotes the set. This section represents tag/vld information for all
 * sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_TAGVDW0S register
 */
/*@{*/
#define FMC_RD_TAGVDW0S(base, index) (FMC_TAGVDW0S_REG(base, index))
#define FMC_WR_TAGVDW0S(base, index, value) (FMC_TAGVDW0S_REG(base, index) = (value))
#define FMC_RMW_TAGVDW0S(base, index, mask, value) (FMC_WR_TAGVDW0S(base, index, (FMC_RD_TAGVDW0S(base, index) & ~(mask)) | (value)))
#define FMC_SET_TAGVDW0S(base, index, value) (BME_OR32(&FMC_TAGVDW0S_REG(base, index), (uint32_t)(value)))
#define FMC_CLR_TAGVDW0S(base, index, value) (BME_AND32(&FMC_TAGVDW0S_REG(base, index), (uint32_t)(~(value))))
#define FMC_TOG_TAGVDW0S(base, index, value) (BME_XOR32(&FMC_TAGVDW0S_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FMC_TAGVDW0S bitfields
 */

/*!
 * @name Register FMC_TAGVDW0S, field valid[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW0S_valid field. */
#define FMC_RD_TAGVDW0S_valid(base, index) ((FMC_TAGVDW0S_REG(base, index) & FMC_TAGVDW0S_valid_MASK) >> FMC_TAGVDW0S_valid_SHIFT)
#define FMC_BRD_TAGVDW0S_valid(base, index) (BME_UBFX32(&FMC_TAGVDW0S_REG(base, index), FMC_TAGVDW0S_valid_SHIFT, FMC_TAGVDW0S_valid_WIDTH))

/*! @brief Set the valid field to a new value. */
#define FMC_WR_TAGVDW0S_valid(base, index, value) (FMC_RMW_TAGVDW0S(base, index, FMC_TAGVDW0S_valid_MASK, FMC_TAGVDW0S_valid(value)))
#define FMC_BWR_TAGVDW0S_valid(base, index, value) (BME_BFI32(&FMC_TAGVDW0S_REG(base, index), ((uint32_t)(value) << FMC_TAGVDW0S_valid_SHIFT), FMC_TAGVDW0S_valid_SHIFT, FMC_TAGVDW0S_valid_WIDTH))
/*@}*/

/*!
 * @name Register FMC_TAGVDW0S, field cache_tag[19:6] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW0S_cache_tag field. */
#define FMC_RD_TAGVDW0S_cache_tag(base, index) ((FMC_TAGVDW0S_REG(base, index) & FMC_TAGVDW0S_cache_tag_MASK) >> FMC_TAGVDW0S_cache_tag_SHIFT)
#define FMC_BRD_TAGVDW0S_cache_tag(base, index) (FMC_RD_TAGVDW0S_cache_tag(base, index))

/*! @brief Set the cache_tag field to a new value. */
#define FMC_WR_TAGVDW0S_cache_tag(base, index, value) (FMC_RMW_TAGVDW0S(base, index, FMC_TAGVDW0S_cache_tag_MASK, FMC_TAGVDW0S_cache_tag(value)))
#define FMC_BWR_TAGVDW0S_cache_tag(base, index, value) (FMC_WR_TAGVDW0S_cache_tag(base, index, value))
/*@}*/

/*******************************************************************************
 * FMC_TAGVDW1S - Cache Tag Storage
 ******************************************************************************/

/*!
 * @brief FMC_TAGVDW1S - Cache Tag Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The 128-entry cache is a 4-way, set-associative cache with 4 sets. The ways
 * are numbered 0-3 and the sets are numbered 0-3. In TAGVDWxSy, x denotes the
 * way, and y denotes the set. This section represents tag/vld information for all
 * sets (n=0-3) in way 1.
 */
/*!
 * @name Constants and macros for entire FMC_TAGVDW1S register
 */
/*@{*/
#define FMC_RD_TAGVDW1S(base, index) (FMC_TAGVDW1S_REG(base, index))
#define FMC_WR_TAGVDW1S(base, index, value) (FMC_TAGVDW1S_REG(base, index) = (value))
#define FMC_RMW_TAGVDW1S(base, index, mask, value) (FMC_WR_TAGVDW1S(base, index, (FMC_RD_TAGVDW1S(base, index) & ~(mask)) | (value)))
#define FMC_SET_TAGVDW1S(base, index, value) (BME_OR32(&FMC_TAGVDW1S_REG(base, index), (uint32_t)(value)))
#define FMC_CLR_TAGVDW1S(base, index, value) (BME_AND32(&FMC_TAGVDW1S_REG(base, index), (uint32_t)(~(value))))
#define FMC_TOG_TAGVDW1S(base, index, value) (BME_XOR32(&FMC_TAGVDW1S_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FMC_TAGVDW1S bitfields
 */

/*!
 * @name Register FMC_TAGVDW1S, field valid[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW1S_valid field. */
#define FMC_RD_TAGVDW1S_valid(base, index) ((FMC_TAGVDW1S_REG(base, index) & FMC_TAGVDW1S_valid_MASK) >> FMC_TAGVDW1S_valid_SHIFT)
#define FMC_BRD_TAGVDW1S_valid(base, index) (BME_UBFX32(&FMC_TAGVDW1S_REG(base, index), FMC_TAGVDW1S_valid_SHIFT, FMC_TAGVDW1S_valid_WIDTH))

/*! @brief Set the valid field to a new value. */
#define FMC_WR_TAGVDW1S_valid(base, index, value) (FMC_RMW_TAGVDW1S(base, index, FMC_TAGVDW1S_valid_MASK, FMC_TAGVDW1S_valid(value)))
#define FMC_BWR_TAGVDW1S_valid(base, index, value) (BME_BFI32(&FMC_TAGVDW1S_REG(base, index), ((uint32_t)(value) << FMC_TAGVDW1S_valid_SHIFT), FMC_TAGVDW1S_valid_SHIFT, FMC_TAGVDW1S_valid_WIDTH))
/*@}*/

/*!
 * @name Register FMC_TAGVDW1S, field cache_tag[19:6] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW1S_cache_tag field. */
#define FMC_RD_TAGVDW1S_cache_tag(base, index) ((FMC_TAGVDW1S_REG(base, index) & FMC_TAGVDW1S_cache_tag_MASK) >> FMC_TAGVDW1S_cache_tag_SHIFT)
#define FMC_BRD_TAGVDW1S_cache_tag(base, index) (FMC_RD_TAGVDW1S_cache_tag(base, index))

/*! @brief Set the cache_tag field to a new value. */
#define FMC_WR_TAGVDW1S_cache_tag(base, index, value) (FMC_RMW_TAGVDW1S(base, index, FMC_TAGVDW1S_cache_tag_MASK, FMC_TAGVDW1S_cache_tag(value)))
#define FMC_BWR_TAGVDW1S_cache_tag(base, index, value) (FMC_WR_TAGVDW1S_cache_tag(base, index, value))
/*@}*/

