whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual LMEM_PCCCR bitfields
 */

/*!
 * @name Register LMEM_PCCCR, field ENCACHE[0] (RW)
 *
 * Values:
 * - 0b0 - Cache disabled
 * - 0b1 - Cache enabled
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_ENCACHE field. */
#define LMEM_RD_PCCCR_ENCACHE(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_ENCACHE_MASK) >> LMEM_PCCCR_ENCACHE_SHIFT)
#define LMEM_BRD_PCCCR_ENCACHE(base) (LMEM_RD_PCCCR_ENCACHE(base))

/*! @brief Set the ENCACHE field to a new value. */
#define LMEM_WR_PCCCR_ENCACHE(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_ENCACHE_MASK, LMEM_PCCCR_ENCACHE(value)))
#define LMEM_BWR_PCCCR_ENCACHE(base, value) (LMEM_WR_PCCCR_ENCACHE(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field ENWRBUF[1] (RW)
 *
 * Values:
 * - 0b0 - Write buffer disabled
 * - 0b1 - Write buffer enabled
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_ENWRBUF field. */
#define LMEM_RD_PCCCR_ENWRBUF(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_ENWRBUF_MASK) >> LMEM_PCCCR_ENWRBUF_SHIFT)
#define LMEM_BRD_PCCCR_ENWRBUF(base) (LMEM_RD_PCCCR_ENWRBUF(base))

/*! @brief Set the ENWRBUF field to a new value. */
#define LMEM_WR_PCCCR_ENWRBUF(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_ENWRBUF_MASK, LMEM_PCCCR_ENWRBUF(value)))
#define LMEM_BWR_PCCCR_ENWRBUF(base, value) (LMEM_WR_PCCCR_ENWRBUF(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PCCR2[2] (RW)
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PCCR2 field. */
#define LMEM_RD_PCCCR_PCCR2(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PCCR2_MASK) >> LMEM_PCCCR_PCCR2_SHIFT)
#define LMEM_BRD_PCCCR_PCCR2(base) (LMEM_RD_PCCCR_PCCR2(base))

/*! @brief Set the PCCR2 field to a new value. */
#define LMEM_WR_PCCCR_PCCR2(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PCCR2_MASK, LMEM_PCCCR_PCCR2(value)))
#define LMEM_BWR_PCCCR_PCCR2(base, value) (LMEM_WR_PCCCR_PCCR2(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PCCR3[3] (RW)
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PCCR3 field. */
#define LMEM_RD_PCCCR_PCCR3(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PCCR3_MASK) >> LMEM_PCCCR_PCCR3_SHIFT)
#define LMEM_BRD_PCCCR_PCCR3(base) (LMEM_RD_PCCCR_PCCR3(base))

/*! @brief Set the PCCR3 field to a new value. */
#define LMEM_WR_PCCCR_PCCR3(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PCCR3_MASK, LMEM_PCCCR_PCCR3(value)))
#define LMEM_BWR_PCCCR_PCCR3(base, value) (LMEM_WR_PCCCR_PCCR3(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field INVW0[24] (RW)
 *
 * If the PUSHW0 and INVW0 bits are set, then after setting the GO bit, push all
 * modified lines in way 0 and invalidate all lines in way 0 (clear way 0).
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, invalidate all lines in way 0.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_INVW0 field. */
#define LMEM_RD_PCCCR_INVW0(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_INVW0_MASK) >> LMEM_PCCCR_INVW0_SHIFT)
#define LMEM_BRD_PCCCR_INVW0(base) (LMEM_RD_PCCCR_INVW0(base))

/*! @brief Set the INVW0 field to a new value. */
#define LMEM_WR_PCCCR_INVW0(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_INVW0_MASK, LMEM_PCCCR_INVW0(value)))
#define LMEM_BWR_PCCCR_INVW0(base, value) (LMEM_WR_PCCCR_INVW0(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PUSHW0[25] (RW)
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, push all modified lines in way 0
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PUSHW0 field. */
#define LMEM_RD_PCCCR_PUSHW0(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PUSHW0_MASK) >> LMEM_PCCCR_PUSHW0_SHIFT)
#define LMEM_BRD_PCCCR_PUSHW0(base) (LMEM_RD_PCCCR_PUSHW0(base))

/*! @brief Set the PUSHW0 field to a new value. */
#define LMEM_WR_PCCCR_PUSHW0(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PUSHW0_MASK, LMEM_PCCCR_PUSHW0(value)))
#define LMEM_BWR_PCCCR_PUSHW0(base, value) (LMEM_WR_PCCCR_PUSHW0(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field INVW1[26] (RW)
 *
 * If the PUSHW1 and INVW1 bits are set, then after setting the GO bit, push all
 * modified lines in way 1 and invalidate all lines in way 1 (clear way 1).
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, invalidate all lines in way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_INVW1 field. */
#define LMEM_RD_PCCCR_INVW1(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_INVW1_MASK) >> LMEM_PCCCR_INVW1_SHIFT)
#define LMEM_BRD_PCCCR_INVW1(base) (LMEM_RD_PCCCR_INVW1(base))

/*! @brief Set the INVW1 field to a new value. */
#define LMEM_WR_PCCCR_INVW1(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_INVW1_MASK, LMEM_PCCCR_INVW1(value)))
#define LMEM_BWR_PCCCR_INVW1(base, value) (LMEM_WR_PCCCR_INVW1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PUSHW1[27] (RW)
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, push all modified lines in way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PUSHW1 field. */
#define LMEM_RD_PCCCR_PUSHW1(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PUSHW1_MASK) >> LMEM_PCCCR_PUSHW1_SHIFT)
#define LMEM_BRD_PCCCR_PUSHW1(base) (LMEM_RD_PCCCR_PUSHW1(base))

/*! @brief Set the PUSHW1 field to a new value. */
#define LMEM_WR_PCCCR_PUSHW1(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PUSHW1_MASK, LMEM_PCCCR_PUSHW1(value)))
#define LMEM_BWR_PCCCR_PUSHW1(base, value) (LMEM_WR_PCCCR_PUSHW1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field GO[31] (RW)
 *
 * Setting this bit initiates the cache command indicated by bits 27-24. Reading
 * this bit indicates if a command is active This bit stays set until the
 * command completes. Writing zero has no effect.
 *
 * Values:
 * - 0b0 - Write: no effect. Read: no cache command active.
 * - 0b1 - Write: initiate command indicated by bits 27-24. Read: cache command
 *     active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_GO field. */
#define LMEM_RD_PCCCR_GO(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_GO_MASK) >> LMEM_PCCCR_GO_SHIFT)
#define LMEM_BRD_PCCCR_GO(base) (LMEM_RD_PCCCR_GO(base))

/*! @brief Set the GO field to a new value. */
#define LMEM_WR_PCCCR_GO(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_GO_MASK, LMEM_PCCCR_GO(value)))
#define LMEM_BWR_PCCCR_GO(base, value) (LMEM_WR_PCCCR_GO(base, value))
/*@}*/

