whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the ENCACHE field to a new value. */
#define LMEM_WR_PSCCR_ENCACHE(base, value) (LMEM_RMW_PSCCR(base, LMEM_PSCCR_ENCACHE_MASK, LMEM_PSCCR_ENCACHE(value)))
#define LMEM_BWR_PSCCR_ENCACHE(base, value) (LMEM_WR_PSCCR_ENCACHE(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCCR, field ENWRBUF[1] (RW)
 *
 * Values:
 * - 0b0 - Write buffer disabled
 * - 0b1 - Write buffer enabled
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCCR_ENWRBUF field. */
#define LMEM_RD_PSCCR_ENWRBUF(base) ((LMEM_PSCCR_REG(base) & LMEM_PSCCR_ENWRBUF_MASK) >> LMEM_PSCCR_ENWRBUF_SHIFT)
#define LMEM_BRD_PSCCR_ENWRBUF(base) (LMEM_RD_PSCCR_ENWRBUF(base))

/*! @brief Set the ENWRBUF field to a new value. */
#define LMEM_WR_PSCCR_ENWRBUF(base, value) (LMEM_RMW_PSCCR(base, LMEM_PSCCR_ENWRBUF_MASK, LMEM_PSCCR_ENWRBUF(value)))
#define LMEM_BWR_PSCCR_ENWRBUF(base, value) (LMEM_WR_PSCCR_ENWRBUF(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCCR, field INVW0[24] (RW)
 *
 * If the PUSHW0 and INVW0 bits are set, then after setting the GO bit, push all
 * modified lines in way 0 and invalidate all lines in way 0 (clear way 0).
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, invalidate all lines in way 0.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCCR_INVW0 field. */
#define LMEM_RD_PSCCR_INVW0(base) ((LMEM_PSCCR_REG(base) & LMEM_PSCCR_INVW0_MASK) >> LMEM_PSCCR_INVW0_SHIFT)
#define LMEM_BRD_PSCCR_INVW0(base) (LMEM_RD_PSCCR_INVW0(base))

/*! @brief Set the INVW0 field to a new value. */
#define LMEM_WR_PSCCR_INVW0(base, value) (LMEM_RMW_PSCCR(base, LMEM_PSCCR_INVW0_MASK, LMEM_PSCCR_INVW0(value)))
#define LMEM_BWR_PSCCR_INVW0(base, value) (LMEM_WR_PSCCR_INVW0(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCCR, field PUSHW0[25] (RW)
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, push all modified lines in way 0
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCCR_PUSHW0 field. */
#define LMEM_RD_PSCCR_PUSHW0(base) ((LMEM_PSCCR_REG(base) & LMEM_PSCCR_PUSHW0_MASK) >> LMEM_PSCCR_PUSHW0_SHIFT)
#define LMEM_BRD_PSCCR_PUSHW0(base) (LMEM_RD_PSCCR_PUSHW0(base))

/*! @brief Set the PUSHW0 field to a new value. */
#define LMEM_WR_PSCCR_PUSHW0(base, value) (LMEM_RMW_PSCCR(base, LMEM_PSCCR_PUSHW0_MASK, LMEM_PSCCR_PUSHW0(value)))
#define LMEM_BWR_PSCCR_PUSHW0(base, value) (LMEM_WR_PSCCR_PUSHW0(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCCR, field INVW1[26] (RW)
 *
 * If the PUSHW1 and INVW1 bits are set, then after setting the GO bit, push all
 * modified lines in way 1 and invalidate all lines in way 1 (clear way 1).
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, invalidate all lines in way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCCR_INVW1 field. */
#define LMEM_RD_PSCCR_INVW1(base) ((LMEM_PSCCR_REG(base) & LMEM_PSCCR_INVW1_MASK) >> LMEM_PSCCR_INVW1_SHIFT)
#define LMEM_BRD_PSCCR_INVW1(base) (LMEM_RD_PSCCR_INVW1(base))

/*! @brief Set the INVW1 field to a new value. */
#define LMEM_WR_PSCCR_INVW1(base, value) (LMEM_RMW_PSCCR(base, LMEM_PSCCR_INVW1_MASK, LMEM_PSCCR_INVW1(value)))
#define LMEM_BWR_PSCCR_INVW1(base, value) (LMEM_WR_PSCCR_INVW1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCCR, field PUSHW1[27] (RW)
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, push all modified lines in way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCCR_PUSHW1 field. */
#define LMEM_RD_PSCCR_PUSHW1(base) ((LMEM_PSCCR_REG(base) & LMEM_PSCCR_PUSHW1_MASK) >> LMEM_PSCCR_PUSHW1_SHIFT)
#define LMEM_BRD_PSCCR_PUSHW1(base) (LMEM_RD_PSCCR_PUSHW1(base))

/*! @brief Set the PUSHW1 field to a new value. */
#define LMEM_WR_PSCCR_PUSHW1(base, value) (LMEM_RMW_PSCCR(base, LMEM_PSCCR_PUSHW1_MASK, LMEM_PSCCR_PUSHW1(value)))
#define LMEM_BWR_PSCCR_PUSHW1(base, value) (LMEM_WR_PSCCR_PUSHW1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCCR, field GO[31] (RW)
 *
 * Setting this bit initiates the cache command indicated by bits 27-24. Reading
 * this bit indicates if a command is active This bit stays set until the
 * command completes. Writing zero has no effect.
 *
 * Values:
 * - 0b0 - Write: no effect. Read: no cache command active.
 * - 0b1 - Write: initiate command indicated by bits 27-24. Read: cache command
 *     active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCCR_GO field. */
#define LMEM_RD_PSCCR_GO(base) ((LMEM_PSCCR_REG(base) & LMEM_PSCCR_GO_MASK) >> LMEM_PSCCR_GO_SHIFT)
#define LMEM_BRD_PSCCR_GO(base) (LMEM_RD_PSCCR_GO(base))

/*! @brief Set the GO field to a new value. */
#define LMEM_WR_PSCCR_GO(base, value) (LMEM_RMW_PSCCR(base, LMEM_PSCCR_GO_MASK, LMEM_PSCCR_GO(value)))
#define LMEM_BWR_PSCCR_GO(base, value) (LMEM_WR_PSCCR_GO(base, value))
/*@}*/

/*******************************************************************************
 * LMEM_PSCLCR - Cache line control register
 ******************************************************************************/

/*!
 * @brief LMEM_PSCLCR - Cache line control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines specific line-sized cache operations to be performed
 * using a specific cache line address or a physical address. If a physical address
 * is specified, both ways of the cache are searched, and the command is only
 * performed on the way which hits.
 */
/*!
 * @name Constants and macros for entire LMEM_PSCLCR register
 */
/*@{*/
#define LMEM_RD_PSCLCR(base)     (LMEM_PSCLCR_REG(base))
#define LMEM_WR_PSCLCR(base, value) (LMEM_PSCLCR_REG(base) = (value))
#define LMEM_RMW_PSCLCR(base, mask, value) (LMEM_WR_PSCLCR(base, (LMEM_RD_PSCLCR(base) & ~(mask)) | (value)))
#define LMEM_SET_PSCLCR(base, value) (LMEM_WR_PSCLCR(base, LMEM_RD_PSCLCR(base) |  (value)))
#define LMEM_CLR_PSCLCR(base, value) (LMEM_WR_PSCLCR(base, LMEM_RD_PSCLCR(base) & ~(value)))
#define LMEM_TOG_PSCLCR(base, value) (LMEM_WR_PSCLCR(base, LMEM_RD_PSCLCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LMEM_PSCLCR bitfields
 */

/*!
 * @name Register LMEM_PSCLCR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CSAR[LGO]
 *
 * Values:
 * - 0b0 - Write: no effect. Read: no line command active.
 * - 0b1 - Write: initiate line command indicated by bits 27-24. Read: line
 *     command active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_LGO field. */
#define LMEM_RD_PSCLCR_LGO(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_LGO_MASK) >> LMEM_PSCLCR_LGO_SHIFT)
#define LMEM_BRD_PSCLCR_LGO(base) (LMEM_RD_PSCLCR_LGO(base))

/*! @brief Set the LGO field to a new value. */
#define LMEM_WR_PSCLCR_LGO(base, value) (LMEM_RMW_PSCLCR(base, LMEM_PSCLCR_LGO_MASK, LMEM_PSCLCR_LGO(value)))
#define LMEM_BWR_PSCLCR_LGO(base, value) (LMEM_WR_PSCLCR_LGO(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field CACHEADDR[11:2] (RW)
 *
 * CLCR[11:4] bits are used to access the tag arrays CLCR[11:2] bits are used to
 * access the data arrays
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_CACHEADDR field. */
#define LMEM_RD_PSCLCR_CACHEADDR(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_CACHEADDR_MASK) >> LMEM_PSCLCR_CACHEADDR_SHIFT)
#define LMEM_BRD_PSCLCR_CACHEADDR(base) (LMEM_RD_PSCLCR_CACHEADDR(base))

