whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual LMEM_PSCSAR bitfields
 */

/*!
 * @name Register LMEM_PSCSAR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CLCR[LGO]
 *
 * Values:
 * - 0b0 - Write: no effect. Read: no line command active.
 * - 0b1 - Write: initiate line command indicated by bits CLCR[27:24]. Read:
 *     line command active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCSAR_LGO field. */
#define LMEM_RD_PSCSAR_LGO(base) ((LMEM_PSCSAR_REG(base) & LMEM_PSCSAR_LGO_MASK) >> LMEM_PSCSAR_LGO_SHIFT)
#define LMEM_BRD_PSCSAR_LGO(base) (LMEM_RD_PSCSAR_LGO(base))

/*! @brief Set the LGO field to a new value. */
#define LMEM_WR_PSCSAR_LGO(base, value) (LMEM_RMW_PSCSAR(base, LMEM_PSCSAR_LGO_MASK, LMEM_PSCSAR_LGO(value)))
#define LMEM_BWR_PSCSAR_LGO(base, value) (LMEM_WR_PSCSAR_LGO(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCSAR, field PHYADDR[31:2] (RW)
 *
 * PHYADDR represents bits [31:2] of the system address. CSAR[31:12] bits are
 * used for tag compare CSAR[11:4] bits are used to access the tag arrays
 * CSAR[11:2] bits are used to access the data arrays
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCSAR_PHYADDR field. */
#define LMEM_RD_PSCSAR_PHYADDR(base) ((LMEM_PSCSAR_REG(base) & LMEM_PSCSAR_PHYADDR_MASK) >> LMEM_PSCSAR_PHYADDR_SHIFT)
#define LMEM_BRD_PSCSAR_PHYADDR(base) (LMEM_RD_PSCSAR_PHYADDR(base))

/*! @brief Set the PHYADDR field to a new value. */
#define LMEM_WR_PSCSAR_PHYADDR(base, value) (LMEM_RMW_PSCSAR(base, LMEM_PSCSAR_PHYADDR_MASK, LMEM_PSCSAR_PHYADDR(value)))
#define LMEM_BWR_PSCSAR_PHYADDR(base, value) (LMEM_WR_PSCSAR_PHYADDR(base, value))
/*@}*/

/*******************************************************************************
 * LMEM_PSCCVR - Cache read/write value register
 ******************************************************************************/

/*!
 * @brief LMEM_PSCCVR - Cache read/write value register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CCVR register is used to source write data or return read data for the
 * commands specified in the CLCR register.
 */
/*!
 * @name Constants and macros for entire LMEM_PSCCVR register
 */
/*@{*/
#define LMEM_RD_PSCCVR(base)     (LMEM_PSCCVR_REG(base))
#define LMEM_WR_PSCCVR(base, value) (LMEM_PSCCVR_REG(base) = (value))
#define LMEM_RMW_PSCCVR(base, mask, value) (LMEM_WR_PSCCVR(base, (LMEM_RD_PSCCVR(base) & ~(mask)) | (value)))
#define LMEM_SET_PSCCVR(base, value) (LMEM_WR_PSCCVR(base, LMEM_RD_PSCCVR(base) |  (value)))
#define LMEM_CLR_PSCCVR(base, value) (LMEM_WR_PSCCVR(base, LMEM_RD_PSCCVR(base) & ~(value)))
#define LMEM_TOG_PSCCVR(base, value) (LMEM_WR_PSCCVR(base, LMEM_RD_PSCCVR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * LMEM_PSCRMR - Cache regions mode register
 ******************************************************************************/

/*!
 * @brief LMEM_PSCRMR - Cache regions mode register (RW)
 *
 * Reset value: 0xAA0FA000U
 *
 * The CRMR register allows you to demote the cache mode of various subregions
 * within the device's memory map. Demoting the cache mode reduces the cache
 * function applied to a memory region from write-back to write-through to
 * non-cacheable. After a region is demoted, its cache mode can only be raised by a reset,
 * which returns it to its default state. To maintain cache coherency, changes to
 * the cache mode should be completed while the address space being changed is
 * not being accessed or the cache is disabled. Before a cache mode change,
 * complete a cache clear all command to push and invalidate any cache entries that may
 * have changed. The address/module assignment of the 16 subregions is
 * device-specific and are detailed in the Chip Configuration section. Some of the regions
 * may not be used (non-cacheable), and some regions may not be capable of
 * write-back.
 */
/*!
 * @name Constants and macros for entire LMEM_PSCRMR register
 */
/*@{*/
#define LMEM_RD_PSCRMR(base)     (LMEM_PSCRMR_REG(base))
#define LMEM_WR_PSCRMR(base, value) (LMEM_PSCRMR_REG(base) = (value))
#define LMEM_RMW_PSCRMR(base, mask, value) (LMEM_WR_PSCRMR(base, (LMEM_RD_PSCRMR(base) & ~(mask)) | (value)))
#define LMEM_SET_PSCRMR(base, value) (LMEM_WR_PSCRMR(base, LMEM_RD_PSCRMR(base) |  (value)))
#define LMEM_CLR_PSCRMR(base, value) (LMEM_WR_PSCRMR(base, LMEM_RD_PSCRMR(base) & ~(value)))
#define LMEM_TOG_PSCRMR(base, value) (LMEM_WR_PSCRMR(base, LMEM_RD_PSCRMR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LMEM_PSCRMR bitfields
 */

/*!
 * @name Register LMEM_PSCRMR, field R15[1:0] (RW)
 *
 * Controls the cache mode for region 15
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R15 field. */
#define LMEM_RD_PSCRMR_R15(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R15_MASK) >> LMEM_PSCRMR_R15_SHIFT)
#define LMEM_BRD_PSCRMR_R15(base) (LMEM_RD_PSCRMR_R15(base))

/*! @brief Set the R15 field to a new value. */
#define LMEM_WR_PSCRMR_R15(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R15_MASK, LMEM_PSCRMR_R15(value)))
#define LMEM_BWR_PSCRMR_R15(base, value) (LMEM_WR_PSCRMR_R15(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R14[3:2] (RW)
 *
 * Controls the cache mode for region 14
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R14 field. */
#define LMEM_RD_PSCRMR_R14(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R14_MASK) >> LMEM_PSCRMR_R14_SHIFT)
#define LMEM_BRD_PSCRMR_R14(base) (LMEM_RD_PSCRMR_R14(base))

/*! @brief Set the R14 field to a new value. */
#define LMEM_WR_PSCRMR_R14(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R14_MASK, LMEM_PSCRMR_R14(value)))
#define LMEM_BWR_PSCRMR_R14(base, value) (LMEM_WR_PSCRMR_R14(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R13[5:4] (RW)
 *
 * Controls the cache mode for region 13
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R13 field. */
#define LMEM_RD_PSCRMR_R13(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R13_MASK) >> LMEM_PSCRMR_R13_SHIFT)
#define LMEM_BRD_PSCRMR_R13(base) (LMEM_RD_PSCRMR_R13(base))

/*! @brief Set the R13 field to a new value. */
#define LMEM_WR_PSCRMR_R13(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R13_MASK, LMEM_PSCRMR_R13(value)))
#define LMEM_BWR_PSCRMR_R13(base, value) (LMEM_WR_PSCRMR_R13(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R12[7:6] (RW)
 *
 * Controls the cache mode for region 12
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R12 field. */
#define LMEM_RD_PSCRMR_R12(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R12_MASK) >> LMEM_PSCRMR_R12_SHIFT)
#define LMEM_BRD_PSCRMR_R12(base) (LMEM_RD_PSCRMR_R12(base))

/*! @brief Set the R12 field to a new value. */
#define LMEM_WR_PSCRMR_R12(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R12_MASK, LMEM_PSCRMR_R12(value)))
#define LMEM_BWR_PSCRMR_R12(base, value) (LMEM_WR_PSCRMR_R12(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R11[9:8] (RW)
 *
 * Controls the cache mode for region 11
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R11 field. */
#define LMEM_RD_PSCRMR_R11(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R11_MASK) >> LMEM_PSCRMR_R11_SHIFT)
#define LMEM_BRD_PSCRMR_R11(base) (LMEM_RD_PSCRMR_R11(base))

/*! @brief Set the R11 field to a new value. */
#define LMEM_WR_PSCRMR_R11(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R11_MASK, LMEM_PSCRMR_R11(value)))
#define LMEM_BWR_PSCRMR_R11(base, value) (LMEM_WR_PSCRMR_R11(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R10[11:10] (RW)
 *
 * Controls the cache mode for region 10
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R10 field. */
#define LMEM_RD_PSCRMR_R10(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R10_MASK) >> LMEM_PSCRMR_R10_SHIFT)
#define LMEM_BRD_PSCRMR_R10(base) (LMEM_RD_PSCRMR_R10(base))

/*! @brief Set the R10 field to a new value. */
#define LMEM_WR_PSCRMR_R10(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R10_MASK, LMEM_PSCRMR_R10(value)))
#define LMEM_BWR_PSCRMR_R10(base, value) (LMEM_WR_PSCRMR_R10(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R9[13:12] (RW)
 *
 * Controls the cache mode for region 9
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R9 field. */
#define LMEM_RD_PSCRMR_R9(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R9_MASK) >> LMEM_PSCRMR_R9_SHIFT)
#define LMEM_BRD_PSCRMR_R9(base) (LMEM_RD_PSCRMR_R9(base))

/*! @brief Set the R9 field to a new value. */
#define LMEM_WR_PSCRMR_R9(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R9_MASK, LMEM_PSCRMR_R9(value)))
#define LMEM_BWR_PSCRMR_R9(base, value) (LMEM_WR_PSCRMR_R9(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R8[15:14] (RW)
 *
 * Controls the cache mode for region 8
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R8 field. */
#define LMEM_RD_PSCRMR_R8(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R8_MASK) >> LMEM_PSCRMR_R8_SHIFT)
#define LMEM_BRD_PSCRMR_R8(base) (LMEM_RD_PSCRMR_R8(base))

/*! @brief Set the R8 field to a new value. */
#define LMEM_WR_PSCRMR_R8(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R8_MASK, LMEM_PSCRMR_R8(value)))
#define LMEM_BWR_PSCRMR_R8(base, value) (LMEM_WR_PSCRMR_R8(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R7[17:16] (RW)
 *
 * Controls the cache mode for region 7
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R7 field. */
#define LMEM_RD_PSCRMR_R7(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R7_MASK) >> LMEM_PSCRMR_R7_SHIFT)
#define LMEM_BRD_PSCRMR_R7(base) (LMEM_RD_PSCRMR_R7(base))

