whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LPUART_WATER - LPUART Watermark Register
 ******************************************************************************/

/*!
 * @brief LPUART_WATER - LPUART Watermark Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register provides the ability to set a programmable threshold for
 * notification of needing additional transmit data. This register may be read at any
 * time but must be written only when CTRL[TE] is not set.
 */
/*!
 * @name Constants and macros for entire LPUART_WATER register
 */
/*@{*/
#define LPUART_RD_WATER(base)    (LPUART_WATER_REG(base))
#define LPUART_WR_WATER(base, value) (LPUART_WATER_REG(base) = (value))
#define LPUART_RMW_WATER(base, mask, value) (LPUART_WR_WATER(base, (LPUART_RD_WATER(base) & ~(mask)) | (value)))
#define LPUART_SET_WATER(base, value) (BME_OR32(&LPUART_WATER_REG(base), (uint32_t)(value)))
#define LPUART_CLR_WATER(base, value) (BME_AND32(&LPUART_WATER_REG(base), (uint32_t)(~(value))))
#define LPUART_TOG_WATER(base, value) (BME_XOR32(&LPUART_WATER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPUART_WATER bitfields
 */

/*!
 * @name Register LPUART_WATER, field TXWATER[7:0] (RW)
 *
 * When the number of datawords in the transmit FIFO/buffer is equal to or less
 * than the value in this register field, an interrupt or a DMA request is
 * generated. For proper operation, the value in TXWATER must be set to be less than
 * the size of the transmit buffer/FIFO size as indicated by FIFO[TXFIFOSIZE] and
 * FIFO[TXFE].
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_TXWATER field. */
#define LPUART_RD_WATER_TXWATER(base) ((LPUART_WATER_REG(base) & LPUART_WATER_TXWATER_MASK) >> LPUART_WATER_TXWATER_SHIFT)
#define LPUART_BRD_WATER_TXWATER(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_TXWATER_SHIFT, LPUART_WATER_TXWATER_WIDTH))

/*! @brief Set the TXWATER field to a new value. */
#define LPUART_WR_WATER_TXWATER(base, value) (LPUART_RMW_WATER(base, LPUART_WATER_TXWATER_MASK, LPUART_WATER_TXWATER(value)))
#define LPUART_BWR_WATER_TXWATER(base, value) (BME_BFI32(&LPUART_WATER_REG(base), ((uint32_t)(value) << LPUART_WATER_TXWATER_SHIFT), LPUART_WATER_TXWATER_SHIFT, LPUART_WATER_TXWATER_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_WATER, field TXCOUNT[15:8] (RO)
 *
 * The value in this register indicates the number of datawords that are in the
 * transmit FIFO/buffer. If a dataword is being transmitted, that is, in the
 * transmit shift register, it is not included in the count. This value may be used
 * in conjunction with FIFO[TXFIFOSIZE] to calculate how much room is left in the
 * transmit FIFO/buffer.
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_TXCOUNT field. */
#define LPUART_RD_WATER_TXCOUNT(base) ((LPUART_WATER_REG(base) & LPUART_WATER_TXCOUNT_MASK) >> LPUART_WATER_TXCOUNT_SHIFT)
#define LPUART_BRD_WATER_TXCOUNT(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_TXCOUNT_SHIFT, LPUART_WATER_TXCOUNT_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_WATER, field RXWATER[23:16] (RW)
 *
 * When the number of datawords in the receive FIFO/buffer is equal to or
 * greater than the value in this register field, an interrupt or a DMA request is
 * generated. For proper operation, the value in RXWATER must be set to be less than
 * the receive FIFO/buffer size as indicated by FIFO[RXFIFOSIZE] and FIFO[RXFE]
 * and must be greater than 0.
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_RXWATER field. */
#define LPUART_RD_WATER_RXWATER(base) ((LPUART_WATER_REG(base) & LPUART_WATER_RXWATER_MASK) >> LPUART_WATER_RXWATER_SHIFT)
#define LPUART_BRD_WATER_RXWATER(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_RXWATER_SHIFT, LPUART_WATER_RXWATER_WIDTH))

/*! @brief Set the RXWATER field to a new value. */
#define LPUART_WR_WATER_RXWATER(base, value) (LPUART_RMW_WATER(base, LPUART_WATER_RXWATER_MASK, LPUART_WATER_RXWATER(value)))
#define LPUART_BWR_WATER_RXWATER(base, value) (BME_BFI32(&LPUART_WATER_REG(base), ((uint32_t)(value) << LPUART_WATER_RXWATER_SHIFT), LPUART_WATER_RXWATER_SHIFT, LPUART_WATER_RXWATER_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_WATER, field RXCOUNT[31:24] (RO)
 *
 * The value in this register indicates the number of datawords that are in the
 * receive FIFO/buffer. If a dataword is being received, that is, in the receive
 * shift register, it is not included in the count. This value may be used in
 * conjunction with FIFO[RXFIFOSIZE] to calculate how much room is left in the
 * receive FIFO/buffer.
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_RXCOUNT field. */
#define LPUART_RD_WATER_RXCOUNT(base) ((LPUART_WATER_REG(base) & LPUART_WATER_RXCOUNT_MASK) >> LPUART_WATER_RXCOUNT_SHIFT)
#define LPUART_BRD_WATER_RXCOUNT(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_RXCOUNT_SHIFT, LPUART_WATER_RXCOUNT_WIDTH))
/*@}*/

/*
 * MK82F25615 LTC
 *
 * LTC
 *
 * Registers defined in this header file:
 * - LTC_MD - LTC Mode Register (non-PKHA/non-RNG use)
 * - LTC_MDPK - LTC Mode Register (PublicKey)
 * - LTC_KS - LTC Key Size Register
 * - LTC_DS - LTC Data Size Register
 * - LTC_ICVS - LTC ICV Size Register
 * - LTC_COM - LTC Command Register
 * - LTC_CTL - LTC Control Register
 * - LTC_CW - LTC Clear Written Register
 * - LTC_STA - LTC Status Register
 * - LTC_ESTA - LTC Error Status Register
 * - LTC_AADSZ - LTC AAD Size Register
 * - LTC_IVSZ - LTC IV Size Register
 * - LTC_DPAMS - LTC DPA Mask Seed Register
 * - LTC_PKASZ - LTC PKHA A Size Register
 * - LTC_PKBSZ - LTC PKHA B Size Register
 * - LTC_PKNSZ - LTC PKHA N Size Register
 * - LTC_PKESZ - LTC PKHA E Size Register
 * - LTC_CTX - LTC Context Register
 * - LTC_KEY - LTC Key Registers
 * - LTC_RNG4_DRNG_STATUS - LTC RNG4 DRNG Status
 * - LTC_RNG4_DRNG_INTERVAL_0 - LTC RNG4 DRNG Interval 0 Register
 * - LTC_RNG4_DRNG_INTERVAL_1 - LTC RNG4 DRNG Interval 1 Register
 * - LTC_RNG4_DRNG_HASH_CONTROL - LTC RNG4 DRNG Hash Control Register
 * - LTC_RNG4_DRNG_HASH_DIGEST - LTC RNG4 DRNG Hash Digest Register
 * - LTC_RNG4_DRNG_DEBUG_BUFFER - LTC RNG4 DRNG Debug Buffer
 * - LTC_VID1 - LTC Version ID Register
 * - LTC_CHAVID - LTC CHA Version ID Register
 * - LTC_FIFOSTA - LTC FIFO Status Register
 * - LTC_IFIFO - LTC Input Data FIFO
 * - LTC_OFIFO - LTC Output Data FIFO
 * - LTC_PKA - LTC PKHA A 0 Register
 * - LTC_PKA0 - LTC PKHA A0 0 Register
 * - LTC_PKA1 - LTC PKHA A1 0 Register
 * - LTC_PKA2 - LTC PKHA A2 0 Register
 * - LTC_PKA3 - LTC PKHA A3 0 Register
 * - LTC_PKB - LTC PKHA B 0 Register
 * - LTC_PKB0 - LTC PKHA B0 0 Register
 * - LTC_PKB1 - LTC PKHA B1 0 Register
 * - LTC_PKB2 - LTC PKHA B2 0 Register
 * - LTC_PKB3 - LTC PKHA B3 0 Register
 * - LTC_PKN - LTC PKHA N 0 Register
 * - LTC_PKN0 - LTC PKHA N0 0 Register
 * - LTC_PKN1 - LTC PKHA N1 0 Register
 * - LTC_PKN2 - LTC PKHA N2 0 Register
 * - LTC_PKN3 - LTC PKHA N3 0 Register
 * - LTC_PKE - LTC PKHA E 0 Register
 * - LTC_PKE0 - LTC PKHA E0 0 Register
 * - LTC_PKE1 - LTC PKHA E1 0 Register
 * - LTC_PKE2 - LTC PKHA E2 0 Register
 * - LTC_PKE3 - LTC PKHA E3 0 Register
 */

