whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
#define LTC_INSTANCE_COUNT (1U) /*!< Number of instances of the LTC module. */
#define LTC0_IDX (0U) /*!< Instance number for LTC0. */

/*******************************************************************************
 * LTC_MDPK - LTC Mode Register (PublicKey)
 ******************************************************************************/

/*!
 * @brief LTC_MDPK - LTC Mode Register (PublicKey) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Mode Register is used to tell the CHAs which operation is being
 * requested. The interpretation of this register is for public key operations (PKHA)
 * only, and is described herein. The bit assignments for the PKHA_MODE will be
 * different depending on which of the three types of PKHA functions is being called.
 * The three function types are: 1) Clear Memory, 2) Modular Arithmetic, and 3)
 * Copy Memory. Detailed descriptions of their mode formats can be found in Table
 * , Table and Table .
 */
/*!
 * @name Constants and macros for entire LTC_MDPK register
 */
/*@{*/
#define LTC_RD_MDPK(base)        (LTC_MDPK_REG(base))
#define LTC_WR_MDPK(base, value) (LTC_MDPK_REG(base) = (value))
#define LTC_RMW_MDPK(base, mask, value) (LTC_WR_MDPK(base, (LTC_RD_MDPK(base) & ~(mask)) | (value)))
#define LTC_SET_MDPK(base, value) (BME_OR32(&LTC_MDPK_REG(base), (uint32_t)(value)))
#define LTC_CLR_MDPK(base, value) (BME_AND32(&LTC_MDPK_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_MDPK(base, value) (BME_XOR32(&LTC_MDPK_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_MDPK bitfields
 */

/*!
 * @name Register LTC_MDPK, field PKHA_MODE_LS[11:0] (RW)
 *
 * PKHA_MODE least significant 12 bits. The format of the PKHA_MODE field
 * differs depending on which of the three types of PKHA functions is being executed.
 * The three function types are: 1) Clear Memory, 2) Modular Arithmetic, and 3)
 * Copy Memory. Detailed descriptions of their mode formats can be found in Table ,
 * Table and Table .
 */
/*@{*/
/*! @brief Read current value of the LTC_MDPK_PKHA_MODE_LS field. */
#define LTC_RD_MDPK_PKHA_MODE_LS(base) ((LTC_MDPK_REG(base) & LTC_MDPK_PKHA_MODE_LS_MASK) >> LTC_MDPK_PKHA_MODE_LS_SHIFT)
#define LTC_BRD_MDPK_PKHA_MODE_LS(base) (LTC_RD_MDPK_PKHA_MODE_LS(base))

/*! @brief Set the PKHA_MODE_LS field to a new value. */
#define LTC_WR_MDPK_PKHA_MODE_LS(base, value) (LTC_RMW_MDPK(base, LTC_MDPK_PKHA_MODE_LS_MASK, LTC_MDPK_PKHA_MODE_LS(value)))
#define LTC_BWR_MDPK_PKHA_MODE_LS(base, value) (LTC_WR_MDPK_PKHA_MODE_LS(base, value))
/*@}*/

/*!
 * @name Register LTC_MDPK, field PKHA_MODE_MS[19:16] (RW)
 *
 * PKHA_MODE most-significant 4 bits. The format of the PKHA_MODE field differs
 * depending on which of the three types of PKHA functions is being executed. The
 * three function types are: 1) Clear Memory, 2) Modular Arithmetic, and 3) Copy
 * Memory. Detailed descriptions of their mode formats can be found in Table ,
 * Table and Table .
 */
/*@{*/
/*! @brief Read current value of the LTC_MDPK_PKHA_MODE_MS field. */
#define LTC_RD_MDPK_PKHA_MODE_MS(base) ((LTC_MDPK_REG(base) & LTC_MDPK_PKHA_MODE_MS_MASK) >> LTC_MDPK_PKHA_MODE_MS_SHIFT)
#define LTC_BRD_MDPK_PKHA_MODE_MS(base) (BME_UBFX32(&LTC_MDPK_REG(base), LTC_MDPK_PKHA_MODE_MS_SHIFT, LTC_MDPK_PKHA_MODE_MS_WIDTH))

/*! @brief Set the PKHA_MODE_MS field to a new value. */
#define LTC_WR_MDPK_PKHA_MODE_MS(base, value) (LTC_RMW_MDPK(base, LTC_MDPK_PKHA_MODE_MS_MASK, LTC_MDPK_PKHA_MODE_MS(value)))
#define LTC_BWR_MDPK_PKHA_MODE_MS(base, value) (BME_BFI32(&LTC_MDPK_REG(base), ((uint32_t)(value) << LTC_MDPK_PKHA_MODE_MS_SHIFT), LTC_MDPK_PKHA_MODE_MS_SHIFT, LTC_MDPK_PKHA_MODE_MS_WIDTH))
/*@}*/

/*!
 * @name Register LTC_MDPK, field ALG[23:20] (RW)
 *
 * Algorithm. This field specifies which algorithm is being selected.
 *
 * Values:
 * - 0b1000 - PKHA
 */
/*@{*/
#define LTC_MDPK_ALG_PKHA              (0x8U)        /*!< Bit field value for LTC_MDPK_ALG: PKHA */
/*! @brief Read current value of the LTC_MDPK_ALG field. */
#define LTC_RD_MDPK_ALG(base) ((LTC_MDPK_REG(base) & LTC_MDPK_ALG_MASK) >> LTC_MDPK_ALG_SHIFT)
#define LTC_BRD_MDPK_ALG(base) (BME_UBFX32(&LTC_MDPK_REG(base), LTC_MDPK_ALG_SHIFT, LTC_MDPK_ALG_WIDTH))

/*! @brief Set the ALG field to a new value. */
#define LTC_WR_MDPK_ALG(base, value) (LTC_RMW_MDPK(base, LTC_MDPK_ALG_MASK, LTC_MDPK_ALG(value)))
#define LTC_BWR_MDPK_ALG(base, value) (BME_BFI32(&LTC_MDPK_REG(base), ((uint32_t)(value) << LTC_MDPK_ALG_SHIFT), LTC_MDPK_ALG_SHIFT, LTC_MDPK_ALG_WIDTH))
/*@}*/

/*******************************************************************************
 * LTC_MD - LTC Mode Register (non-PKHA/non-RNG use)
 ******************************************************************************/

/*!
 * @brief LTC_MD - LTC Mode Register (non-PKHA/non-RNG use) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Mode Register is used to tell the cryptographic engines which operation
 * is being requested. The interpretation of this register will be unique for each
 * CHA. This section defines the format of the Mode Register when used with
 * non-public-key algorithms and non-RNG operations.
 */
/*!
 * @name Constants and macros for entire LTC_MD register
 */
/*@{*/
#define LTC_RD_MD(base)          (LTC_MD_REG(base))
#define LTC_WR_MD(base, value)   (LTC_MD_REG(base) = (value))
#define LTC_RMW_MD(base, mask, value) (LTC_WR_MD(base, (LTC_RD_MD(base) & ~(mask)) | (value)))
#define LTC_SET_MD(base, value)  (BME_OR32(&LTC_MD_REG(base), (uint32_t)(value)))
#define LTC_CLR_MD(base, value)  (BME_AND32(&LTC_MD_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_MD(base, value)  (BME_XOR32(&LTC_MD_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_MD bitfields
 */

/*!
 * @name Register LTC_MD, field ENC[0] (RW)
 *
 * Encrypt/Decrypt. This bit selects encryption or decryption.
 *
 * Values:
 * - 0b0 - Decrypt.
 * - 0b1 - Encrypt.
 */
/*@{*/
#define LTC_MD_ENC_DECRYPT             (0U)          /*!< Bit field value for LTC_MD_ENC: Decrypt. */
#define LTC_MD_ENC_ENCRYPT             (0x1U)        /*!< Bit field value for LTC_MD_ENC: Encrypt. */
/*! @brief Read current value of the LTC_MD_ENC field. */
#define LTC_RD_MD_ENC(base)  ((LTC_MD_REG(base) & LTC_MD_ENC_MASK) >> LTC_MD_ENC_SHIFT)
#define LTC_BRD_MD_ENC(base) (BME_UBFX32(&LTC_MD_REG(base), LTC_MD_ENC_SHIFT, LTC_MD_ENC_WIDTH))

/*! @brief Set the ENC field to a new value. */
#define LTC_WR_MD_ENC(base, value) (LTC_RMW_MD(base, LTC_MD_ENC_MASK, LTC_MD_ENC(value)))
#define LTC_BWR_MD_ENC(base, value) (BME_BFI32(&LTC_MD_REG(base), ((uint32_t)(value) << LTC_MD_ENC_SHIFT), LTC_MD_ENC_SHIFT, LTC_MD_ENC_WIDTH))
/*@}*/

/*!
 * @name Register LTC_MD, field ICV_TEST[1] (RW)
 *
 * ICV Checking / Test AES fault detection. For algorithms other than AES ECB
 * mode: ICV CheckingThis bit selects whether the current algorithm should compare
 * the known ICV versus the calculated ICV. This bit will be ignored by
 * algorithms that do not support ICV checking.0 - Don't compare1 - CompareFor AES ECB
 * mode: Test AES fault detectionIn AES ECB mode, this bit activates fault detection
 * testing by injecting bit level errors into AES core logic as defined in the
 * first 128 bits of the context.0 - Don't inject bit errors1 - Inject bit errors
 */
/*@{*/
/*! @brief Read current value of the LTC_MD_ICV_TEST field. */
#define LTC_RD_MD_ICV_TEST(base) ((LTC_MD_REG(base) & LTC_MD_ICV_TEST_MASK) >> LTC_MD_ICV_TEST_SHIFT)
#define LTC_BRD_MD_ICV_TEST(base) (BME_UBFX32(&LTC_MD_REG(base), LTC_MD_ICV_TEST_SHIFT, LTC_MD_ICV_TEST_WIDTH))

