whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_CW - LTC Clear Written Register
 ******************************************************************************/

/*!
 * @brief LTC_CW - LTC Clear Written Register (WO)
 *
 * Reset value: 0x00000000U
 *
 * The Clear Written Register is used to clear many of the internal registers.
 * All fields of this register are self-clearing.
 */
/*!
 * @name Constants and macros for entire LTC_CW register
 */
/*@{*/
#define LTC_WR_CW(base, value)   (LTC_CW_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual LTC_CW bitfields
 */

/*!
 * @name Register LTC_CW, field CM[0] (WO)
 *
 * Clear the Mode Register. Writing a one to this bit causes the Mode Register
 * to be cleared.
 */
/*@{*/
/*! @brief Set the CM field to a new value. */
#define LTC_WR_CW_CM(base, value) (LTC_WR_CW(base, LTC_CW_CM(value)))
#define LTC_BWR_CW_CM(base, value) (LTC_WR_CW_CM(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CDS[2] (WO)
 *
 * Clear the Data Size Register. Writing a one to this bit causes the Data Size
 * Register to be cleared. This clears AAD Size as well.
 */
/*@{*/
/*! @brief Set the CDS field to a new value. */
#define LTC_WR_CW_CDS(base, value) (LTC_WR_CW(base, LTC_CW_CDS(value)))
#define LTC_BWR_CW_CDS(base, value) (LTC_WR_CW_CDS(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CICV[3] (WO)
 *
 * Clear the ICV Size Register. Writing a one to this bit causes the ICV Size
 * Register to be cleared.
 */
/*@{*/
/*! @brief Set the CICV field to a new value. */
#define LTC_WR_CW_CICV(base, value) (LTC_WR_CW(base, LTC_CW_CICV(value)))
#define LTC_BWR_CW_CICV(base, value) (LTC_WR_CW_CICV(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CCR[5] (WO)
 *
 * Clear the Context Register. Writing a one to this bit causes the Context
 * Register to be cleared.
 */
/*@{*/
/*! @brief Set the CCR field to a new value. */
#define LTC_WR_CW_CCR(base, value) (LTC_WR_CW(base, LTC_CW_CCR(value)))
#define LTC_BWR_CW_CCR(base, value) (LTC_WR_CW_CCR(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CKR[6] (WO)
 *
 * Clear the Key Register. Writing a one to this bit causes the Key and Key Size
 * Registers to be cleared.
 */
/*@{*/
/*! @brief Set the CKR field to a new value. */
#define LTC_WR_CW_CKR(base, value) (LTC_WR_CW(base, LTC_CW_CKR(value)))
#define LTC_BWR_CW_CKR(base, value) (LTC_WR_CW_CKR(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CPKA[12] (WO)
 *
 * Clear the PKHA A Size Register. Writing a one to this bit causes the PKHA A
 * Size Register to be cleared.
 */
/*@{*/
/*! @brief Set the CPKA field to a new value. */
#define LTC_WR_CW_CPKA(base, value) (LTC_WR_CW(base, LTC_CW_CPKA(value)))
#define LTC_BWR_CW_CPKA(base, value) (LTC_WR_CW_CPKA(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CPKB[13] (WO)
 *
 * Clear the PKHA B Size Register. Writing a one to this bit causes the PKHA B
 * Size Register to be cleared.
 */
/*@{*/
/*! @brief Set the CPKB field to a new value. */
#define LTC_WR_CW_CPKB(base, value) (LTC_WR_CW(base, LTC_CW_CPKB(value)))
#define LTC_BWR_CW_CPKB(base, value) (LTC_WR_CW_CPKB(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CPKN[14] (WO)
 *
 * Clear the PKHA N Size Register. Writing a one to this bit causes the PKHA N
 * Size Register to be cleared.
 */
/*@{*/
/*! @brief Set the CPKN field to a new value. */
#define LTC_WR_CW_CPKN(base, value) (LTC_WR_CW(base, LTC_CW_CPKN(value)))
#define LTC_BWR_CW_CPKN(base, value) (LTC_WR_CW_CPKN(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CPKE[15] (WO)
 *
 * Clear the PKHA E Size Register. Writing a one to this bit causes the PKHA E
 * Size Register to be cleared.
 */
/*@{*/
/*! @brief Set the CPKE field to a new value. */
#define LTC_WR_CW_CPKE(base, value) (LTC_WR_CW(base, LTC_CW_CPKE(value)))
#define LTC_BWR_CW_CPKE(base, value) (LTC_WR_CW_CPKE(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field COF[30] (WO)
 *
 * Clear Output FIFO. Writing a 1 to this bit causes the Output FIFO to be
 * cleared.
 */
/*@{*/
/*! @brief Set the COF field to a new value. */
#define LTC_WR_CW_COF(base, value) (LTC_WR_CW(base, LTC_CW_COF(value)))
#define LTC_BWR_CW_COF(base, value) (LTC_WR_CW_COF(base, value))
/*@}*/

/*!
 * @name Register LTC_CW, field CIF[31] (WO)
 *
 * Clear Input FIFO. Writing a 1 to this bit causes the Input Data FIFO.
 */
/*@{*/
/*! @brief Set the CIF field to a new value. */
#define LTC_WR_CW_CIF(base, value) (LTC_WR_CW(base, LTC_CW_CIF(value)))
#define LTC_BWR_CW_CIF(base, value) (LTC_WR_CW_CIF(base, value))
/*@}*/

/*******************************************************************************
 * LTC_STA - LTC Status Register
 ******************************************************************************/

/*!
 * @brief LTC_STA - LTC Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC Status Register shows the status of the internal Crypto engine and
 * its internal registers.
 */
/*!
 * @name Constants and macros for entire LTC_STA register
 */
/*@{*/
#define LTC_RD_STA(base)         (LTC_STA_REG(base))
#define LTC_WR_STA(base, value)  (LTC_STA_REG(base) = (value))
#define LTC_RMW_STA(base, mask, value) (LTC_WR_STA(base, (LTC_RD_STA(base) & ~(mask)) | (value)))
#define LTC_SET_STA(base, value) (BME_OR32(&LTC_STA_REG(base), (uint32_t)(value)))
#define LTC_CLR_STA(base, value) (BME_AND32(&LTC_STA_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_STA(base, value) (BME_XOR32(&LTC_STA_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_STA bitfields
 */

/*!
 * @name Register LTC_STA, field AB[1] (RO)
 *
 * AESA Busy. This bit indicates that the AES Accelertor is busy. The CHA can
 * either be busy processing data or resetting.
 *
 * Values:
 * - 0b0 - AESA Idle
 * - 0b1 - AESA Busy.
 */
/*@{*/
#define LTC_STA_AB_AESA_IDLE           (0U)          /*!< Bit field value for LTC_STA_AB: AESA Idle */
#define LTC_STA_AB_AESA_BUSY           (0x1U)        /*!< Bit field value for LTC_STA_AB: AESA Busy. */
/*! @brief Read current value of the LTC_STA_AB field. */
#define LTC_RD_STA_AB(base)  ((LTC_STA_REG(base) & LTC_STA_AB_MASK) >> LTC_STA_AB_SHIFT)
#define LTC_BRD_STA_AB(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_AB_SHIFT, LTC_STA_AB_WIDTH))
/*@}*/

/*!
 * @name Register LTC_STA, field DB[2] (RO)
 *
 * DESA Busy. This bit indicates that the DES Accelerator is busy. The CHA can
 * either be busy processing data or resetting.
 *
 * Values:
 * - 0b0 - DESA Idle
 * - 0b1 - DESA Busy.
 */
/*@{*/
#define LTC_STA_DB_DESA_IDLE           (0U)          /*!< Bit field value for LTC_STA_DB: DESA Idle */
#define LTC_STA_DB_DESA_BUSY           (0x1U)        /*!< Bit field value for LTC_STA_DB: DESA Busy. */
/*! @brief Read current value of the LTC_STA_DB field. */
#define LTC_RD_STA_DB(base)  ((LTC_STA_REG(base) & LTC_STA_DB_MASK) >> LTC_STA_DB_SHIFT)
#define LTC_BRD_STA_DB(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_DB_SHIFT, LTC_STA_DB_WIDTH))
/*@}*/

/*!
 * @name Register LTC_STA, field PB[6] (RO)
 *
 * PKHA Busy. This bit indicates that the Public Key Hardware Accelerator is
 * busy. The CHA can either be busy processing data or resetting.
 *
 * Values:
 * - 0b0 - PKHA Idle
 * - 0b1 - PKHA Busy.
 */
/*@{*/
#define LTC_STA_PB_PKHA_IDLE           (0U)          /*!< Bit field value for LTC_STA_PB: PKHA Idle */
#define LTC_STA_PB_PKHA_BUSY           (0x1U)        /*!< Bit field value for LTC_STA_PB: PKHA Busy. */
/*! @brief Read current value of the LTC_STA_PB field. */
#define LTC_RD_STA_PB(base)  ((LTC_STA_REG(base) & LTC_STA_PB_MASK) >> LTC_STA_PB_SHIFT)
#define LTC_BRD_STA_PB(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_PB_SHIFT, LTC_STA_PB_WIDTH))
/*@}*/

/*!
 * @name Register LTC_STA, field DI[16] (W1C)
 *
 * Done Interrupt. The Done Interrupt has been asserted. ValueReadWrite0No Done
 * InterruptNo change1Done Interrupt assertedClear the Done Interrupt
 */
/*@{*/
/*! @brief Read current value of the LTC_STA_DI field. */
#define LTC_RD_STA_DI(base)  ((LTC_STA_REG(base) & LTC_STA_DI_MASK) >> LTC_STA_DI_SHIFT)
#define LTC_BRD_STA_DI(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_DI_SHIFT, LTC_STA_DI_WIDTH))

/*! @brief Set the DI field to a new value. */
#define LTC_WR_STA_DI(base, value) (LTC_RMW_STA(base, LTC_STA_DI_MASK, LTC_STA_DI(value)))
#define LTC_BWR_STA_DI(base, value) (BME_BFI32(&LTC_STA_REG(base), ((uint32_t)(value) << LTC_STA_DI_SHIFT), LTC_STA_DI_SHIFT, LTC_STA_DI_WIDTH))
/*@}*/

/*!
 * @name Register LTC_STA, field EI[20] (RO)
 *
 * Error Interrupt. The Error Interrupt has been asserted. This error can only
 * be cleared by resetting LTC.
 *
 * Values:
 * - 0b0 - Not Error.
 * - 0b1 - Error Interrupt.
 */
/*@{*/
#define LTC_STA_EI_NOT_ERROR_INT       (0U)          /*!< Bit field value for LTC_STA_EI: Not Error. */
#define LTC_STA_EI_ERROR_INT           (0x1U)        /*!< Bit field value for LTC_STA_EI: Error Interrupt. */
/*! @brief Read current value of the LTC_STA_EI field. */
#define LTC_RD_STA_EI(base)  ((LTC_STA_REG(base) & LTC_STA_EI_MASK) >> LTC_STA_EI_SHIFT)
#define LTC_BRD_STA_EI(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_EI_SHIFT, LTC_STA_EI_WIDTH))
/*@}*/

/*!
 * @name Register LTC_STA, field PKP[28] (RO)
 *
 * Public Key is Prime. The given number is probably prime (that is, it passes
 * the Miller-Rabin primality test).
 */
/*@{*/
/*! @brief Read current value of the LTC_STA_PKP field. */
#define LTC_RD_STA_PKP(base) ((LTC_STA_REG(base) & LTC_STA_PKP_MASK) >> LTC_STA_PKP_SHIFT)
#define LTC_BRD_STA_PKP(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_PKP_SHIFT, LTC_STA_PKP_WIDTH))
/*@}*/

/*!
 * @name Register LTC_STA, field PKO[29] (RO)
 *
 * Public Key Operation is One. The greatest common divisor of two numbers is
 * one (that is, the two numbers are relatively prime) for GCD operation, or PKHA
 * result = 1 for Finite Field operations.
 */
/*@{*/
/*! @brief Read current value of the LTC_STA_PKO field. */
#define LTC_RD_STA_PKO(base) ((LTC_STA_REG(base) & LTC_STA_PKO_MASK) >> LTC_STA_PKO_SHIFT)
#define LTC_BRD_STA_PKO(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_PKO_SHIFT, LTC_STA_PKO_WIDTH))
/*@}*/

/*!
 * @name Register LTC_STA, field PKZ[30] (RO)
 *
 * Public Key Operation is Zero. For Finite Field operations the result of a
 * Public Key operation is zero. For ECC operations, the result is Point at infinity.
 */
/*@{*/
/*! @brief Read current value of the LTC_STA_PKZ field. */
#define LTC_RD_STA_PKZ(base) ((LTC_STA_REG(base) & LTC_STA_PKZ_MASK) >> LTC_STA_PKZ_SHIFT)
#define LTC_BRD_STA_PKZ(base) (BME_UBFX32(&LTC_STA_REG(base), LTC_STA_PKZ_SHIFT, LTC_STA_PKZ_WIDTH))
/*@}*/

