whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_ESTA - LTC Error Status Register
 ******************************************************************************/

/*!
 * @brief LTC_ESTA - LTC Error Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The LTC Error Register shows the status of the internal Crypto Engine and its
 * internal registers.
 */
/*!
 * @name Constants and macros for entire LTC_ESTA register
 */
/*@{*/
#define LTC_RD_ESTA(base)        (LTC_ESTA_REG(base))
/*@}*/

/*
 * Constants & macros for individual LTC_ESTA bitfields
 */

/*!
 * @name Register LTC_ESTA, field ERRID1[3:0] (RO)
 *
 * Error ID 1. These bits indicate the type of error that was found while
 * processing the Descriptor. The Algorithm that is associated with the error can be
 * found in the CL1 field.Others reserved.
 *
 * Values:
 * - 0b0001 - Mode Error
 * - 0b0010 - Data Size Error, including PKHA N Register Size Error
 * - 0b0011 - Key Size Error, including PKHA E Register Size Error
 * - 0b0100 - PKHA A Register Size Error
 * - 0b0101 - PKHA B Register Size Error
 * - 0b0110 - Data Arrived out of Sequence Error
 * - 0b0111 - PKHA Divide by Zero Error
 * - 0b1000 - PKHA Modulus Even Error
 * - 0b1001 - DES Key Parity Error
 * - 0b1010 - ICV Check Failed
 * - 0b1011 - Internal Hardware Failure
 * - 0b1100 - CCM AAD Size Error (either 1. AAD flag in B0 =1 and no AAD type
 *     provided, 2. AAD flag in B0 = 0 and AAD povided, or 3. AAD flag in B0 =1 and
 *     not enough AAD provided - expecting more based on AAD size.)
 * - 0b1111 - Invalid Crypto Engine Selected
 */
/*@{*/
#define LTC_ESTA_ERRID1_MODE_ERROR     (0x1U)        /*!< Bit field value for LTC_ESTA_ERRID1: Mode Error */
#define LTC_ESTA_ERRID1_DATA_SIZE_ERROR (0x2U)       /*!< Bit field value for LTC_ESTA_ERRID1: Data Size Error, including PKHA N Register Size Error */
#define LTC_ESTA_ERRID1_KEY_SIZE_ERROR (0x3U)        /*!< Bit field value for LTC_ESTA_ERRID1: Key Size Error, including PKHA E Register Size Error */
#define LTC_ESTA_ERRID1_PKHA_A_SIZE_ERROR (0x4U)     /*!< Bit field value for LTC_ESTA_ERRID1: PKHA A Register Size Error */
#define LTC_ESTA_ERRID1_PKHA_B_SIZE_ERROR (0x5U)     /*!< Bit field value for LTC_ESTA_ERRID1: PKHA B Register Size Error */
#define LTC_ESTA_ERRID1_DATA_OUT_OF_SEQ_ERROR (0x6U) /*!< Bit field value for LTC_ESTA_ERRID1: Data Arrived out of Sequence Error */
#define LTC_ESTA_ERRID1_PKHA_DIV_BY_0_ERROR (0x7U)   /*!< Bit field value for LTC_ESTA_ERRID1: PKHA Divide by Zero Error */
#define LTC_ESTA_ERRID1_PKHA_MOD_EVEN_ERROR (0x8U)   /*!< Bit field value for LTC_ESTA_ERRID1: PKHA Modulus Even Error */
#define LTC_ESTA_ERRID1_DES_KEY_PARITY_ERROR (0x9U)  /*!< Bit field value for LTC_ESTA_ERRID1: DES Key Parity Error */
#define LTC_ESTA_ERRID1_ICV_CHECK_FAIL (0xAU)        /*!< Bit field value for LTC_ESTA_ERRID1: ICV Check Failed */
#define LTC_ESTA_ERRID1_INTERNAL_HARD_FAIL (0xBU)    /*!< Bit field value for LTC_ESTA_ERRID1: Internal Hardware Failure */
#define LTC_ESTA_ERRID1_CCM_AAD_SIZE_ERROR (0xCU)    /*!< Bit field value for LTC_ESTA_ERRID1: CCM AAD Size Error (either 1. AAD flag in B0 =1 and no AAD type provided, 2. AAD flag in B0 = 0 and AAD povided, or 3. AAD flag in B0 =1 and not enough AAD provided - expecting more based on AAD size.) */
#define LTC_ESTA_ERRID1_INVALID_ENGINE_SEL_ERROR (0xFU) /*!< Bit field value for LTC_ESTA_ERRID1: Invalid Crypto Engine Selected */
/*! @brief Read current value of the LTC_ESTA_ERRID1 field. */
#define LTC_RD_ESTA_ERRID1(base) ((LTC_ESTA_REG(base) & LTC_ESTA_ERRID1_MASK) >> LTC_ESTA_ERRID1_SHIFT)
#define LTC_BRD_ESTA_ERRID1(base) (BME_UBFX32(&LTC_ESTA_REG(base), LTC_ESTA_ERRID1_SHIFT, LTC_ESTA_ERRID1_WIDTH))
/*@}*/

/*!
 * @name Register LTC_ESTA, field CL1[11:8] (RO)
 *
 * algorithms. The algorithms field indicates which algorithm is asserting an
 * error.Others reserved
 *
 * Values:
 * - 0b0000 - LTC General Error
 * - 0b0001 - AES
 * - 0b0010 - DES
 * - 0b1000 - Public Key
 */
/*@{*/
#define LTC_ESTA_CL1_GEN_ERROR         (0U)          /*!< Bit field value for LTC_ESTA_CL1: LTC General Error */
#define LTC_ESTA_CL1_AES_ERROR         (0x1U)        /*!< Bit field value for LTC_ESTA_CL1: AES */
#define LTC_ESTA_CL1_DES_ERROR         (0x2U)        /*!< Bit field value for LTC_ESTA_CL1: DES */
#define LTC_ESTA_CL1_PKHA_ERROR        (0x8U)        /*!< Bit field value for LTC_ESTA_CL1: Public Key */
/*! @brief Read current value of the LTC_ESTA_CL1 field. */
#define LTC_RD_ESTA_CL1(base) ((LTC_ESTA_REG(base) & LTC_ESTA_CL1_MASK) >> LTC_ESTA_CL1_SHIFT)
#define LTC_BRD_ESTA_CL1(base) (BME_UBFX32(&LTC_ESTA_REG(base), LTC_ESTA_CL1_SHIFT, LTC_ESTA_CL1_WIDTH))
/*@}*/

/*******************************************************************************
 * LTC_AADSZ - LTC AAD Size Register
 ******************************************************************************/

/*!
 * @brief LTC_AADSZ - LTC AAD Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The AAD Size Register is used by AESA to determine how much of the last block
 * of AAD is valid. The write to this register should be the entire size of the
 * AAD as it is also added directly to the Data Size Register. The size added to
 * the Data Size Register is the AAD size rounded up to the next 16 byte
 * boundary. For instance a size of 20 bytes written to the AAD size register will cause
 * 32 bytes to be added to the Data Size Register. The size stored in the AADSZ
 * field represents the number of bytes valid in the final block of AAD. However
 * the entire size of AAD should be written to the Register address location. When
 * authentication only is being done then the AL bit needs to be written to tell
 * the AES engine that this is the last of the data.
 */
/*!
 * @name Constants and macros for entire LTC_AADSZ register
 */
/*@{*/
#define LTC_RD_AADSZ(base)       (LTC_AADSZ_REG(base))
#define LTC_WR_AADSZ(base, value) (LTC_AADSZ_REG(base) = (value))
#define LTC_RMW_AADSZ(base, mask, value) (LTC_WR_AADSZ(base, (LTC_RD_AADSZ(base) & ~(mask)) | (value)))
#define LTC_SET_AADSZ(base, value) (BME_OR32(&LTC_AADSZ_REG(base), (uint32_t)(value)))
#define LTC_CLR_AADSZ(base, value) (BME_AND32(&LTC_AADSZ_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_AADSZ(base, value) (BME_XOR32(&LTC_AADSZ_REG(base), (uint32_t)(value)))
/*@}*/

