whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual LTC_AADSZ bitfields
 */

/*!
 * @name Register LTC_AADSZ, field AADSZ[3:0] (RW)
 *
 * AAD size in Bytes, mod 16.
 */
/*@{*/
/*! @brief Read current value of the LTC_AADSZ_AADSZ field. */
#define LTC_RD_AADSZ_AADSZ(base) ((LTC_AADSZ_REG(base) & LTC_AADSZ_AADSZ_MASK) >> LTC_AADSZ_AADSZ_SHIFT)
#define LTC_BRD_AADSZ_AADSZ(base) (BME_UBFX32(&LTC_AADSZ_REG(base), LTC_AADSZ_AADSZ_SHIFT, LTC_AADSZ_AADSZ_WIDTH))

/*! @brief Set the AADSZ field to a new value. */
#define LTC_WR_AADSZ_AADSZ(base, value) (LTC_RMW_AADSZ(base, LTC_AADSZ_AADSZ_MASK, LTC_AADSZ_AADSZ(value)))
#define LTC_BWR_AADSZ_AADSZ(base, value) (BME_BFI32(&LTC_AADSZ_REG(base), ((uint32_t)(value) << LTC_AADSZ_AADSZ_SHIFT), LTC_AADSZ_AADSZ_SHIFT, LTC_AADSZ_AADSZ_WIDTH))
/*@}*/

/*!
 * @name Register LTC_AADSZ, field AL[31] (RW)
 *
 * AAD Last. Only AAD data will be written into the Input FIFO.
 */
/*@{*/
/*! @brief Read current value of the LTC_AADSZ_AL field. */
#define LTC_RD_AADSZ_AL(base) ((LTC_AADSZ_REG(base) & LTC_AADSZ_AL_MASK) >> LTC_AADSZ_AL_SHIFT)
#define LTC_BRD_AADSZ_AL(base) (BME_UBFX32(&LTC_AADSZ_REG(base), LTC_AADSZ_AL_SHIFT, LTC_AADSZ_AL_WIDTH))

/*! @brief Set the AL field to a new value. */
#define LTC_WR_AADSZ_AL(base, value) (LTC_RMW_AADSZ(base, LTC_AADSZ_AL_MASK, LTC_AADSZ_AL(value)))
#define LTC_BWR_AADSZ_AL(base, value) (BME_BFI32(&LTC_AADSZ_REG(base), ((uint32_t)(value) << LTC_AADSZ_AL_SHIFT), LTC_AADSZ_AL_SHIFT, LTC_AADSZ_AL_WIDTH))
/*@}*/

/*******************************************************************************
 * LTC_IVSZ - LTC IV Size Register
 ******************************************************************************/

/*!
 * @brief LTC_IVSZ - LTC IV Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The IV Size Register is used by AESA to determine how much of the last block
 * of IV is valid. The write to this register should be the entire size of the IV
 * as it is also added directly to the Data Size Register. The size added to the
 * Data Size Register is the IV size rounded up to the next 16 byte boundary.
 * For instance a size of 20 bytes written to the IV size register will cause 32
 * bytes to be added to the Data Size Register. The size stored in the IVSZ field
 * represents the number of bytes valid in the final block of IV. However the
 * entire size of IV should be written to the Register address location. When IV only
 * is being done then the IL bit needs to be written to tell the AES engine that
 * this is the last of the data.
 */
/*!
 * @name Constants and macros for entire LTC_IVSZ register
 */
/*@{*/
#define LTC_RD_IVSZ(base)        (LTC_IVSZ_REG(base))
#define LTC_WR_IVSZ(base, value) (LTC_IVSZ_REG(base) = (value))
#define LTC_RMW_IVSZ(base, mask, value) (LTC_WR_IVSZ(base, (LTC_RD_IVSZ(base) & ~(mask)) | (value)))
#define LTC_SET_IVSZ(base, value) (BME_OR32(&LTC_IVSZ_REG(base), (uint32_t)(value)))
#define LTC_CLR_IVSZ(base, value) (BME_AND32(&LTC_IVSZ_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_IVSZ(base, value) (BME_XOR32(&LTC_IVSZ_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_IVSZ bitfields
 */

/*!
 * @name Register LTC_IVSZ, field IVSZ[3:0] (RW)
 *
 * IV size in Bytes, mod 16.
 */
/*@{*/
/*! @brief Read current value of the LTC_IVSZ_IVSZ field. */
#define LTC_RD_IVSZ_IVSZ(base) ((LTC_IVSZ_REG(base) & LTC_IVSZ_IVSZ_MASK) >> LTC_IVSZ_IVSZ_SHIFT)
#define LTC_BRD_IVSZ_IVSZ(base) (BME_UBFX32(&LTC_IVSZ_REG(base), LTC_IVSZ_IVSZ_SHIFT, LTC_IVSZ_IVSZ_WIDTH))

/*! @brief Set the IVSZ field to a new value. */
#define LTC_WR_IVSZ_IVSZ(base, value) (LTC_RMW_IVSZ(base, LTC_IVSZ_IVSZ_MASK, LTC_IVSZ_IVSZ(value)))
#define LTC_BWR_IVSZ_IVSZ(base, value) (BME_BFI32(&LTC_IVSZ_REG(base), ((uint32_t)(value) << LTC_IVSZ_IVSZ_SHIFT), LTC_IVSZ_IVSZ_SHIFT, LTC_IVSZ_IVSZ_WIDTH))
/*@}*/

/*!
 * @name Register LTC_IVSZ, field IL[31] (RW)
 *
 * IV Last. Only IV data will be written into the Input FIFO.
 */
/*@{*/
/*! @brief Read current value of the LTC_IVSZ_IL field. */
#define LTC_RD_IVSZ_IL(base) ((LTC_IVSZ_REG(base) & LTC_IVSZ_IL_MASK) >> LTC_IVSZ_IL_SHIFT)
#define LTC_BRD_IVSZ_IL(base) (BME_UBFX32(&LTC_IVSZ_REG(base), LTC_IVSZ_IL_SHIFT, LTC_IVSZ_IL_WIDTH))

/*! @brief Set the IL field to a new value. */
#define LTC_WR_IVSZ_IL(base, value) (LTC_RMW_IVSZ(base, LTC_IVSZ_IL_MASK, LTC_IVSZ_IL(value)))
#define LTC_BWR_IVSZ_IL(base, value) (BME_BFI32(&LTC_IVSZ_REG(base), ((uint32_t)(value) << LTC_IVSZ_IL_SHIFT), LTC_IVSZ_IL_SHIFT, LTC_IVSZ_IL_WIDTH))
/*@}*/

/*******************************************************************************
 * LTC_DPAMS - LTC DPA Mask Seed Register
 ******************************************************************************/

/*!
 * @brief LTC_DPAMS - LTC DPA Mask Seed Register (WO)
 *
 * Reset value: 0x00000000U
 *
 * The DPA Mask Seed Register is used to reseed the mask that provides
 * resistance against Differential Power Analysis attacks on AES keys.
 */
/*!
 * @name Constants and macros for entire LTC_DPAMS register
 */
/*@{*/
#define LTC_WR_DPAMS(base, value) (LTC_DPAMS_REG(base) = (value))
/*@}*/

/*******************************************************************************
 * LTC_PKASZ - LTC PKHA A Size Register
 ******************************************************************************/

/*!
 * @brief LTC_PKASZ - LTC PKHA A Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA A Size Register is used to indicate the number of bytes of valid
 * data in the PKHA A Register. That is, it indicates the size, in bytes, of the
 * numeric value contained in the PKHA A Register. Depending on the PKHA
 * operation to be run, this register may need to be loaded prior to starting the PKHA
 * operation. Note that some PKHA operations update this value at the completion
 * of the operation.
 */
/*!
 * @name Constants and macros for entire LTC_PKASZ register
 */
/*@{*/
#define LTC_RD_PKASZ(base)       (LTC_PKASZ_REG(base))
#define LTC_WR_PKASZ(base, value) (LTC_PKASZ_REG(base) = (value))
#define LTC_RMW_PKASZ(base, mask, value) (LTC_WR_PKASZ(base, (LTC_RD_PKASZ(base) & ~(mask)) | (value)))
#define LTC_SET_PKASZ(base, value) (BME_OR32(&LTC_PKASZ_REG(base), (uint32_t)(value)))
#define LTC_CLR_PKASZ(base, value) (BME_AND32(&LTC_PKASZ_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_PKASZ(base, value) (BME_XOR32(&LTC_PKASZ_REG(base), (uint32_t)(value)))
/*@}*/

