whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual LTC_PKASZ bitfields
 */

/*!
 * @name Register LTC_PKASZ, field PKASZ[8:0] (RW)
 *
 * PKHA A Size. This is the size of the numeric value, in bytes, contained
 * within the PKHA A Register.
 */
/*@{*/
/*! @brief Read current value of the LTC_PKASZ_PKASZ field. */
#define LTC_RD_PKASZ_PKASZ(base) ((LTC_PKASZ_REG(base) & LTC_PKASZ_PKASZ_MASK) >> LTC_PKASZ_PKASZ_SHIFT)
#define LTC_BRD_PKASZ_PKASZ(base) (LTC_RD_PKASZ_PKASZ(base))

/*! @brief Set the PKASZ field to a new value. */
#define LTC_WR_PKASZ_PKASZ(base, value) (LTC_RMW_PKASZ(base, LTC_PKASZ_PKASZ_MASK, LTC_PKASZ_PKASZ(value)))
#define LTC_BWR_PKASZ_PKASZ(base, value) (LTC_WR_PKASZ_PKASZ(base, value))
/*@}*/

/*******************************************************************************
 * LTC_PKBSZ - LTC PKHA B Size Register
 ******************************************************************************/

/*!
 * @brief LTC_PKBSZ - LTC PKHA B Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA B Size Register is used to indicate the number of bytes of valid
 * data in the PKHA B Register. That is, it indicates the size, in bytes, of the
 * numeric value contained in the PKHA B Register. Depending on the PKHA
 * operation to be run, this register may need to be loaded prior to starting the PKHA
 * operation. Note that some PKHA operations update this value at the completion
 * of the operation.
 */
/*!
 * @name Constants and macros for entire LTC_PKBSZ register
 */
/*@{*/
#define LTC_RD_PKBSZ(base)       (LTC_PKBSZ_REG(base))
#define LTC_WR_PKBSZ(base, value) (LTC_PKBSZ_REG(base) = (value))
#define LTC_RMW_PKBSZ(base, mask, value) (LTC_WR_PKBSZ(base, (LTC_RD_PKBSZ(base) & ~(mask)) | (value)))
#define LTC_SET_PKBSZ(base, value) (BME_OR32(&LTC_PKBSZ_REG(base), (uint32_t)(value)))
#define LTC_CLR_PKBSZ(base, value) (BME_AND32(&LTC_PKBSZ_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_PKBSZ(base, value) (BME_XOR32(&LTC_PKBSZ_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_PKBSZ bitfields
 */

/*!
 * @name Register LTC_PKBSZ, field PKBSZ[8:0] (RW)
 *
 * PKHA B Size. This is the size of the numeric value, in bytes, contained
 * within the PKHA B Register.
 */
/*@{*/
/*! @brief Read current value of the LTC_PKBSZ_PKBSZ field. */
#define LTC_RD_PKBSZ_PKBSZ(base) ((LTC_PKBSZ_REG(base) & LTC_PKBSZ_PKBSZ_MASK) >> LTC_PKBSZ_PKBSZ_SHIFT)
#define LTC_BRD_PKBSZ_PKBSZ(base) (LTC_RD_PKBSZ_PKBSZ(base))

/*! @brief Set the PKBSZ field to a new value. */
#define LTC_WR_PKBSZ_PKBSZ(base, value) (LTC_RMW_PKBSZ(base, LTC_PKBSZ_PKBSZ_MASK, LTC_PKBSZ_PKBSZ(value)))
#define LTC_BWR_PKBSZ_PKBSZ(base, value) (LTC_WR_PKBSZ_PKBSZ(base, value))
/*@}*/

/*******************************************************************************
 * LTC_PKNSZ - LTC PKHA N Size Register
 ******************************************************************************/

/*!
 * @brief LTC_PKNSZ - LTC PKHA N Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA N Size Register is used to indicate the number of bytes of valid
 * data in the PKHA N Register. That is, it indicates the size, in bytes, of the
 * numeric value contained in the PKHA N Register. Depending on the PKHA
 * operation to be run, this register may need to be loaded prior to starting the PKHA
 * operation. Note that some PKHA operations update this value at the completion
 * of the operation.
 */
/*!
 * @name Constants and macros for entire LTC_PKNSZ register
 */
/*@{*/
#define LTC_RD_PKNSZ(base)       (LTC_PKNSZ_REG(base))
#define LTC_WR_PKNSZ(base, value) (LTC_PKNSZ_REG(base) = (value))
#define LTC_RMW_PKNSZ(base, mask, value) (LTC_WR_PKNSZ(base, (LTC_RD_PKNSZ(base) & ~(mask)) | (value)))
#define LTC_SET_PKNSZ(base, value) (BME_OR32(&LTC_PKNSZ_REG(base), (uint32_t)(value)))
#define LTC_CLR_PKNSZ(base, value) (BME_AND32(&LTC_PKNSZ_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_PKNSZ(base, value) (BME_XOR32(&LTC_PKNSZ_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_PKNSZ bitfields
 */

/*!
 * @name Register LTC_PKNSZ, field PKNSZ[8:0] (RW)
 *
 * PKHA N Size. This is the size of the numeric value, in bytes, contained
 * within the PKHA N Register.
 */
/*@{*/
/*! @brief Read current value of the LTC_PKNSZ_PKNSZ field. */
#define LTC_RD_PKNSZ_PKNSZ(base) ((LTC_PKNSZ_REG(base) & LTC_PKNSZ_PKNSZ_MASK) >> LTC_PKNSZ_PKNSZ_SHIFT)
#define LTC_BRD_PKNSZ_PKNSZ(base) (LTC_RD_PKNSZ_PKNSZ(base))

/*! @brief Set the PKNSZ field to a new value. */
#define LTC_WR_PKNSZ_PKNSZ(base, value) (LTC_RMW_PKNSZ(base, LTC_PKNSZ_PKNSZ_MASK, LTC_PKNSZ_PKNSZ(value)))
#define LTC_BWR_PKNSZ_PKNSZ(base, value) (LTC_WR_PKNSZ_PKNSZ(base, value))
/*@}*/

/*******************************************************************************
 * LTC_PKESZ - LTC PKHA E Size Register
 ******************************************************************************/

/*!
 * @brief LTC_PKESZ - LTC PKHA E Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA E Size Register is used to indicate the number of bytes of valid
 * data in the PKHA E Register. That is, it indicates the size, in bytes, of the
 * numeric value contained in the PKHA E Register. Depending on the PKHA
 * operation to be run, this register may need to be loaded prior to starting the PKHA
 * operation. Note that some PKHA operations update this value at the completion
 * of the operation.
 */
/*!
 * @name Constants and macros for entire LTC_PKESZ register
 */
/*@{*/
#define LTC_RD_PKESZ(base)       (LTC_PKESZ_REG(base))
#define LTC_WR_PKESZ(base, value) (LTC_PKESZ_REG(base) = (value))
#define LTC_RMW_PKESZ(base, mask, value) (LTC_WR_PKESZ(base, (LTC_RD_PKESZ(base) & ~(mask)) | (value)))
#define LTC_SET_PKESZ(base, value) (BME_OR32(&LTC_PKESZ_REG(base), (uint32_t)(value)))
#define LTC_CLR_PKESZ(base, value) (BME_AND32(&LTC_PKESZ_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_PKESZ(base, value) (BME_XOR32(&LTC_PKESZ_REG(base), (uint32_t)(value)))
/*@}*/

