whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual LTC_PKESZ bitfields
 */

/*!
 * @name Register LTC_PKESZ, field PKESZ[8:0] (RW)
 *
 * PKHA E Size. This is the size of the numeric value, in bytes, contained
 * within the PKHA E Register.
 */
/*@{*/
/*! @brief Read current value of the LTC_PKESZ_PKESZ field. */
#define LTC_RD_PKESZ_PKESZ(base) ((LTC_PKESZ_REG(base) & LTC_PKESZ_PKESZ_MASK) >> LTC_PKESZ_PKESZ_SHIFT)
#define LTC_BRD_PKESZ_PKESZ(base) (LTC_RD_PKESZ_PKESZ(base))

/*! @brief Set the PKESZ field to a new value. */
#define LTC_WR_PKESZ_PKESZ(base, value) (LTC_RMW_PKESZ(base, LTC_PKESZ_PKESZ_MASK, LTC_PKESZ_PKESZ(value)))
#define LTC_BWR_PKESZ_PKESZ(base, value) (LTC_WR_PKESZ_PKESZ(base, value))
/*@}*/

/*******************************************************************************
 * LTC_CTX - LTC Context Register
 ******************************************************************************/

/*!
 * @brief LTC_CTX - LTC Context Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Context Register holds the context for the internal crypto engine. This
 * register is 512 bits in length. The IP bus write to the Context Register is
 * accessible only as full-word reads or writes to sixteen 32-bit registers. The MSB
 * is located at offset 0100h with respect to the register page. The bit
 * assignments of this register are dependent on the algorithm, and in some cases the
 * mode of that algorithm. See the appropriate section for the Context Register
 * format used for that algorithm: AES ECB: Section AES CBC: Section AES CTR:
 * Section AES CCM: Section DES: Section Triple DES: Section
 */
/*!
 * @name Constants and macros for entire LTC_CTX register
 */
/*@{*/
#define LTC_RD_CTX(base, index)  (LTC_CTX_REG(base, index))
#define LTC_WR_CTX(base, index, value) (LTC_CTX_REG(base, index) = (value))
#define LTC_RMW_CTX(base, index, mask, value) (LTC_WR_CTX(base, index, (LTC_RD_CTX(base, index) & ~(mask)) | (value)))
#define LTC_SET_CTX(base, index, value) (BME_OR32(&LTC_CTX_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_CTX(base, index, value) (BME_AND32(&LTC_CTX_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_CTX(base, index, value) (BME_XOR32(&LTC_CTX_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_KEY - LTC Key Registers
 ******************************************************************************/

/*!
 * @brief LTC_KEY - LTC Key Registers (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Key Register normally holds the left-aligned key for the internal crypto
 * engine. The MSB is in offset 200h. The Key Register is 256 bits in length. The
 * IP bus write to the Context Register is accessible only as full-word reads or
 * writes to four 32-bit registers. Before the value in the Key Register can be
 * used in a cryptographic operation, the size of the key must be written into
 * the Key Size Register. Once the Key Size Register has been written, the Key
 * Register cannot be written again until the Key Size Register has been cleared.
 */
/*!
 * @name Constants and macros for entire LTC_KEY register
 */
/*@{*/
#define LTC_RD_KEY(base, index)  (LTC_KEY_REG(base, index))
#define LTC_WR_KEY(base, index, value) (LTC_KEY_REG(base, index) = (value))
#define LTC_RMW_KEY(base, index, mask, value) (LTC_WR_KEY(base, index, (LTC_RD_KEY(base, index) & ~(mask)) | (value)))
#define LTC_SET_KEY(base, index, value) (BME_OR32(&LTC_KEY_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_KEY(base, index, value) (BME_AND32(&LTC_KEY_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_KEY(base, index, value) (BME_XOR32(&LTC_KEY_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_RNG4_DRNG_STATUS - LTC RNG4 DRNG Status
 ******************************************************************************/

/*!
 * @brief LTC_RNG4_DRNG_STATUS - LTC RNG4 DRNG Status (RO)
 *
 * Reset value: 0x00000000U
 *
 * The DRNG Status Register contains information about the current status of the
 * DRNG portion of the RNG.
 */
/*!
 * @name Constants and macros for entire LTC_RNG4_DRNG_STATUS register
 */
/*@{*/
#define LTC_RD_RNG4_DRNG_STATUS(base) (LTC_RNG4_DRNG_STATUS_REG(base))
/*@}*/

/*
 * Constants & macros for individual LTC_RNG4_DRNG_STATUS bitfields
 */

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field IF0[0] (RO)
 *
 * Instantiated Flag 0. State Handle 0 has been instantiated.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_IF0 field. */
#define LTC_RD_RNG4_DRNG_STATUS_IF0(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_IF0_MASK) >> LTC_RNG4_DRNG_STATUS_IF0_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_IF0(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_IF0_SHIFT, LTC_RNG4_DRNG_STATUS_IF0_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field IF1[1] (RO)
 *
 * Instantiated Flag 1. State Handle 1 has been instantiated.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_IF1 field. */
#define LTC_RD_RNG4_DRNG_STATUS_IF1(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_IF1_MASK) >> LTC_RNG4_DRNG_STATUS_IF1_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_IF1(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_IF1_SHIFT, LTC_RNG4_DRNG_STATUS_IF1_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field PR0[4] (RO)
 *
 * Prediction Resistance State Handle 0. State Handle 0 has been instantiated to
 * support prediction resistance.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_PR0 field. */
#define LTC_RD_RNG4_DRNG_STATUS_PR0(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_PR0_MASK) >> LTC_RNG4_DRNG_STATUS_PR0_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_PR0(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_PR0_SHIFT, LTC_RNG4_DRNG_STATUS_PR0_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field PR1[5] (RO)
 *
 * Prediction Resistance State Handle 1. State Handle 1 has been instantiated to
 * support prediction resistance.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_PR1 field. */
#define LTC_RD_RNG4_DRNG_STATUS_PR1(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_PR1_MASK) >> LTC_RNG4_DRNG_STATUS_PR1_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_PR1(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_PR1_SHIFT, LTC_RNG4_DRNG_STATUS_PR1_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field TF0[8] (RO)
 *
 * Test Flag State Handle 0. State Handle 0 has been instantiated as a test
 * (deterministic) instance.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_TF0 field. */
#define LTC_RD_RNG4_DRNG_STATUS_TF0(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_TF0_MASK) >> LTC_RNG4_DRNG_STATUS_TF0_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_TF0(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_TF0_SHIFT, LTC_RNG4_DRNG_STATUS_TF0_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field TF1[9] (RO)
 *
 * Test Flag State Handle 1. State Handle 1 has been instantiated as a test
 * (deterministic) instance.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_TF1 field. */
#define LTC_RD_RNG4_DRNG_STATUS_TF1(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_TF1_MASK) >> LTC_RNG4_DRNG_STATUS_TF1_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_TF1(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_TF1_SHIFT, LTC_RNG4_DRNG_STATUS_TF1_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field ERRCODE[19:16] (RO)
 *
 * Error Code. These bits represent the current error in the RNG.No Error.Mode
 * Error.Data Size Error.Instantiate Error.No Instantiate Error.Test Instantiate
 * Error.Prediction Resistance Error.Prediction Resistance and Test Request
 * Error.Uninstantiate Error.Secure Key Generation Error.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_ERRCODE field. */
#define LTC_RD_RNG4_DRNG_STATUS_ERRCODE(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_ERRCODE_MASK) >> LTC_RNG4_DRNG_STATUS_ERRCODE_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_ERRCODE(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_ERRCODE_SHIFT, LTC_RNG4_DRNG_STATUS_ERRCODE_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_STATUS, field CE[20] (RO)
 *
 * Catastrophic Error. A catastrophic error will occur when the RNG gets a
 * hardware error while requesting new entropy and the current State handle is
 * instantiated as a non-test (non-deterministic) instance.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_STATUS_CE field. */
#define LTC_RD_RNG4_DRNG_STATUS_CE(base) ((LTC_RNG4_DRNG_STATUS_REG(base) & LTC_RNG4_DRNG_STATUS_CE_MASK) >> LTC_RNG4_DRNG_STATUS_CE_SHIFT)
#define LTC_BRD_RNG4_DRNG_STATUS_CE(base) (BME_UBFX32(&LTC_RNG4_DRNG_STATUS_REG(base), LTC_RNG4_DRNG_STATUS_CE_SHIFT, LTC_RNG4_DRNG_STATUS_CE_WIDTH))
/*@}*/

