whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_RNG4_DRNG_INTERVAL_0 - LTC RNG4 DRNG Interval 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_RNG4_DRNG_INTERVAL_0 - LTC RNG4 DRNG Interval 0 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG DRNG State Handle 0 Reseed Interval Regsiter shows the current value
 * of the reseed interval for State Handle 0. This value represents the number of
 * requests for random data from this State Handle before this State Handle is
 * automatically reseeded with entropy from the TRNG. The reset value is zero, but
 * a new reseed interval value is loaded when the RNG State Handle is
 * instantiated. If the value in the Data Size register is nonzero at the time when the
 * instantiation command is executed, Reseed Interval 0 Register will be loaded with
 * this value. If the value in the Data Size register is 0, the default reseed
 * interval value (10,000,000) is loaded into Reseed Interval 0 Register.
 */
/*!
 * @name Constants and macros for entire LTC_RNG4_DRNG_INTERVAL_0 register
 */
/*@{*/
#define LTC_RD_RNG4_DRNG_INTERVAL_0(base) (LTC_RNG4_DRNG_INTERVAL_0_REG(base))
/*@}*/

/*******************************************************************************
 * LTC_RNG4_DRNG_INTERVAL_1 - LTC RNG4 DRNG Interval 1 Register
 ******************************************************************************/

/*!
 * @brief LTC_RNG4_DRNG_INTERVAL_1 - LTC RNG4 DRNG Interval 1 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG DRNG State Handle 1 Reseed Interval Regsiter shows the current value
 * of the reseed interval for State Handle 1. This value represents the number of
 * requests for random data from this State Handle before this State Handle is
 * automatically reseeded with entropy from the TRNG. The reset value is zero, but
 * a new reseed interval value is loaded when the RNG State Handle is
 * instantiated. If the value in the Data Size register is nonzero at the time when the
 * instantiation command is executed, Reseed Interval 1 Register will be loaded with
 * this value. If the value in the Data Size register is 1, the default reseed
 * interval value (10,000,000) is loaded into Reseed Interval 1 Register.
 */
/*!
 * @name Constants and macros for entire LTC_RNG4_DRNG_INTERVAL_1 register
 */
/*@{*/
#define LTC_RD_RNG4_DRNG_INTERVAL_1(base) (LTC_RNG4_DRNG_INTERVAL_1_REG(base))
/*@}*/

/*******************************************************************************
 * LTC_RNG4_DRNG_HASH_CONTROL - LTC RNG4 DRNG Hash Control Register
 ******************************************************************************/

/*!
 * @brief LTC_RNG4_DRNG_HASH_CONTROL - LTC RNG4 DRNG Hash Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The RNG DRNG Hash Control Register is used to gain control of the SHA-256
 * hashing engine that is internal to the RNG. Once Hashing test mode is initialized
 * then the user can begin the hashing operation and poll for the done bit.
 */
/*!
 * @name Constants and macros for entire LTC_RNG4_DRNG_HASH_CONTROL register
 */
/*@{*/
#define LTC_RD_RNG4_DRNG_HASH_CONTROL(base) (LTC_RNG4_DRNG_HASH_CONTROL_REG(base))
#define LTC_WR_RNG4_DRNG_HASH_CONTROL(base, value) (LTC_RNG4_DRNG_HASH_CONTROL_REG(base) = (value))
#define LTC_RMW_RNG4_DRNG_HASH_CONTROL(base, mask, value) (LTC_WR_RNG4_DRNG_HASH_CONTROL(base, (LTC_RD_RNG4_DRNG_HASH_CONTROL(base) & ~(mask)) | (value)))
#define LTC_SET_RNG4_DRNG_HASH_CONTROL(base, value) (BME_OR32(&LTC_RNG4_DRNG_HASH_CONTROL_REG(base), (uint32_t)(value)))
#define LTC_CLR_RNG4_DRNG_HASH_CONTROL(base, value) (BME_AND32(&LTC_RNG4_DRNG_HASH_CONTROL_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_RNG4_DRNG_HASH_CONTROL(base, value) (BME_XOR32(&LTC_RNG4_DRNG_HASH_CONTROL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_RNG4_DRNG_HASH_CONTROL bitfields
 */

/*!
 * @name Register LTC_RNG4_DRNG_HASH_CONTROL, field HD[0] (RO)
 *
 * Hashing Done. This bit asserts when the hashing engine is done.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_HASH_CONTROL_HD field. */
#define LTC_RD_RNG4_DRNG_HASH_CONTROL_HD(base) ((LTC_RNG4_DRNG_HASH_CONTROL_REG(base) & LTC_RNG4_DRNG_HASH_CONTROL_HD_MASK) >> LTC_RNG4_DRNG_HASH_CONTROL_HD_SHIFT)
#define LTC_BRD_RNG4_DRNG_HASH_CONTROL_HD(base) (BME_UBFX32(&LTC_RNG4_DRNG_HASH_CONTROL_REG(base), LTC_RNG4_DRNG_HASH_CONTROL_HD_SHIFT, LTC_RNG4_DRNG_HASH_CONTROL_HD_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_HASH_CONTROL, field HB[1] (WO)
 *
 * Hashing Begin. Writing this bit will cause the Hashing Engine to begin
 * hashing.
 */
/*@{*/
/*! @brief Set the HB field to a new value. */
#define LTC_WR_RNG4_DRNG_HASH_CONTROL_HB(base, value) (LTC_RMW_RNG4_DRNG_HASH_CONTROL(base, LTC_RNG4_DRNG_HASH_CONTROL_HB_MASK, LTC_RNG4_DRNG_HASH_CONTROL_HB(value)))
#define LTC_BWR_RNG4_DRNG_HASH_CONTROL_HB(base, value) (LTC_WR_RNG4_DRNG_HASH_CONTROL_HB(base, value))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_HASH_CONTROL, field HI[2] (WO)
 *
 * Hashing Initialize. Writing this bit will initialize the Hashing Engine.
 */
/*@{*/
/*! @brief Set the HI field to a new value. */
#define LTC_WR_RNG4_DRNG_HASH_CONTROL_HI(base, value) (LTC_RMW_RNG4_DRNG_HASH_CONTROL(base, LTC_RNG4_DRNG_HASH_CONTROL_HI_MASK, LTC_RNG4_DRNG_HASH_CONTROL_HI(value)))
#define LTC_BWR_RNG4_DRNG_HASH_CONTROL_HI(base, value) (LTC_WR_RNG4_DRNG_HASH_CONTROL_HI(base, value))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_HASH_CONTROL, field HTM[3] (RW)
 *
 * Hashing Test Mode. Writing this bit will put RNG in Hashing Test Mode.
 */
/*@{*/
/*! @brief Read current value of the LTC_RNG4_DRNG_HASH_CONTROL_HTM field. */
#define LTC_RD_RNG4_DRNG_HASH_CONTROL_HTM(base) ((LTC_RNG4_DRNG_HASH_CONTROL_REG(base) & LTC_RNG4_DRNG_HASH_CONTROL_HTM_MASK) >> LTC_RNG4_DRNG_HASH_CONTROL_HTM_SHIFT)
#define LTC_BRD_RNG4_DRNG_HASH_CONTROL_HTM(base) (BME_UBFX32(&LTC_RNG4_DRNG_HASH_CONTROL_REG(base), LTC_RNG4_DRNG_HASH_CONTROL_HTM_SHIFT, LTC_RNG4_DRNG_HASH_CONTROL_HTM_WIDTH))

