whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the HTM field to a new value. */
#define LTC_WR_RNG4_DRNG_HASH_CONTROL_HTM(base, value) (LTC_RMW_RNG4_DRNG_HASH_CONTROL(base, LTC_RNG4_DRNG_HASH_CONTROL_HTM_MASK, LTC_RNG4_DRNG_HASH_CONTROL_HTM(value)))
#define LTC_BWR_RNG4_DRNG_HASH_CONTROL_HTM(base, value) (BME_BFI32(&LTC_RNG4_DRNG_HASH_CONTROL_REG(base), ((uint32_t)(value) << LTC_RNG4_DRNG_HASH_CONTROL_HTM_SHIFT), LTC_RNG4_DRNG_HASH_CONTROL_HTM_SHIFT, LTC_RNG4_DRNG_HASH_CONTROL_HTM_WIDTH))
/*@}*/

/*!
 * @name Register LTC_RNG4_DRNG_HASH_CONTROL, field HTC[4] (WO)
 *
 * Hashing Test Mode Clear. Writing this bit will take the RNG out of hashing
 * test mode.
 */
/*@{*/
/*! @brief Set the HTC field to a new value. */
#define LTC_WR_RNG4_DRNG_HASH_CONTROL_HTC(base, value) (LTC_RMW_RNG4_DRNG_HASH_CONTROL(base, LTC_RNG4_DRNG_HASH_CONTROL_HTC_MASK, LTC_RNG4_DRNG_HASH_CONTROL_HTC(value)))
#define LTC_BWR_RNG4_DRNG_HASH_CONTROL_HTC(base, value) (LTC_WR_RNG4_DRNG_HASH_CONTROL_HTC(base, value))
/*@}*/

/*******************************************************************************
 * LTC_RNG4_DRNG_HASH_DIGEST - LTC RNG4 DRNG Hash Digest Register
 ******************************************************************************/

/*!
 * @brief LTC_RNG4_DRNG_HASH_DIGEST - LTC RNG4 DRNG Hash Digest Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG DRNG Hash Digest Register allows user access to the eight 32-bit
 * message digest registers of the SHA-256 hashing engine that is internal to the
 * RNG. All eight registers are read in order from most-significant bits to
 * least-significant bits by reading this address eight times. These registers are only
 * readable while in Hashing Test Mode and when the Hashing Engine is done.
 */
/*!
 * @name Constants and macros for entire LTC_RNG4_DRNG_HASH_DIGEST register
 */
/*@{*/
#define LTC_RD_RNG4_DRNG_HASH_DIGEST(base) (LTC_RNG4_DRNG_HASH_DIGEST_REG(base))
/*@}*/

/*******************************************************************************
 * LTC_RNG4_DRNG_DEBUG_BUFFER - LTC RNG4 DRNG Debug Buffer
 ******************************************************************************/

/*!
 * @brief LTC_RNG4_DRNG_DEBUG_BUFFER - LTC RNG4 DRNG Debug Buffer (WO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG DRNG Debug Buffer allows access to the SHA-256 hashing engine that is
 * internal to the RNG for the purpose of conformance testing. To fill the
 * buffer this register must be written 16 times at this address. This register is
 * writable only while the RNG is in Hashing Test mode. This mode can be selected
 * via the RNG DRNG Hash Control Register.
 */
/*!
 * @name Constants and macros for entire LTC_RNG4_DRNG_DEBUG_BUFFER register
 */
/*@{*/
#define LTC_WR_RNG4_DRNG_DEBUG_BUFFER(base, value) (LTC_RNG4_DRNG_DEBUG_BUFFER_REG(base) = (value))
/*@}*/

/*******************************************************************************
 * LTC_VID1 - LTC Version ID Register
 ******************************************************************************/

/*!
 * @brief LTC_VID1 - LTC Version ID Register (RO)
 *
 * Reset value: 0x00340100U
 *
 * This register contains the ID for LTC and major and minor revision numbers.
 */
/*!
 * @name Constants and macros for entire LTC_VID1 register
 */
/*@{*/
#define LTC_RD_VID1(base)        (LTC_VID1_REG(base))
/*@}*/

/*
 * Constants & macros for individual LTC_VID1 bitfields
 */

/*!
 * @name Register LTC_VID1, field MIN_REV[7:0] (RO)
 *
 * Minor revision number(0x00).
 */
/*@{*/
/*! @brief Read current value of the LTC_VID1_MIN_REV field. */
#define LTC_RD_VID1_MIN_REV(base) ((LTC_VID1_REG(base) & LTC_VID1_MIN_REV_MASK) >> LTC_VID1_MIN_REV_SHIFT)
#define LTC_BRD_VID1_MIN_REV(base) (BME_UBFX32(&LTC_VID1_REG(base), LTC_VID1_MIN_REV_SHIFT, LTC_VID1_MIN_REV_WIDTH))
/*@}*/

/*!
 * @name Register LTC_VID1, field MAJ_REV[15:8] (RO)
 *
 * Major revision number(0x01).
 */
/*@{*/
/*! @brief Read current value of the LTC_VID1_MAJ_REV field. */
#define LTC_RD_VID1_MAJ_REV(base) ((LTC_VID1_REG(base) & LTC_VID1_MAJ_REV_MASK) >> LTC_VID1_MAJ_REV_SHIFT)
#define LTC_BRD_VID1_MAJ_REV(base) (BME_UBFX32(&LTC_VID1_REG(base), LTC_VID1_MAJ_REV_SHIFT, LTC_VID1_MAJ_REV_WIDTH))
/*@}*/

/*!
 * @name Register LTC_VID1, field IP_ID[31:16] (RO)
 *
 * ID(0x0038).
 */
/*@{*/
/*! @brief Read current value of the LTC_VID1_IP_ID field. */
#define LTC_RD_VID1_IP_ID(base) ((LTC_VID1_REG(base) & LTC_VID1_IP_ID_MASK) >> LTC_VID1_IP_ID_SHIFT)
#define LTC_BRD_VID1_IP_ID(base) (LTC_RD_VID1_IP_ID(base))
/*@}*/

/*******************************************************************************
 * LTC_CHAVID - LTC CHA Version ID Register
 ******************************************************************************/

/*!
 * @brief LTC_CHAVID - LTC CHA Version ID Register (RO)
 *
 * Reset value: 0x00440151U
 *
 * This register contains the Version ID and Revision Number for the CHAs
 * contained within LTC.
 */
/*!
 * @name Constants and macros for entire LTC_CHAVID register
 */
/*@{*/
#define LTC_RD_CHAVID(base)      (LTC_CHAVID_REG(base))
/*@}*/

/*
 * Constants & macros for individual LTC_CHAVID bitfields
 */

/*!
 * @name Register LTC_CHAVID, field AESREV[3:0] (RO)
 *
 * AES Revision Number(0x1).
 */
/*@{*/
/*! @brief Read current value of the LTC_CHAVID_AESREV field. */
#define LTC_RD_CHAVID_AESREV(base) ((LTC_CHAVID_REG(base) & LTC_CHAVID_AESREV_MASK) >> LTC_CHAVID_AESREV_SHIFT)
#define LTC_BRD_CHAVID_AESREV(base) (BME_UBFX32(&LTC_CHAVID_REG(base), LTC_CHAVID_AESREV_SHIFT, LTC_CHAVID_AESREV_WIDTH))
/*@}*/

/*!
 * @name Register LTC_CHAVID, field AESVID[7:4] (RO)
 *
 * AES Version ID(0x5).
 */
/*@{*/
/*! @brief Read current value of the LTC_CHAVID_AESVID field. */
#define LTC_RD_CHAVID_AESVID(base) ((LTC_CHAVID_REG(base) & LTC_CHAVID_AESVID_MASK) >> LTC_CHAVID_AESVID_SHIFT)
#define LTC_BRD_CHAVID_AESVID(base) (BME_UBFX32(&LTC_CHAVID_REG(base), LTC_CHAVID_AESVID_SHIFT, LTC_CHAVID_AESVID_WIDTH))
/*@}*/

/*!
 * @name Register LTC_CHAVID, field DESREV[11:8] (RO)
 *
 * DES Revision Number(0x1).
 */
/*@{*/
/*! @brief Read current value of the LTC_CHAVID_DESREV field. */
#define LTC_RD_CHAVID_DESREV(base) ((LTC_CHAVID_REG(base) & LTC_CHAVID_DESREV_MASK) >> LTC_CHAVID_DESREV_SHIFT)
#define LTC_BRD_CHAVID_DESREV(base) (BME_UBFX32(&LTC_CHAVID_REG(base), LTC_CHAVID_DESREV_SHIFT, LTC_CHAVID_DESREV_WIDTH))
/*@}*/

/*!
 * @name Register LTC_CHAVID, field DESVID[15:12] (RO)
 *
 * DES Version ID(0x0).
 */
/*@{*/
/*! @brief Read current value of the LTC_CHAVID_DESVID field. */
#define LTC_RD_CHAVID_DESVID(base) ((LTC_CHAVID_REG(base) & LTC_CHAVID_DESVID_MASK) >> LTC_CHAVID_DESVID_SHIFT)
#define LTC_BRD_CHAVID_DESVID(base) (BME_UBFX32(&LTC_CHAVID_REG(base), LTC_CHAVID_DESVID_SHIFT, LTC_CHAVID_DESVID_WIDTH))
/*@}*/

/*!
 * @name Register LTC_CHAVID, field PKHAREV[19:16] (RO)
 *
 * PK Revision Number(0x4).
 */
/*@{*/
/*! @brief Read current value of the LTC_CHAVID_PKHAREV field. */
#define LTC_RD_CHAVID_PKHAREV(base) ((LTC_CHAVID_REG(base) & LTC_CHAVID_PKHAREV_MASK) >> LTC_CHAVID_PKHAREV_SHIFT)
#define LTC_BRD_CHAVID_PKHAREV(base) (BME_UBFX32(&LTC_CHAVID_REG(base), LTC_CHAVID_PKHAREV_SHIFT, LTC_CHAVID_PKHAREV_WIDTH))
/*@}*/

/*!
 * @name Register LTC_CHAVID, field PKHAVID[23:20] (RO)
 *
 * PK Version ID(0x4).
 */
/*@{*/
/*! @brief Read current value of the LTC_CHAVID_PKHAVID field. */
#define LTC_RD_CHAVID_PKHAVID(base) ((LTC_CHAVID_REG(base) & LTC_CHAVID_PKHAVID_MASK) >> LTC_CHAVID_PKHAVID_SHIFT)
#define LTC_BRD_CHAVID_PKHAVID(base) (BME_UBFX32(&LTC_CHAVID_REG(base), LTC_CHAVID_PKHAVID_SHIFT, LTC_CHAVID_PKHAVID_WIDTH))
/*@}*/

