whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_PKA1 - LTC PKHA A1 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKA1 - LTC PKHA A1 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA A1 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA A1
 * register is 512 bits in length. Note that PKHA A1, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA A1 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKA1 register
 */
/*@{*/
#define LTC_RD_PKA1(base, index) (LTC_PKA1_REG(base, index))
#define LTC_WR_PKA1(base, index, value) (LTC_PKA1_REG(base, index) = (value))
#define LTC_RMW_PKA1(base, index, mask, value) (LTC_WR_PKA1(base, index, (LTC_RD_PKA1(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKA1(base, index, value) (BME_OR32(&LTC_PKA1_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKA1(base, index, value) (BME_AND32(&LTC_PKA1_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKA1(base, index, value) (BME_XOR32(&LTC_PKA1_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKA2 - LTC PKHA A2 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKA2 - LTC PKHA A2 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA A2 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA A2
 * register is 512 bits in length. Note that PKHA A2, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA A2 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKA2 register
 */
/*@{*/
#define LTC_RD_PKA2(base, index) (LTC_PKA2_REG(base, index))
#define LTC_WR_PKA2(base, index, value) (LTC_PKA2_REG(base, index) = (value))
#define LTC_RMW_PKA2(base, index, mask, value) (LTC_WR_PKA2(base, index, (LTC_RD_PKA2(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKA2(base, index, value) (BME_OR32(&LTC_PKA2_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKA2(base, index, value) (BME_AND32(&LTC_PKA2_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKA2(base, index, value) (BME_XOR32(&LTC_PKA2_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKA3 - LTC PKHA A3 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKA3 - LTC PKHA A3 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA A3 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA A3
 * register is 512 bits in length. Note that PKHA A3, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA A3 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKA3 register
 */
/*@{*/
#define LTC_RD_PKA3(base, index) (LTC_PKA3_REG(base, index))
#define LTC_WR_PKA3(base, index, value) (LTC_PKA3_REG(base, index) = (value))
#define LTC_RMW_PKA3(base, index, mask, value) (LTC_WR_PKA3(base, index, (LTC_RD_PKA3(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKA3(base, index, value) (BME_OR32(&LTC_PKA3_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKA3(base, index, value) (BME_AND32(&LTC_PKA3_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKA3(base, index, value) (BME_XOR32(&LTC_PKA3_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKB0 - LTC PKHA B0 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKB0 - LTC PKHA B0 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA B0 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA B0
 * register is 512 bits in length. Note that PKHA B0, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA B0 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKB0 register
 */
/*@{*/
#define LTC_RD_PKB0(base, index) (LTC_PKB0_REG(base, index))
#define LTC_WR_PKB0(base, index, value) (LTC_PKB0_REG(base, index) = (value))
#define LTC_RMW_PKB0(base, index, mask, value) (LTC_WR_PKB0(base, index, (LTC_RD_PKB0(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKB0(base, index, value) (BME_OR32(&LTC_PKB0_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKB0(base, index, value) (BME_AND32(&LTC_PKB0_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKB0(base, index, value) (BME_XOR32(&LTC_PKB0_REG(base, index), (uint32_t)(value)))
/*@}*/

