whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_PKB - LTC PKHA B 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKB - LTC PKHA B 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA B Register contains a numeric value of up to 256 bytes,
 * right-justified. The LSByte is in offset 800h, in the right-most byte. The LTC PKHA B
 * register is 2048 bits in length. Note that PKHA B Register is a single
 * register that combines A0, A1, A2 and A3. The value in the PKHA B Register is limited
 * by the . Note that the PKHA Registers can be read/written only when the does
 * not contain a value enabling a PKHA operation. If the LTCMR_PK contains a PKHA
 * operation mode value, then writes to PKHA Registers will be ignored, and
 * reads of PKHA Registers will return a value of zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKB register
 */
/*@{*/
#define LTC_RD_PKB(base, index)  (LTC_PKB_REG(base, index))
#define LTC_WR_PKB(base, index, value) (LTC_PKB_REG(base, index) = (value))
#define LTC_RMW_PKB(base, index, mask, value) (LTC_WR_PKB(base, index, (LTC_RD_PKB(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKB(base, index, value) (BME_OR32(&LTC_PKB_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKB(base, index, value) (BME_AND32(&LTC_PKB_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKB(base, index, value) (BME_XOR32(&LTC_PKB_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKB1 - LTC PKHA B1 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKB1 - LTC PKHA B1 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA B1 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA B1
 * register is 512 bits in length. Note that PKHA B1, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA B1 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKB1 register
 */
/*@{*/
#define LTC_RD_PKB1(base, index) (LTC_PKB1_REG(base, index))
#define LTC_WR_PKB1(base, index, value) (LTC_PKB1_REG(base, index) = (value))
#define LTC_RMW_PKB1(base, index, mask, value) (LTC_WR_PKB1(base, index, (LTC_RD_PKB1(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKB1(base, index, value) (BME_OR32(&LTC_PKB1_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKB1(base, index, value) (BME_AND32(&LTC_PKB1_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKB1(base, index, value) (BME_XOR32(&LTC_PKB1_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKB2 - LTC PKHA B2 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKB2 - LTC PKHA B2 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA B2 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA B2
 * register is 512 bits in length. Note that PKHA B2, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA B2 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKB2 register
 */
/*@{*/
#define LTC_RD_PKB2(base, index) (LTC_PKB2_REG(base, index))
#define LTC_WR_PKB2(base, index, value) (LTC_PKB2_REG(base, index) = (value))
#define LTC_RMW_PKB2(base, index, mask, value) (LTC_WR_PKB2(base, index, (LTC_RD_PKB2(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKB2(base, index, value) (BME_OR32(&LTC_PKB2_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKB2(base, index, value) (BME_AND32(&LTC_PKB2_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKB2(base, index, value) (BME_XOR32(&LTC_PKB2_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKB3 - LTC PKHA B3 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKB3 - LTC PKHA B3 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA B3 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA B3
 * register is 512 bits in length. Note that PKHA B3, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA B3 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKB3 register
 */
/*@{*/
#define LTC_RD_PKB3(base, index) (LTC_PKB3_REG(base, index))
#define LTC_WR_PKB3(base, index, value) (LTC_PKB3_REG(base, index) = (value))
#define LTC_RMW_PKB3(base, index, mask, value) (LTC_WR_PKB3(base, index, (LTC_RD_PKB3(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKB3(base, index, value) (BME_OR32(&LTC_PKB3_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKB3(base, index, value) (BME_AND32(&LTC_PKB3_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKB3(base, index, value) (BME_XOR32(&LTC_PKB3_REG(base, index), (uint32_t)(value)))
/*@}*/

