whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_PKN - LTC PKHA N 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKN - LTC PKHA N 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA N Register contains a numeric value of up to 256 bytes,
 * right-justified. The LSByte is in offset 800h, in the right-most byte. The LTC PKHA N
 * register is 2048 bits in length. Note that PKHA N Register is a single
 * register that combines A0, A1, A2 and A3. The value in the PKHA N Register is limited
 * by the . Note that the PKHA Registers can be read/written only when the does
 * not contain a value enabling a PKHA operation. If the LTCMR_PK contains a PKHA
 * operation mode value, then writes to PKHA Registers will be ignored, and
 * reads of PKHA Registers will return a value of zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKN register
 */
/*@{*/
#define LTC_RD_PKN(base, index)  (LTC_PKN_REG(base, index))
#define LTC_WR_PKN(base, index, value) (LTC_PKN_REG(base, index) = (value))
#define LTC_RMW_PKN(base, index, mask, value) (LTC_WR_PKN(base, index, (LTC_RD_PKN(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKN(base, index, value) (BME_OR32(&LTC_PKN_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKN(base, index, value) (BME_AND32(&LTC_PKN_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKN(base, index, value) (BME_XOR32(&LTC_PKN_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKN0 - LTC PKHA N0 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKN0 - LTC PKHA N0 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA N0 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA N0
 * register is 512 bits in length. Note that PKHA N0, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA N0 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKN0 register
 */
/*@{*/
#define LTC_RD_PKN0(base, index) (LTC_PKN0_REG(base, index))
#define LTC_WR_PKN0(base, index, value) (LTC_PKN0_REG(base, index) = (value))
#define LTC_RMW_PKN0(base, index, mask, value) (LTC_WR_PKN0(base, index, (LTC_RD_PKN0(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKN0(base, index, value) (BME_OR32(&LTC_PKN0_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKN0(base, index, value) (BME_AND32(&LTC_PKN0_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKN0(base, index, value) (BME_XOR32(&LTC_PKN0_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKN1 - LTC PKHA N1 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKN1 - LTC PKHA N1 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA N1 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA N1
 * register is 512 bits in length. Note that PKHA N1, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA N1 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKN1 register
 */
/*@{*/
#define LTC_RD_PKN1(base, index) (LTC_PKN1_REG(base, index))
#define LTC_WR_PKN1(base, index, value) (LTC_PKN1_REG(base, index) = (value))
#define LTC_RMW_PKN1(base, index, mask, value) (LTC_WR_PKN1(base, index, (LTC_RD_PKN1(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKN1(base, index, value) (BME_OR32(&LTC_PKN1_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKN1(base, index, value) (BME_AND32(&LTC_PKN1_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKN1(base, index, value) (BME_XOR32(&LTC_PKN1_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKN2 - LTC PKHA N2 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKN2 - LTC PKHA N2 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA N2 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA N2
 * register is 512 bits in length. Note that PKHA N2, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA N2 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKN2 register
 */
/*@{*/
#define LTC_RD_PKN2(base, index) (LTC_PKN2_REG(base, index))
#define LTC_WR_PKN2(base, index, value) (LTC_PKN2_REG(base, index) = (value))
#define LTC_RMW_PKN2(base, index, mask, value) (LTC_WR_PKN2(base, index, (LTC_RD_PKN2(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKN2(base, index, value) (BME_OR32(&LTC_PKN2_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKN2(base, index, value) (BME_AND32(&LTC_PKN2_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKN2(base, index, value) (BME_XOR32(&LTC_PKN2_REG(base, index), (uint32_t)(value)))
/*@}*/

