whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_PKN3 - LTC PKHA N3 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKN3 - LTC PKHA N3 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA N3 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA N3
 * register is 512 bits in length. Note that PKHA N3, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA N3 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKN3 register
 */
/*@{*/
#define LTC_RD_PKN3(base, index) (LTC_PKN3_REG(base, index))
#define LTC_WR_PKN3(base, index, value) (LTC_PKN3_REG(base, index) = (value))
#define LTC_RMW_PKN3(base, index, mask, value) (LTC_WR_PKN3(base, index, (LTC_RD_PKN3(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKN3(base, index, value) (BME_OR32(&LTC_PKN3_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKN3(base, index, value) (BME_AND32(&LTC_PKN3_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKN3(base, index, value) (BME_XOR32(&LTC_PKN3_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKE - LTC PKHA E 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKE - LTC PKHA E 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA E Register contains a numeric value of up to 256 bytes,
 * right-justified. The LSByte is in offset 800h, in the right-most byte. The LTC PKHA E
 * register is 2048 bits in length. Note that PKHA E Register is a single
 * register that combines A0, A1, A2 and A3. The value in the PKHA E Register is limited
 * by the . Note that the PKHA Registers can be read/written only when the does
 * not contain a value enabling a PKHA operation. If the LTCMR_PK contains a PKHA
 * operation mode value, then writes to PKHA Registers will be ignored, and
 * reads of PKHA Registers will return a value of zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKE register
 */
/*@{*/
#define LTC_RD_PKE(base, index)  (LTC_PKE_REG(base, index))
#define LTC_WR_PKE(base, index, value) (LTC_PKE_REG(base, index) = (value))
#define LTC_RMW_PKE(base, index, mask, value) (LTC_WR_PKE(base, index, (LTC_RD_PKE(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKE(base, index, value) (BME_OR32(&LTC_PKE_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKE(base, index, value) (BME_AND32(&LTC_PKE_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKE(base, index, value) (BME_XOR32(&LTC_PKE_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKE0 - LTC PKHA E0 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKE0 - LTC PKHA E0 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA E0 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA E0
 * register is 512 bits in length. Note that PKHA E0, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA E0 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKE0 register
 */
/*@{*/
#define LTC_RD_PKE0(base, index) (LTC_PKE0_REG(base, index))
#define LTC_WR_PKE0(base, index, value) (LTC_PKE0_REG(base, index) = (value))
#define LTC_RMW_PKE0(base, index, mask, value) (LTC_WR_PKE0(base, index, (LTC_RD_PKE0(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKE0(base, index, value) (BME_OR32(&LTC_PKE0_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKE0(base, index, value) (BME_AND32(&LTC_PKE0_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKE0(base, index, value) (BME_XOR32(&LTC_PKE0_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKE1 - LTC PKHA E1 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKE1 - LTC PKHA E1 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA E1 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA E1
 * register is 512 bits in length. Note that PKHA E1, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA E1 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKE1 register
 */
/*@{*/
#define LTC_RD_PKE1(base, index) (LTC_PKE1_REG(base, index))
#define LTC_WR_PKE1(base, index, value) (LTC_PKE1_REG(base, index) = (value))
#define LTC_RMW_PKE1(base, index, mask, value) (LTC_WR_PKE1(base, index, (LTC_RD_PKE1(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKE1(base, index, value) (BME_OR32(&LTC_PKE1_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKE1(base, index, value) (BME_AND32(&LTC_PKE1_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKE1(base, index, value) (BME_XOR32(&LTC_PKE1_REG(base, index), (uint32_t)(value)))
/*@}*/

