whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * LTC_PKE2 - LTC PKHA E2 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKE2 - LTC PKHA E2 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA E2 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA E2
 * register is 512 bits in length. Note that PKHA E2, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA E2 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKE2 register
 */
/*@{*/
#define LTC_RD_PKE2(base, index) (LTC_PKE2_REG(base, index))
#define LTC_WR_PKE2(base, index, value) (LTC_PKE2_REG(base, index) = (value))
#define LTC_RMW_PKE2(base, index, mask, value) (LTC_WR_PKE2(base, index, (LTC_RD_PKE2(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKE2(base, index, value) (BME_OR32(&LTC_PKE2_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKE2(base, index, value) (BME_AND32(&LTC_PKE2_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKE2(base, index, value) (BME_XOR32(&LTC_PKE2_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_PKE3 - LTC PKHA E3 0 Register
 ******************************************************************************/

/*!
 * @brief LTC_PKE3 - LTC PKHA E3 0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LTC PKHA E3 Register contains a numeric value of up to 64 bytes,
 * right-justified. The LSByte is in offset 8C0h, in the right-most byte. The LTC PKHA E3
 * register is 512 bits in length. Note that PKHA E3, A2, A1 and A0 Registers
 * may be combined to contain a value of up to 2048 bits, with A0 containing the
 * least-significant 64 bytes of this value. The value in the PKHA E3 Register, if
 * used as a separate value, is limited by the . Note that the PKHA Registers can
 * be read/written only when the does not contain a value enabling a PKHA
 * operation. If the LTCMR_PK contains a PKHA operation mode value, then writes to PKHA
 * Registers will be ignored, and reads of PKHA Registers will return a value of
 * zero.
 */
/*!
 * @name Constants and macros for entire LTC_PKE3 register
 */
/*@{*/
#define LTC_RD_PKE3(base, index) (LTC_PKE3_REG(base, index))
#define LTC_WR_PKE3(base, index, value) (LTC_PKE3_REG(base, index) = (value))
#define LTC_RMW_PKE3(base, index, mask, value) (LTC_WR_PKE3(base, index, (LTC_RD_PKE3(base, index) & ~(mask)) | (value)))
#define LTC_SET_PKE3(base, index, value) (BME_OR32(&LTC_PKE3_REG(base, index), (uint32_t)(value)))
#define LTC_CLR_PKE3(base, index, value) (BME_AND32(&LTC_PKE3_REG(base, index), (uint32_t)(~(value))))
#define LTC_TOG_PKE3(base, index, value) (BME_XOR32(&LTC_PKE3_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * MK82F25615 MCG
 *
 * Multipurpose Clock Generator module
 *
 * Registers defined in this header file:
 * - MCG_C1 - MCG Control 1 Register
 * - MCG_C2 - MCG Control 2 Register
 * - MCG_C3 - MCG Control 3 Register
 * - MCG_C4 - MCG Control 4 Register
 * - MCG_C5 - MCG Control 5 Register
 * - MCG_C6 - MCG Control 6 Register
 * - MCG_S - MCG Status Register
 * - MCG_SC - MCG Status and Control Register
 * - MCG_ATCVH - MCG Auto Trim Compare Value High Register
 * - MCG_ATCVL - MCG Auto Trim Compare Value Low Register
 * - MCG_C7 - MCG Control 7 Register
 * - MCG_C8 - MCG Control 8 Register
 */

#define MCG_INSTANCE_COUNT (1U) /*!< Number of instances of the MCG module. */
#define MCG_IDX (0U) /*!< Instance number for MCG. */

/*******************************************************************************
 * MCG_C1 - MCG Control 1 Register
 ******************************************************************************/

/*!
 * @brief MCG_C1 - MCG Control 1 Register (RW)
 *
 * Reset value: 0x04U
 */
/*!
 * @name Constants and macros for entire MCG_C1 register
 */
/*@{*/
#define MCG_RD_C1(base)          (MCG_C1_REG(base))
#define MCG_WR_C1(base, value)   (MCG_C1_REG(base) = (value))
#define MCG_RMW_C1(base, mask, value) (MCG_WR_C1(base, (MCG_RD_C1(base) & ~(mask)) | (value)))
#define MCG_SET_C1(base, value)  (BME_OR8(&MCG_C1_REG(base), (uint8_t)(value)))
#define MCG_CLR_C1(base, value)  (BME_AND8(&MCG_C1_REG(base), (uint8_t)(~(value))))
#define MCG_TOG_C1(base, value)  (BME_XOR8(&MCG_C1_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C1 bitfields
 */

/*!
 * @name Register MCG_C1, field IREFSTEN[0] (RW)
 *
 * Controls whether or not the internal reference clock remains enabled when the
 * MCG enters Stop mode.
 *
 * Values:
 * - 0b0 - Internal reference clock is disabled in Stop mode.
 * - 0b1 - Internal reference clock is enabled in Stop mode if IRCLKEN is set or
 *     if MCG is in FEI, FBI, or BLPI modes before entering Stop mode.
 */
/*@{*/
/*! @brief Read current value of the MCG_C1_IREFSTEN field. */
#define MCG_RD_C1_IREFSTEN(base) ((MCG_C1_REG(base) & MCG_C1_IREFSTEN_MASK) >> MCG_C1_IREFSTEN_SHIFT)
#define MCG_BRD_C1_IREFSTEN(base) (BME_UBFX8(&MCG_C1_REG(base), MCG_C1_IREFSTEN_SHIFT, MCG_C1_IREFSTEN_WIDTH))

/*! @brief Set the IREFSTEN field to a new value. */
#define MCG_WR_C1_IREFSTEN(base, value) (MCG_RMW_C1(base, MCG_C1_IREFSTEN_MASK, MCG_C1_IREFSTEN(value)))
#define MCG_BWR_C1_IREFSTEN(base, value) (BME_BFI8(&MCG_C1_REG(base), ((uint8_t)(value) << MCG_C1_IREFSTEN_SHIFT), MCG_C1_IREFSTEN_SHIFT, MCG_C1_IREFSTEN_WIDTH))
/*@}*/

/*!
 * @name Register MCG_C1, field IRCLKEN[1] (RW)
 *
 * Enables the internal reference clock for use as MCGIRCLK.
 *
 * Values:
 * - 0b0 - MCGIRCLK inactive.
 * - 0b1 - MCGIRCLK active.
 */
/*@{*/
/*! @brief Read current value of the MCG_C1_IRCLKEN field. */
#define MCG_RD_C1_IRCLKEN(base) ((MCG_C1_REG(base) & MCG_C1_IRCLKEN_MASK) >> MCG_C1_IRCLKEN_SHIFT)
#define MCG_BRD_C1_IRCLKEN(base) (BME_UBFX8(&MCG_C1_REG(base), MCG_C1_IRCLKEN_SHIFT, MCG_C1_IRCLKEN_WIDTH))

/*! @brief Set the IRCLKEN field to a new value. */
#define MCG_WR_C1_IRCLKEN(base, value) (MCG_RMW_C1(base, MCG_C1_IRCLKEN_MASK, MCG_C1_IRCLKEN(value)))
#define MCG_BWR_C1_IRCLKEN(base, value) (BME_BFI8(&MCG_C1_REG(base), ((uint8_t)(value) << MCG_C1_IRCLKEN_SHIFT), MCG_C1_IRCLKEN_SHIFT, MCG_C1_IRCLKEN_WIDTH))
/*@}*/

/*!
 * @name Register MCG_C1, field IREFS[2] (RW)
 *
 * Selects the reference clock source for the FLL.
 *
 * Values:
 * - 0b0 - External reference clock is selected.
 * - 0b1 - The slow internal reference clock is selected.
 */
/*@{*/
/*! @brief Read current value of the MCG_C1_IREFS field. */
#define MCG_RD_C1_IREFS(base) ((MCG_C1_REG(base) & MCG_C1_IREFS_MASK) >> MCG_C1_IREFS_SHIFT)
#define MCG_BRD_C1_IREFS(base) (BME_UBFX8(&MCG_C1_REG(base), MCG_C1_IREFS_SHIFT, MCG_C1_IREFS_WIDTH))

/*! @brief Set the IREFS field to a new value. */
#define MCG_WR_C1_IREFS(base, value) (MCG_RMW_C1(base, MCG_C1_IREFS_MASK, MCG_C1_IREFS(value)))
#define MCG_BWR_C1_IREFS(base, value) (BME_BFI8(&MCG_C1_REG(base), ((uint8_t)(value) << MCG_C1_IREFS_SHIFT), MCG_C1_IREFS_SHIFT, MCG_C1_IREFS_WIDTH))
/*@}*/

/*!
 * @name Register MCG_C1, field FRDIV[5:3] (RW)
 *
 * Selects the amount to divide down the external reference clock for the FLL.
 * The resulting frequency must be in the range 31.25 kHz to 39.0625 kHz (This is
 * required when FLL/DCO is the clock source for MCGOUTCLK . In FBE mode, it is
 * not required to meet this range, but it is recommended in the cases when trying
 * to enter a FLL mode from FBE).
 *
 * Values:
 * - 0b000 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 1; for all other RANGE
 *     values, Divide Factor is 32.
 * - 0b001 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 2; for all other RANGE
 *     values, Divide Factor is 64.
 * - 0b010 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 4; for all other RANGE
 *     values, Divide Factor is 128.
 * - 0b011 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 8; for all other RANGE
 *     values, Divide Factor is 256.
 * - 0b100 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 16; for all other RANGE
 *     values, Divide Factor is 512.
 * - 0b101 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 32; for all other RANGE
 *     values, Divide Factor is 1024.
 * - 0b110 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 64; for all other RANGE
 *     values, Divide Factor is 1280 .
 * - 0b111 - If RANGE = 0 or OSCSEL=1 , Divide Factor is 128; for all other
 *     RANGE values, Divide Factor is 1536 .
 */
/*@{*/
/*! @brief Read current value of the MCG_C1_FRDIV field. */
#define MCG_RD_C1_FRDIV(base) ((MCG_C1_REG(base) & MCG_C1_FRDIV_MASK) >> MCG_C1_FRDIV_SHIFT)
#define MCG_BRD_C1_FRDIV(base) (BME_UBFX8(&MCG_C1_REG(base), MCG_C1_FRDIV_SHIFT, MCG_C1_FRDIV_WIDTH))

