whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * MCM_FADR - Fault address register
 ******************************************************************************/

/*!
 * @brief MCM_FADR - Fault address register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When a properly-enabled cache write buffer error interrupt event is detected,
 * the faulting address is captured in the MCM_FADR register. The MCM logic
 * supports capturing a single cache write buffer bus error event; if a subsequent
 * error is detected before the captured error information has been read from the
 * corresponding registers and the MCM_ISCR[CWBER] indicator cleared, the
 * MCM_FATR[BEOVR] flag is set. However, no additional information is captured. The bits
 * in this register are set by hardware and signaled by the assertion of
 * MCM_ISCR[CWBER]. Attempted writes have no effect.
 */
/*!
 * @name Constants and macros for entire MCM_FADR register
 */
/*@{*/
#define MCM_RD_FADR(base)        (MCM_FADR_REG(base))
/*@}*/

/*******************************************************************************
 * MCM_FATR - Fault attributes register
 ******************************************************************************/

/*!
 * @brief MCM_FATR - Fault attributes register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When a properly-enabled cache write buffer error interrupt event is detected,
 * the faulting attributes are captured in the MCM_FATR register. The bits in
 * this register are set by hardware and signaled by the assertion of
 * MCM_ISCR[CWBER]. Attempted writes have no effect.
 */
/*!
 * @name Constants and macros for entire MCM_FATR register
 */
/*@{*/
#define MCM_RD_FATR(base)        (MCM_FATR_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_FATR bitfields
 */

/*!
 * @name Register MCM_FATR, field BEDA[0] (RO)
 *
 * Indicates the type of cache write buffer access when the error was detected.
 * This attribute is always a logical one signaling a data reference.
 *
 * Values:
 * - 0b0 - Instruction
 * - 0b1 - Data
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEDA field. */
#define MCM_RD_FATR_BEDA(base) ((MCM_FATR_REG(base) & MCM_FATR_BEDA_MASK) >> MCM_FATR_BEDA_SHIFT)
#define MCM_BRD_FATR_BEDA(base) (MCM_RD_FATR_BEDA(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEMD[1] (RO)
 *
 * Indicates the privilege level of the cache write buffer access when the error
 * was detected.
 *
 * Values:
 * - 0b0 - User mode
 * - 0b1 - Supervisor/privileged mode
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEMD field. */
#define MCM_RD_FATR_BEMD(base) ((MCM_FATR_REG(base) & MCM_FATR_BEMD_MASK) >> MCM_FATR_BEMD_SHIFT)
#define MCM_BRD_FATR_BEMD(base) (MCM_RD_FATR_BEMD(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BESZ[5:4] (RO)
 *
 * Indicates the size of the cache write buffer access when the error was
 * detected.
 *
 * Values:
 * - 0b00 - 8-bit access
 * - 0b01 - 16-bit access
 * - 0b10 - 32-bit access
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BESZ field. */
#define MCM_RD_FATR_BESZ(base) ((MCM_FATR_REG(base) & MCM_FATR_BESZ_MASK) >> MCM_FATR_BESZ_SHIFT)
#define MCM_BRD_FATR_BESZ(base) (MCM_RD_FATR_BESZ(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEWT[7] (RO)
 *
 * Indicates the type of system bus access when the error was detected. Since
 * this logic is monitoring data transfers from the cache write buffer, this bit is
 * always a logical one, signaling a write operation.
 *
 * Values:
 * - 0b0 - Read access
 * - 0b1 - Write access
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEWT field. */
#define MCM_RD_FATR_BEWT(base) ((MCM_FATR_REG(base) & MCM_FATR_BEWT_MASK) >> MCM_FATR_BEWT_SHIFT)
#define MCM_BRD_FATR_BEWT(base) (MCM_RD_FATR_BEWT(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEMN[11:8] (RO)
 *
 * Crossbar switch bus master number of the captured cache write buffer bus
 * error. For this device, this value is always 0x1.
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEMN field. */
#define MCM_RD_FATR_BEMN(base) ((MCM_FATR_REG(base) & MCM_FATR_BEMN_MASK) >> MCM_FATR_BEMN_SHIFT)
#define MCM_BRD_FATR_BEMN(base) (MCM_RD_FATR_BEMN(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEOVR[31] (RO)
 *
 * Indicates if another cache write buffer bus error is detected before system
 * software has retrieved all the error information from the original event, this
 * overrun flag is set. The window of time is defined from the detection of the
 * original cache write buffer error termination until the MCM_ISCR[CWBER] is
 * written with a 1 to clear it and rearm the capture logic. This bit is set by the
 * hardware and cleared whenever software writes a 1 to the CWBER bit.
 *
 * Values:
 * - 0b0 - No bus error overrun
 * - 0b1 - Bus error overrun occurred. The FADR and FDR registers and the other
 *     FATR bits are not updated to reflect this new bus error.
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEOVR field. */
#define MCM_RD_FATR_BEOVR(base) ((MCM_FATR_REG(base) & MCM_FATR_BEOVR_MASK) >> MCM_FATR_BEOVR_SHIFT)
#define MCM_BRD_FATR_BEOVR(base) (MCM_RD_FATR_BEOVR(base))
/*@}*/

/*******************************************************************************
 * MCM_FDR - Fault data register
 ******************************************************************************/

/*!
 * @brief MCM_FDR - Fault data register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When a properly-enabled cache write buffer error interrupt event is detected,
 * the faulting data is captured in the MCM_FDR register. The bits in this
 * register are set by hardware and signaled by the assertion of MCM_ISCR[CWBER]. For
 * byte and halfword writes, only the accessed byte lanes contain valid data; the
 * contents of the other bytes are undefined. Attempted writes have no effect.
 */
/*!
 * @name Constants and macros for entire MCM_FDR register
 */
/*@{*/
#define MCM_RD_FDR(base)         (MCM_FDR_REG(base))
/*@}*/

