whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * OSC_DIV - OSC_DIV
 ******************************************************************************/

/*!
 * @brief OSC_DIV - OSC_DIV (RW)
 *
 * Reset value: 0x00U
 *
 * OSC Clock divider register.
 */
/*!
 * @name Constants and macros for entire OSC_DIV register
 */
/*@{*/
#define OSC_RD_DIV(base)         (OSC_DIV_REG(base))
#define OSC_WR_DIV(base, value)  (OSC_DIV_REG(base) = (value))
#define OSC_RMW_DIV(base, mask, value) (OSC_WR_DIV(base, (OSC_RD_DIV(base) & ~(mask)) | (value)))
#define OSC_SET_DIV(base, value) (BME_OR8(&OSC_DIV_REG(base), (uint8_t)(value)))
#define OSC_CLR_DIV(base, value) (BME_AND8(&OSC_DIV_REG(base), (uint8_t)(~(value))))
#define OSC_TOG_DIV(base, value) (BME_XOR8(&OSC_DIV_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual OSC_DIV bitfields
 */

/*!
 * @name Register OSC_DIV, field ERPS[7:6] (RW)
 *
 * ERCLK prescaler. These two bits are used to divide the ERCLK output. The
 * un-divided ERCLK output is not affected by these two bits.
 *
 * Values:
 * - 0b00 - The divisor ratio is 1.
 * - 0b01 - The divisor ratio is 2.
 * - 0b10 - The divisor ratio is 4.
 * - 0b11 - The divisor ratio is 8.
 */
/*@{*/
/*! @brief Read current value of the OSC_DIV_ERPS field. */
#define OSC_RD_DIV_ERPS(base) ((OSC_DIV_REG(base) & OSC_DIV_ERPS_MASK) >> OSC_DIV_ERPS_SHIFT)
#define OSC_BRD_DIV_ERPS(base) (BME_UBFX8(&OSC_DIV_REG(base), OSC_DIV_ERPS_SHIFT, OSC_DIV_ERPS_WIDTH))

/*! @brief Set the ERPS field to a new value. */
#define OSC_WR_DIV_ERPS(base, value) (OSC_RMW_DIV(base, OSC_DIV_ERPS_MASK, OSC_DIV_ERPS(value)))
#define OSC_BWR_DIV_ERPS(base, value) (BME_BFI8(&OSC_DIV_REG(base), ((uint8_t)(value) << OSC_DIV_ERPS_SHIFT), OSC_DIV_ERPS_SHIFT, OSC_DIV_ERPS_WIDTH))
/*@}*/

/*
 * MK82F25615 OTFAD
 *
 * OTFAD
 *
 * Registers defined in this header file:
 * - OTFAD_CR - Control Register
 * - OTFAD_SR - Status Register
 * - OTFAD_CRC - Cyclic Redundancy Check Register
 * - OTFAD_CTX_KEY - AES Key Word0
 * - OTFAD_CTX_CTR - AES Counter Word0
 * - OTFAD_CTX_RGD - AES Region Descriptor Word0
 */

#define OTFAD_INSTANCE_COUNT (1U) /*!< Number of instances of the OTFAD module. */
#define OTFAD_IDX (0U) /*!< Instance number for OTFAD. */

/*******************************************************************************
 * OTFAD_CR - Control Register
 ******************************************************************************/

/*!
 * @brief OTFAD_CR - Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the operating configuration of the OTFAD including a
 * global enable indicator. There are 2 register fields in the CR that control the
 * OTFAD configuration. These fields (GE, RRAE) are generated based on both the
 * contents of the CR plus static input configuration signals. For both bits, the
 * contents of the CR flag is logically summed (OR'd) with the static input
 * configuration signals to form the actual control used by the OTFAD. Reads of the CR
 * return the logical summation of these configuration controls. Entry into the
 * LDM or SVM modes clears both indicators. For more details, see OTFAD
 * configuration details.
 */
/*!
 * @name Constants and macros for entire OTFAD_CR register
 */
/*@{*/
#define OTFAD_RD_CR(base)        (OTFAD_CR_REG(base))
#define OTFAD_WR_CR(base, value) (OTFAD_CR_REG(base) = (value))
#define OTFAD_RMW_CR(base, mask, value) (OTFAD_WR_CR(base, (OTFAD_RD_CR(base) & ~(mask)) | (value)))
#define OTFAD_SET_CR(base, value) (BME_OR32(&OTFAD_CR_REG(base), (uint32_t)(value)))
#define OTFAD_CLR_CR(base, value) (BME_AND32(&OTFAD_CR_REG(base), (uint32_t)(~(value))))
#define OTFAD_TOG_CR(base, value) (BME_XOR32(&OTFAD_CR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual OTFAD_CR bitfields
 */

/*!
 * @name Register OTFAD_CR, field FSVM[2] (RW)
 *
 * This field is intended to provide a mechanism for software testing of entry
 * into the Security Violation Mode (SVM). This indicator is sticky; once set, it
 * remains asserted until the next system reset, when it is cleared.
 *
 * Values:
 * - 0b0 - No effect on the operating mode.
 * - 0b1 - Force entry into SVM after a write with this data bit set and the
 *     data bit associated with FLDM cleared. SR[MODE] signals the operating mode.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CR_FSVM field. */
#define OTFAD_RD_CR_FSVM(base) ((OTFAD_CR_REG(base) & OTFAD_CR_FSVM_MASK) >> OTFAD_CR_FSVM_SHIFT)
#define OTFAD_BRD_CR_FSVM(base) (BME_UBFX32(&OTFAD_CR_REG(base), OTFAD_CR_FSVM_SHIFT, OTFAD_CR_FSVM_WIDTH))

/*! @brief Set the FSVM field to a new value. */
#define OTFAD_WR_CR_FSVM(base, value) (OTFAD_RMW_CR(base, OTFAD_CR_FSVM_MASK, OTFAD_CR_FSVM(value)))
#define OTFAD_BWR_CR_FSVM(base, value) (BME_BFI32(&OTFAD_CR_REG(base), ((uint32_t)(value) << OTFAD_CR_FSVM_SHIFT), OTFAD_CR_FSVM_SHIFT, OTFAD_CR_FSVM_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CR, field FLDM[3] (RW)
 *
 * This field is intended to provide a mechanism for software testing of entry
 * into the Logically Disabled Mode (LDM). This indicator is sticky; once set, it
 * remains asserted until the next system reset, when it is cleared.
 *
 * Values:
 * - 0b0 - No effect on the operating mode.
 * - 0b1 - Force entry into LDM after a write with this data bit set. SR[MODE]
 *     signals the operating mode.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CR_FLDM field. */
#define OTFAD_RD_CR_FLDM(base) ((OTFAD_CR_REG(base) & OTFAD_CR_FLDM_MASK) >> OTFAD_CR_FLDM_SHIFT)
#define OTFAD_BRD_CR_FLDM(base) (BME_UBFX32(&OTFAD_CR_REG(base), OTFAD_CR_FLDM_SHIFT, OTFAD_CR_FLDM_WIDTH))

/*! @brief Set the FLDM field to a new value. */
#define OTFAD_WR_CR_FLDM(base, value) (OTFAD_RMW_CR(base, OTFAD_CR_FLDM_MASK, OTFAD_CR_FLDM(value)))
#define OTFAD_BWR_CR_FLDM(base, value) (BME_BFI32(&OTFAD_CR_REG(base), ((uint32_t)(value) << OTFAD_CR_FLDM_SHIFT), OTFAD_CR_FLDM_SHIFT, OTFAD_CR_FLDM_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CR, field RRAE[7] (RW)
 *
 * If this bit is asserted, only the CR, SR and CRC registers can be accessed;
 * attempted accesses of all other registers are treated as RAZ/WI
 * (read-as-zero/write-ignore). This indicator is sticky; once set, it remains asserted until
 * the next system reset, when it is cleared. It is also asserted by entry into the
 * LDM or SVM modes. The value of this field is reflected in the SR[RRAM] flag.
 *
 * Values:
 * - 0b0 - Register access is fully enabled. The OTFAD programming model
 *     registers can be accessed "normally".
 * - 0b1 - Register access is restricted and only the CR, SR and CRC can be
 *     accessed; others are treated as RAZ/WI.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CR_RRAE field. */
#define OTFAD_RD_CR_RRAE(base) ((OTFAD_CR_REG(base) & OTFAD_CR_RRAE_MASK) >> OTFAD_CR_RRAE_SHIFT)
#define OTFAD_BRD_CR_RRAE(base) (BME_UBFX32(&OTFAD_CR_REG(base), OTFAD_CR_RRAE_SHIFT, OTFAD_CR_RRAE_WIDTH))

