whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the RRAE field to a new value. */
#define OTFAD_WR_CR_RRAE(base, value) (OTFAD_RMW_CR(base, OTFAD_CR_RRAE_MASK, OTFAD_CR_RRAE(value)))
#define OTFAD_BWR_CR_RRAE(base, value) (BME_BFI32(&OTFAD_CR_REG(base), ((uint32_t)(value) << OTFAD_CR_RRAE_SHIFT), OTFAD_CR_RRAE_SHIFT, OTFAD_CR_RRAE_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CR, field CCTX[17:16] (RW)
 *
 * This field defines which context has its CRC check enabled when CR[CRCE] = 1.
 *
 * Values:
 * - 0b00 - Enable CTX0 CRC check.
 * - 0b01 - Enable CTX1 CRC check.
 * - 0b10 - Enable CTX2 CRC check.
 * - 0b11 - Enable CTX3 CRC check.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CR_CCTX field. */
#define OTFAD_RD_CR_CCTX(base) ((OTFAD_CR_REG(base) & OTFAD_CR_CCTX_MASK) >> OTFAD_CR_CCTX_SHIFT)
#define OTFAD_BRD_CR_CCTX(base) (BME_UBFX32(&OTFAD_CR_REG(base), OTFAD_CR_CCTX_SHIFT, OTFAD_CR_CCTX_WIDTH))

/*! @brief Set the CCTX field to a new value. */
#define OTFAD_WR_CR_CCTX(base, value) (OTFAD_RMW_CR(base, OTFAD_CR_CCTX_MASK, OTFAD_CR_CCTX(value)))
#define OTFAD_BWR_CR_CCTX(base, value) (BME_BFI32(&OTFAD_CR_REG(base), ((uint32_t)(value) << OTFAD_CR_CCTX_SHIFT), OTFAD_CR_CCTX_SHIFT, OTFAD_CR_CCTX_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CR, field CRCE[20] (RW)
 *
 * This field controls if the standard 32-bit Ethernet cyclic redundancy check
 * (CRC) for a given context is enabled. It is cleared by entry into the LDM or
 * SVM modes.
 *
 * Values:
 * - 0b0 - CRC-32 is disabled.
 * - 0b1 - CRC-32 for the context defined by CR[CCTRX] is enabled.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CR_CRCE field. */
#define OTFAD_RD_CR_CRCE(base) ((OTFAD_CR_REG(base) & OTFAD_CR_CRCE_MASK) >> OTFAD_CR_CRCE_SHIFT)
#define OTFAD_BRD_CR_CRCE(base) (BME_UBFX32(&OTFAD_CR_REG(base), OTFAD_CR_CRCE_SHIFT, OTFAD_CR_CRCE_WIDTH))

/*! @brief Set the CRCE field to a new value. */
#define OTFAD_WR_CR_CRCE(base, value) (OTFAD_RMW_CR(base, OTFAD_CR_CRCE_MASK, OTFAD_CR_CRCE(value)))
#define OTFAD_BWR_CR_CRCE(base, value) (BME_BFI32(&OTFAD_CR_REG(base), ((uint32_t)(value) << OTFAD_CR_CRCE_SHIFT), OTFAD_CR_CRCE_SHIFT, OTFAD_CR_CRCE_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CR, field CRCI[21] (WORZ)
 *
 * When set, this field forces an initialization of the CRC data register to all
 * ones. This field always reads as zero.
 *
 * Values:
 * - 0b0 - CRC data register is unaffected.
 * - 0b1 - CRC data register is immediately initialized after a write with this
 *     data bit set.
 */
/*@{*/
/*! @brief Set the CRCI field to a new value. */
#define OTFAD_WR_CR_CRCI(base, value) (OTFAD_RMW_CR(base, OTFAD_CR_CRCI_MASK, OTFAD_CR_CRCI(value)))
#define OTFAD_BWR_CR_CRCI(base, value) (BME_BFI32(&OTFAD_CR_REG(base), ((uint32_t)(value) << OTFAD_CR_CRCI_SHIFT), OTFAD_CR_CRCI_SHIFT, OTFAD_CR_CRCI_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CR, field GE[31] (RW)
 *
 * This field enables the OTFAD operation. It is cleared by entry into the LDM
 * or SVM modes.
 *
 * Values:
 * - 0b0 - OTFAD has decryption disabled, and bypasses all data fetched by the
 *     QuadSPI.
 * - 0b1 - OTFAD has decryption enabled, and processes fetched data as defined
 *     by the hardware configuration.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CR_GE field. */
#define OTFAD_RD_CR_GE(base) ((OTFAD_CR_REG(base) & OTFAD_CR_GE_MASK) >> OTFAD_CR_GE_SHIFT)
#define OTFAD_BRD_CR_GE(base) (BME_UBFX32(&OTFAD_CR_REG(base), OTFAD_CR_GE_SHIFT, OTFAD_CR_GE_WIDTH))

/*! @brief Set the GE field to a new value. */
#define OTFAD_WR_CR_GE(base, value) (OTFAD_RMW_CR(base, OTFAD_CR_GE_MASK, OTFAD_CR_GE(value)))
#define OTFAD_BWR_CR_GE(base, value) (BME_BFI32(&OTFAD_CR_REG(base), ((uint32_t)(value) << OTFAD_CR_GE_SHIFT), OTFAD_CR_GE_SHIFT, OTFAD_CR_GE_WIDTH))
/*@}*/

/*******************************************************************************
 * OTFAD_SR - Status Register
 ******************************************************************************/

/*!
 * @brief OTFAD_SR - Status Register (RO)
 *
 * Reset value: 0x00000040U
 *
 * This register provides OTFAD status information.
 */
/*!
 * @name Constants and macros for entire OTFAD_SR register
 */
/*@{*/
#define OTFAD_RD_SR(base)        (OTFAD_SR_REG(base))
/*@}*/

/*
 * Constants & macros for individual OTFAD_SR bitfields
 */

/*!
 * @name Register OTFAD_SR, field MDPCP[1] (RO)
 *
 * This field signals the presence of the Multi-Dimensional Parity Checker. For
 * this device, it always has the value 0.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_SR_MDPCP field. */
#define OTFAD_RD_SR_MDPCP(base) ((OTFAD_SR_REG(base) & OTFAD_SR_MDPCP_MASK) >> OTFAD_SR_MDPCP_SHIFT)
#define OTFAD_BRD_SR_MDPCP(base) (BME_UBFX32(&OTFAD_SR_REG(base), OTFAD_SR_MDPCP_SHIFT, OTFAD_SR_MDPCP_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_SR, field MODE[3:2] (RO)
 *
 * This field specifies the OTFAD's operating mode. Input configuration and
 * control signals force entry from normal mode (NRM) into one of the two special
 * operating modes (LDM, SVM). See Modes of operation for more details.
 *
 * Values:
 * - 0b00 - Operating in Normal mode (NRM)
 * - 0b01 - Unused (reserved)
 * - 0b10 - Operating in Security Violation Mode (SVM)
 * - 0b11 - Operating in Logically Disabled Mode (LDM)
 */
/*@{*/
/*! @brief Read current value of the OTFAD_SR_MODE field. */
#define OTFAD_RD_SR_MODE(base) ((OTFAD_SR_REG(base) & OTFAD_SR_MODE_MASK) >> OTFAD_SR_MODE_SHIFT)
#define OTFAD_BRD_SR_MODE(base) (BME_UBFX32(&OTFAD_SR_REG(base), OTFAD_SR_MODE_SHIFT, OTFAD_SR_MODE_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_SR, field NCTX[7:4] (RO)
 *
 * This field signals the number of implemented hardware contexts. It reads as 4.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_SR_NCTX field. */
#define OTFAD_RD_SR_NCTX(base) ((OTFAD_SR_REG(base) & OTFAD_SR_NCTX_MASK) >> OTFAD_SR_NCTX_SHIFT)
#define OTFAD_BRD_SR_NCTX(base) (BME_UBFX32(&OTFAD_SR_REG(base), OTFAD_SR_NCTX_SHIFT, OTFAD_SR_NCTX_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_SR, field HRL[27:24] (RO)
 *
 * This field reads as zero.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_SR_HRL field. */
#define OTFAD_RD_SR_HRL(base) ((OTFAD_SR_REG(base) & OTFAD_SR_HRL_MASK) >> OTFAD_SR_HRL_SHIFT)
#define OTFAD_BRD_SR_HRL(base) (BME_UBFX32(&OTFAD_SR_REG(base), OTFAD_SR_HRL_SHIFT, OTFAD_SR_HRL_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_SR, field RRAM[28] (RO)
 *
 * This indicator signals that accesses to the slave peripheral bus are
 * operating in a restricted mode, where only the CR, SR and CRC registers can be
 * referenced. This access mode can be defined by the assertion of CR[RRAE] = 1.
 * Attempted accesses to other registers are treated as RAZ/WI. This flag is identical
 * to the read value of CR[RRAE].
 *
 * Values:
 * - 0b0 - Register access is fully enabled. The OTFAD programming model
 *     registers can be accessed "normally".
 * - 0b1 - Register access is restricted and only the CR, SR and CRC can be
 *     accessed; others are treated as RAZ/WI.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_SR_RRAM field. */
#define OTFAD_RD_SR_RRAM(base) ((OTFAD_SR_REG(base) & OTFAD_SR_RRAM_MASK) >> OTFAD_SR_RRAM_SHIFT)
#define OTFAD_BRD_SR_RRAM(base) (BME_UBFX32(&OTFAD_SR_REG(base), OTFAD_SR_RRAM_SHIFT, OTFAD_SR_RRAM_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_SR, field GEM[29] (RO)
 *
 * This indicator signals the global enabled/disabled state of the OTFAD. This
 * flag is identical to the read value of CR[GE].
 *
 * Values:
 * - 0b0 - OTFAD is disabled, and bypasses all data fetched by the QuadSPI.
 * - 0b1 - OTFAD is enabled, and processes data fetched by the QuadSPI as
 *     defined by the hardware configuration.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_SR_GEM field. */
#define OTFAD_RD_SR_GEM(base) ((OTFAD_SR_REG(base) & OTFAD_SR_GEM_MASK) >> OTFAD_SR_GEM_SHIFT)
#define OTFAD_BRD_SR_GEM(base) (BME_UBFX32(&OTFAD_SR_REG(base), OTFAD_SR_GEM_SHIFT, OTFAD_SR_GEM_WIDTH))
/*@}*/

