whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * OTFAD_CRC - Cyclic Redundancy Check Register
 ******************************************************************************/

/*!
 * @brief OTFAD_CRC - Cyclic Redundancy Check Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CRC register is the data register used during OTFAD cyclic redundancy
 * check operations. The CRC implements the standard 32-bit "Ethernet" polynomial,
 * commonly expressed as 0x04C1_1DB7 or mathematically as x32 + x26 + x23 + x22 +
 * x16 + x12 + x11 + x10 + x8 + x7 + x5 + x4 + x2 + x + 1. The OTFAD supports
 * optional CRC calculations for a selected context. For all uses, the data being
 * checked is the plaintext output, processed as a little endian array of 8-bit
 * bytes. It must be accessed sequentially from the lowest address to the highest
 * address. For CRC checking on a selected context, the hardware must be configured
 * by writing the CR[CRCI = 1, CRCE = 1, CCTX = n] bit fields. This initializes
 * the CRC to 0xFFFF_FFFF, enables it and selects context n as the data source.
 * See Context CRC for additional information. It should also be noted that the
 * CRC hardware implements a data pipeline and the CRC register is not updated with
 * its final value until 2 clocks after the last input data is presented to the
 * OTFAD. For typical system use cases, this exposed pipeline time is not visible
 * to reads of this register on the slave peripheral bus.
 */
/*!
 * @name Constants and macros for entire OTFAD_CRC register
 */
/*@{*/
#define OTFAD_RD_CRC(base)       (OTFAD_CRC_REG(base))
#define OTFAD_WR_CRC(base, value) (OTFAD_CRC_REG(base) = (value))
#define OTFAD_RMW_CRC(base, mask, value) (OTFAD_WR_CRC(base, (OTFAD_RD_CRC(base) & ~(mask)) | (value)))
#define OTFAD_SET_CRC(base, value) (BME_OR32(&OTFAD_CRC_REG(base), (uint32_t)(value)))
#define OTFAD_CLR_CRC(base, value) (BME_AND32(&OTFAD_CRC_REG(base), (uint32_t)(~(value))))
#define OTFAD_TOG_CRC(base, value) (BME_XOR32(&OTFAD_CRC_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * OTFAD_CTX_KEY - AES Key Word0
 ******************************************************************************/

/*!
 * @brief OTFAD_CTX_KEY - AES Key Word0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CTXn_KEY_Wm registers provide a 2-dimensional data structure for local
 * OTFAD storage of the 128-bit key for context "n". There are four consecutive
 * memory-mapped register words containing the key used for the AES calculations
 * associated with the given context. The programming model view of the CTXn_KEY_Wm
 * registers is a little-endian 16-element byte data array, while the 128-bit key
 * is defined as the concatenation of {A0, A1, A2,..., A14, A15}.
 */
/*!
 * @name Constants and macros for entire OTFAD_CTX_KEY register
 */
/*@{*/
#define OTFAD_RD_CTX_KEY(base, index, index2) (OTFAD_CTX_KEY_REG(base, index, index2))
#define OTFAD_WR_CTX_KEY(base, index, index2, value) (OTFAD_CTX_KEY_REG(base, index, index2) = (value))
#define OTFAD_RMW_CTX_KEY(base, index, index2, mask, value) (OTFAD_WR_CTX_KEY(base, index, index2, (OTFAD_RD_CTX_KEY(base, index, index2) & ~(mask)) | (value)))
#define OTFAD_SET_CTX_KEY(base, index, index2, value) (BME_OR32(&OTFAD_CTX_KEY_REG(base, index, index2), (uint32_t)(value)))
#define OTFAD_CLR_CTX_KEY(base, index, index2, value) (BME_AND32(&OTFAD_CTX_KEY_REG(base, index, index2), (uint32_t)(~(value))))
#define OTFAD_TOG_CTX_KEY(base, index, index2, value) (BME_XOR32(&OTFAD_CTX_KEY_REG(base, index, index2), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * OTFAD_CTX_CTR - AES Counter Word0
 ******************************************************************************/

/*!
 * @brief OTFAD_CTX_CTR - AES Counter Word0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CTXn_CTR_Wm registers provide a 2-dimensional data structure for local
 * OTFAD storage of 64 bits of the counter value for context "n". There are two
 * consecutive memory-mapped register words defining the upper 96 bits of the
 * counter used for the AES calculations associated with the given context. The
 * programming model view of the CTXn_CTR_Wm registers is a little-endian 8-element byte
 * data array. The entire 128-bit counter value is defined as the concatenation
 * of four 32-bit values: CTR[127-0] = {CTR_W0[C0...C3], CTR_W1[C4...C7],
 * CTR_W0[C0...C3] ^ CTR_W1[C4...C7], systemAddress[31-4], 0h}
 */
/*!
 * @name Constants and macros for entire OTFAD_CTX_CTR register
 */
/*@{*/
#define OTFAD_RD_CTX_CTR(base, index, index2) (OTFAD_CTX_CTR_REG(base, index, index2))
#define OTFAD_WR_CTX_CTR(base, index, index2, value) (OTFAD_CTX_CTR_REG(base, index, index2) = (value))
#define OTFAD_RMW_CTX_CTR(base, index, index2, mask, value) (OTFAD_WR_CTX_CTR(base, index, index2, (OTFAD_RD_CTX_CTR(base, index, index2) & ~(mask)) | (value)))
#define OTFAD_SET_CTX_CTR(base, index, index2, value) (BME_OR32(&OTFAD_CTX_CTR_REG(base, index, index2), (uint32_t)(value)))
#define OTFAD_CLR_CTX_CTR(base, index, index2, value) (BME_AND32(&OTFAD_CTX_CTR_REG(base, index, index2), (uint32_t)(~(value))))
#define OTFAD_TOG_CTX_CTR(base, index, index2, value) (BME_XOR32(&OTFAD_CTX_CTR_REG(base, index, index2), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * OTFAD_CTX_RGD - AES Region Descriptor Word0
 ******************************************************************************/

/*!
 * @brief OTFAD_CTX_RGD - AES Region Descriptor Word0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CTXn_RGD_Wm registers provide a 2-dimensional data structure for local
 * OTFAD storage of 64 bits of memory region descriptor for context "n". There are
 * two consecutive memory-mapped register words defining the starting and ending
 * addresses for the external flash memory region associated with the given
 * context. Each memory region context defines a specified section of external flash
 * memory associated with the given context and its associated 128-bit key and
 * 128-bit counter values. The context memory regions are defined as modulo-1024
 * bytes to match the AMBA-AHB protocol requirement that no bursting transfer cross
 * that boundary. As a result, no AHB command, either single transfer, or any
 * type of wrapping or incrementing burst, can cross any 1 KB boundary. This means
 * that any AHB transfer is limited to a single context for purposes of AES
 * decryption.
 */
/*!
 * @name Constants and macros for entire OTFAD_CTX_RGD register
 */
/*@{*/
#define OTFAD_RD_CTX_RGD(base, index, index2) (OTFAD_CTX_RGD_REG(base, index, index2))
#define OTFAD_WR_CTX_RGD(base, index, index2, value) (OTFAD_CTX_RGD_REG(base, index, index2) = (value))
#define OTFAD_RMW_CTX_RGD(base, index, index2, mask, value) (OTFAD_WR_CTX_RGD(base, index, index2, (OTFAD_RD_CTX_RGD(base, index, index2) & ~(mask)) | (value)))
#define OTFAD_SET_CTX_RGD(base, index, index2, value) (BME_OR32(&OTFAD_CTX_RGD_REG(base, index, index2), (uint32_t)(value)))
#define OTFAD_CLR_CTX_RGD(base, index, index2, value) (BME_AND32(&OTFAD_CTX_RGD_REG(base, index, index2), (uint32_t)(~(value))))
#define OTFAD_TOG_CTX_RGD(base, index, index2, value) (BME_XOR32(&OTFAD_CTX_RGD_REG(base, index, index2), (uint32_t)(value)))
/*@}*/

