whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual OTFAD_CTX_RGD bitfields
 */

/*!
 * @name Register OTFAD_CTX_RGD, field VLD[0] (RW)
 *
 * This field signals if the context is valid or not.
 *
 * Values:
 * - 0b0 - Context is invalid.
 * - 0b1 - Context is valid.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CTX_RGD_VLD field. */
#define OTFAD_RD_CTX_RGD_VLD(base, index, index2) ((OTFAD_CTX_RGD_REG(base, index, index2) & OTFAD_CTX_RGD_VLD_MASK) >> OTFAD_CTX_RGD_VLD_SHIFT)
#define OTFAD_BRD_CTX_RGD_VLD(base, index, index2) (BME_UBFX32(&OTFAD_CTX_RGD_REG(base, index, index2), OTFAD_CTX_RGD_VLD_SHIFT, OTFAD_CTX_RGD_VLD_WIDTH))

/*! @brief Set the VLD field to a new value. */
#define OTFAD_WR_CTX_RGD_VLD(base, index, index2, value) (OTFAD_RMW_CTX_RGD(base, index, index2, OTFAD_CTX_RGD_VLD_MASK, OTFAD_CTX_RGD_VLD(value)))
#define OTFAD_BWR_CTX_RGD_VLD(base, index, index2, value) (BME_BFI32(&OTFAD_CTX_RGD_REG(base, index, index2), ((uint32_t)(value) << OTFAD_CTX_RGD_VLD_SHIFT), OTFAD_CTX_RGD_VLD_SHIFT, OTFAD_CTX_RGD_VLD_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CTX_RGD, field ADE[1] (RW)
 *
 * For accesses hitting in a valid context, this bit indicates if the fetched
 * data is to be decrypted or simply bypassed.
 *
 * Values:
 * - 0b0 - Bypass the fetched data.
 * - 0b1 - Perform the CTR-AES128 mode decryption on the fetched data.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CTX_RGD_ADE field. */
#define OTFAD_RD_CTX_RGD_ADE(base, index, index2) ((OTFAD_CTX_RGD_REG(base, index, index2) & OTFAD_CTX_RGD_ADE_MASK) >> OTFAD_CTX_RGD_ADE_SHIFT)
#define OTFAD_BRD_CTX_RGD_ADE(base, index, index2) (BME_UBFX32(&OTFAD_CTX_RGD_REG(base, index, index2), OTFAD_CTX_RGD_ADE_SHIFT, OTFAD_CTX_RGD_ADE_WIDTH))

/*! @brief Set the ADE field to a new value. */
#define OTFAD_WR_CTX_RGD_ADE(base, index, index2, value) (OTFAD_RMW_CTX_RGD(base, index, index2, OTFAD_CTX_RGD_ADE_MASK, OTFAD_CTX_RGD_ADE(value)))
#define OTFAD_BWR_CTX_RGD_ADE(base, index, index2, value) (BME_BFI32(&OTFAD_CTX_RGD_REG(base, index, index2), ((uint32_t)(value) << OTFAD_CTX_RGD_ADE_SHIFT), OTFAD_CTX_RGD_ADE_SHIFT, OTFAD_CTX_RGD_ADE_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CTX_RGD, field RO[2] (RW)
 *
 * This field signals that the entire set of context registers (CTXn_KEY_W[0-3],
 * CTXn_CTR_W[0-1], CTXn_RGD_W[0-1] are read-only and cannot be modified. This
 * field is sticky and remains asserted until the next system reset. SR[RRAM]
 * provides another level of register access control and is independent of the RO
 * indicator.
 *
 * Values:
 * - 0b0 - The context registers can be accessed normally (as defined by
 *     SR[RRAM]).
 * - 0b1 - The context registers are read-only and accesses may be further
 *     restricted based on SR[RRAM].
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CTX_RGD_RO field. */
#define OTFAD_RD_CTX_RGD_RO(base, index, index2) ((OTFAD_CTX_RGD_REG(base, index, index2) & OTFAD_CTX_RGD_RO_MASK) >> OTFAD_CTX_RGD_RO_SHIFT)
#define OTFAD_BRD_CTX_RGD_RO(base, index, index2) (BME_UBFX32(&OTFAD_CTX_RGD_REG(base, index, index2), OTFAD_CTX_RGD_RO_SHIFT, OTFAD_CTX_RGD_RO_WIDTH))

/*! @brief Set the RO field to a new value. */
#define OTFAD_WR_CTX_RGD_RO(base, index, index2, value) (OTFAD_RMW_CTX_RGD(base, index, index2, OTFAD_CTX_RGD_RO_MASK, OTFAD_CTX_RGD_RO(value)))
#define OTFAD_BWR_CTX_RGD_RO(base, index, index2, value) (BME_BFI32(&OTFAD_CTX_RGD_REG(base, index, index2), ((uint32_t)(value) << OTFAD_CTX_RGD_RO_SHIFT), OTFAD_CTX_RGD_RO_SHIFT, OTFAD_CTX_RGD_RO_WIDTH))
/*@}*/

/*!
 * @name Register OTFAD_CTX_RGD, field ENDADDR[31:10] (RW)
 *
 * This field defines the most significant bits of the 1023-modulo-1024 byte end
 * address of the memory region for context n.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CTX_RGD_ENDADDR field. */
#define OTFAD_RD_CTX_RGD_ENDADDR(base, index, index2) ((OTFAD_CTX_RGD_REG(base, index, index2) & OTFAD_CTX_RGD_ENDADDR_MASK) >> OTFAD_CTX_RGD_ENDADDR_SHIFT)
#define OTFAD_BRD_CTX_RGD_ENDADDR(base, index, index2) (OTFAD_RD_CTX_RGD_ENDADDR(base, index, index2))

/*! @brief Set the ENDADDR field to a new value. */
#define OTFAD_WR_CTX_RGD_ENDADDR(base, index, index2, value) (OTFAD_RMW_CTX_RGD(base, index, index2, OTFAD_CTX_RGD_ENDADDR_MASK, OTFAD_CTX_RGD_ENDADDR(value)))
#define OTFAD_BWR_CTX_RGD_ENDADDR(base, index, index2, value) (OTFAD_WR_CTX_RGD_ENDADDR(base, index, index2, value))
/*@}*/

/*!
 * @name Register OTFAD_CTX_RGD, field SRTADDR[31:10] (RW)
 *
 * This field defines the most significant bits of the 0-modulo-1024 byte start
 * address of the memory region for context n.
 */
/*@{*/
/*! @brief Read current value of the OTFAD_CTX_RGD_SRTADDR field. */
#define OTFAD_RD_CTX_RGD_SRTADDR(base, index, index2) ((OTFAD_CTX_RGD_REG(base, index, index2) & OTFAD_CTX_RGD_SRTADDR_MASK) >> OTFAD_CTX_RGD_SRTADDR_SHIFT)
#define OTFAD_BRD_CTX_RGD_SRTADDR(base, index, index2) (OTFAD_RD_CTX_RGD_SRTADDR(base, index, index2))

/*! @brief Set the SRTADDR field to a new value. */
#define OTFAD_WR_CTX_RGD_SRTADDR(base, index, index2, value) (OTFAD_RMW_CTX_RGD(base, index, index2, OTFAD_CTX_RGD_SRTADDR_MASK, OTFAD_CTX_RGD_SRTADDR(value)))
#define OTFAD_BWR_CTX_RGD_SRTADDR(base, index, index2, value) (OTFAD_WR_CTX_RGD_SRTADDR(base, index, index2, value))
/*@}*/

/*
 * MK82F25615 PDB
 *
 * Programmable Delay Block
 *
 * Registers defined in this header file:
 * - PDB_SC - Status and Control register
 * - PDB_MOD - Modulus register
 * - PDB_CNT - Counter register
 * - PDB_IDLY - Interrupt Delay register
 * - PDB_C1 - Channel n Control register 1
 * - PDB_S - Channel n Status register
 * - PDB_DLY - Channel n Delay 0 register
 * - PDB_INTC - DAC Interval Trigger n Control register
 * - PDB_INT - DAC Interval n register
 * - PDB_POEN - Pulse-Out n Enable register
 * - PDB_PODLY - Pulse-Out n Delay register
 */

#define PDB_INSTANCE_COUNT (1U) /*!< Number of instances of the PDB module. */
#define PDB0_IDX (0U) /*!< Instance number for PDB0. */

/*******************************************************************************
 * PDB_SC - Status and Control register
 ******************************************************************************/

/*!
 * @brief PDB_SC - Status and Control register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_SC register
 */
/*@{*/
#define PDB_RD_SC(base)          (PDB_SC_REG(base))
#define PDB_WR_SC(base, value)   (PDB_SC_REG(base) = (value))
#define PDB_RMW_SC(base, mask, value) (PDB_WR_SC(base, (PDB_RD_SC(base) & ~(mask)) | (value)))
#define PDB_SET_SC(base, value)  (BME_OR32(&PDB_SC_REG(base), (uint32_t)(value)))
#define PDB_CLR_SC(base, value)  (BME_AND32(&PDB_SC_REG(base), (uint32_t)(~(value))))
#define PDB_TOG_SC(base, value)  (BME_XOR32(&PDB_SC_REG(base), (uint32_t)(value)))
/*@}*/

