whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the END_CFG field to a new value. */
#define QuadSPI_WR_MCR_END_CFG(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_END_CFG_MASK, QuadSPI_MCR_END_CFG(value)))
#define QuadSPI_BWR_MCR_END_CFG(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_END_CFG_SHIFT), QuadSPI_MCR_END_CFG_SHIFT, QuadSPI_MCR_END_CFG_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field DQS_LAT_EN[5] (RW)
 *
 * DQS Latency Enable: This field is valid when latency is included in between
 * read access from FLash in case when QSPI_MCR[DQS_EN] is 1.For more details
 * Refer Data Strobe Signal Functionality
 *
 * Values:
 * - 0b0 - DQS Latency disabled
 * - 0b1 - DQS feature with latency included enabled
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_DQS_LAT_EN field. */
#define QuadSPI_RD_MCR_DQS_LAT_EN(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_DQS_LAT_EN_MASK) >> QuadSPI_MCR_DQS_LAT_EN_SHIFT)
#define QuadSPI_BRD_MCR_DQS_LAT_EN(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_DQS_LAT_EN_SHIFT, QuadSPI_MCR_DQS_LAT_EN_WIDTH))

/*! @brief Set the DQS_LAT_EN field to a new value. */
#define QuadSPI_WR_MCR_DQS_LAT_EN(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_DQS_LAT_EN_MASK, QuadSPI_MCR_DQS_LAT_EN(value)))
#define QuadSPI_BWR_MCR_DQS_LAT_EN(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_DQS_LAT_EN_SHIFT), QuadSPI_MCR_DQS_LAT_EN_SHIFT, QuadSPI_MCR_DQS_LAT_EN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field DQS_EN[6] (RW)
 *
 * DQS enable: This field is valid for both SDR and DDR mode.For more details
 * Refer Data Strobe Signal Functionality
 *
 * Values:
 * - 0b0 - DQS disabled.
 * - 0b1 - DQS enabled- When enabled, the incoming data is sampled on both the
 *     edges of DQS input when QSPI_MCR[DDR_EN] is set, else, on only one edge
 *     when QSPI_MCR[DDR_EN] is 0. The QSPI_SMPR[DDR_SMP] values are ignored.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_DQS_EN field. */
#define QuadSPI_RD_MCR_DQS_EN(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_DQS_EN_MASK) >> QuadSPI_MCR_DQS_EN_SHIFT)
#define QuadSPI_BRD_MCR_DQS_EN(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_DQS_EN_SHIFT, QuadSPI_MCR_DQS_EN_WIDTH))

/*! @brief Set the DQS_EN field to a new value. */
#define QuadSPI_WR_MCR_DQS_EN(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_DQS_EN_MASK, QuadSPI_MCR_DQS_EN(value)))
#define QuadSPI_BWR_MCR_DQS_EN(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_DQS_EN_SHIFT), QuadSPI_MCR_DQS_EN_SHIFT, QuadSPI_MCR_DQS_EN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field DDR_EN[7] (RW)
 *
 * DDR mode enable:
 *
 * Values:
 * - 0b0 - 2x and 4x clocks are disabled for SDR instructions only
 * - 0b1 - 2x and 4x clocks are enabled supports both SDR and DDR instruction.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_DDR_EN field. */
#define QuadSPI_RD_MCR_DDR_EN(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_DDR_EN_MASK) >> QuadSPI_MCR_DDR_EN_SHIFT)
#define QuadSPI_BRD_MCR_DDR_EN(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_DDR_EN_SHIFT, QuadSPI_MCR_DDR_EN_WIDTH))

/*! @brief Set the DDR_EN field to a new value. */
#define QuadSPI_WR_MCR_DDR_EN(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_DDR_EN_MASK, QuadSPI_MCR_DDR_EN(value)))
#define QuadSPI_BWR_MCR_DDR_EN(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_DDR_EN_SHIFT), QuadSPI_MCR_DDR_EN_SHIFT, QuadSPI_MCR_DDR_EN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field CLR_RXF[10] (WORZ)
 *
 * Clear RX FIFO. Invalidate the RX Buffer. This is a self-clearing field.
 *
 * Values:
 * - 0b0 - No action.
 * - 0b1 - Read and write pointers of the RX Buffer are reset to 0.
 *     QSPI_RBSR[RDBFL] is reset to 0.
 */
/*@{*/
/*! @brief Set the CLR_RXF field to a new value. */
#define QuadSPI_WR_MCR_CLR_RXF(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_CLR_RXF_MASK, QuadSPI_MCR_CLR_RXF(value)))
#define QuadSPI_BWR_MCR_CLR_RXF(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_CLR_RXF_SHIFT), QuadSPI_MCR_CLR_RXF_SHIFT, QuadSPI_MCR_CLR_RXF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field CLR_TXF[11] (WORZ)
 *
 * Clear TX FIFO/Buffer. Invalidate the TX Buffer content. This is a
 * self-clearing field.
 *
 * Values:
 * - 0b0 - No action.
 * - 0b1 - Read and write pointers of the TX Buffer are reset to 0.
 *     QSPI_TBSR[TRCTR] is reset to 0.
 */
/*@{*/
/*! @brief Set the CLR_TXF field to a new value. */
#define QuadSPI_WR_MCR_CLR_TXF(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_CLR_TXF_MASK, QuadSPI_MCR_CLR_TXF(value)))
#define QuadSPI_BWR_MCR_CLR_TXF(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_CLR_TXF_SHIFT), QuadSPI_MCR_CLR_TXF_SHIFT, QuadSPI_MCR_CLR_TXF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field MDIS[14] (RW)
 *
 * Module Disable. The MDIS bit allows the clock to the non-memory mapped logic
 * in the QuadSPI to be stopped, putting the QuadSPI in a software controlled
 * power-saving state.
 *
 * Values:
 * - 0b0 - Enable QuadSPI clocks.
 * - 0b1 - Allow external logic to disable QuadSPI clocks.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_MDIS field. */
#define QuadSPI_RD_MCR_MDIS(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_MDIS_MASK) >> QuadSPI_MCR_MDIS_SHIFT)
#define QuadSPI_BRD_MCR_MDIS(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_MDIS_SHIFT, QuadSPI_MCR_MDIS_WIDTH))

/*! @brief Set the MDIS field to a new value. */
#define QuadSPI_WR_MCR_MDIS(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_MDIS_MASK, QuadSPI_MCR_MDIS(value)))
#define QuadSPI_BWR_MCR_MDIS(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_MDIS_SHIFT), QuadSPI_MCR_MDIS_SHIFT, QuadSPI_MCR_MDIS_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field SCLKCFG[31:24] (RW)
 *
 * Serial Clock Configuration. This field configuration is chip specific. For
 * details, refer to chip-specific QuadSPI information. It may be used for dividing
 * clocks.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_SCLKCFG field. */
#define QuadSPI_RD_MCR_SCLKCFG(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_SCLKCFG_MASK) >> QuadSPI_MCR_SCLKCFG_SHIFT)
#define QuadSPI_BRD_MCR_SCLKCFG(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_SCLKCFG_SHIFT, QuadSPI_MCR_SCLKCFG_WIDTH))

/*! @brief Set the SCLKCFG field to a new value. */
#define QuadSPI_WR_MCR_SCLKCFG(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_SCLKCFG_MASK, QuadSPI_MCR_SCLKCFG(value)))
#define QuadSPI_BWR_MCR_SCLKCFG(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_SCLKCFG_SHIFT), QuadSPI_MCR_SCLKCFG_SHIFT, QuadSPI_MCR_SCLKCFG_WIDTH))
/*@}*/

