whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * QuadSPI_IPCR - IP Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_IPCR - IP Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The IP configuration register provides all the configuration required for an
 * IP initiated command. An IP command can be triggered by writing in the SEQID
 * field of this register. If the SEQID field is written successfully, a new
 * command to the external serial flash is started as per the sequence pointed to by
 * the SEQID field. Refer to Normal Mode , for details about the command
 * triggering and command execution. Write: QSPI_SR[IP_ACC]=0
 */
/*!
 * @name Constants and macros for entire QuadSPI_IPCR register
 */
/*@{*/
#define QuadSPI_RD_IPCR(base)    (QuadSPI_IPCR_REG(base))
#define QuadSPI_WR_IPCR(base, value) (QuadSPI_IPCR_REG(base) = (value))
#define QuadSPI_RMW_IPCR(base, mask, value) (QuadSPI_WR_IPCR(base, (QuadSPI_RD_IPCR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_IPCR(base, value) (BME_OR32(&QuadSPI_IPCR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_IPCR(base, value) (BME_AND32(&QuadSPI_IPCR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_IPCR(base, value) (BME_XOR32(&QuadSPI_IPCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_IPCR bitfields
 */

/*!
 * @name Register QuadSPI_IPCR, field IDATSZ[15:0] (RW)
 *
 * IP data transfer size: Defines the data transfer size in bytes of the IP
 * command.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_IPCR_IDATSZ field. */
#define QuadSPI_RD_IPCR_IDATSZ(base) ((QuadSPI_IPCR_REG(base) & QuadSPI_IPCR_IDATSZ_MASK) >> QuadSPI_IPCR_IDATSZ_SHIFT)
#define QuadSPI_BRD_IPCR_IDATSZ(base) (QuadSPI_RD_IPCR_IDATSZ(base))

/*! @brief Set the IDATSZ field to a new value. */
#define QuadSPI_WR_IPCR_IDATSZ(base, value) (QuadSPI_RMW_IPCR(base, QuadSPI_IPCR_IDATSZ_MASK, QuadSPI_IPCR_IDATSZ(value)))
#define QuadSPI_BWR_IPCR_IDATSZ(base, value) (QuadSPI_WR_IPCR_IDATSZ(base, value))
/*@}*/

/*!
 * @name Register QuadSPI_IPCR, field PAR_EN[16] (RW)
 *
 * When set, a transaction to two serial flash devices is triggered in parallel
 * mode. Refer to Parallel Flash Modefor more details.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_IPCR_PAR_EN field. */
#define QuadSPI_RD_IPCR_PAR_EN(base) ((QuadSPI_IPCR_REG(base) & QuadSPI_IPCR_PAR_EN_MASK) >> QuadSPI_IPCR_PAR_EN_SHIFT)
#define QuadSPI_BRD_IPCR_PAR_EN(base) (BME_UBFX32(&QuadSPI_IPCR_REG(base), QuadSPI_IPCR_PAR_EN_SHIFT, QuadSPI_IPCR_PAR_EN_WIDTH))

/*! @brief Set the PAR_EN field to a new value. */
#define QuadSPI_WR_IPCR_PAR_EN(base, value) (QuadSPI_RMW_IPCR(base, QuadSPI_IPCR_PAR_EN_MASK, QuadSPI_IPCR_PAR_EN(value)))
#define QuadSPI_BWR_IPCR_PAR_EN(base, value) (BME_BFI32(&QuadSPI_IPCR_REG(base), ((uint32_t)(value) << QuadSPI_IPCR_PAR_EN_SHIFT), QuadSPI_IPCR_PAR_EN_SHIFT, QuadSPI_IPCR_PAR_EN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_IPCR, field SEQID[27:24] (RW)
 *
 * Points to a sequence in the Look-up-table. The SEQID defines the bits [6:2]
 * of the LUT index. The bits [1:0] are always assumed to be 0. Refer to Look-up
 * Table for more details. A write to this bit -field triggers a transaction on
 * the serial flash interface.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_IPCR_SEQID field. */
#define QuadSPI_RD_IPCR_SEQID(base) ((QuadSPI_IPCR_REG(base) & QuadSPI_IPCR_SEQID_MASK) >> QuadSPI_IPCR_SEQID_SHIFT)
#define QuadSPI_BRD_IPCR_SEQID(base) (BME_UBFX32(&QuadSPI_IPCR_REG(base), QuadSPI_IPCR_SEQID_SHIFT, QuadSPI_IPCR_SEQID_WIDTH))

/*! @brief Set the SEQID field to a new value. */
#define QuadSPI_WR_IPCR_SEQID(base, value) (QuadSPI_RMW_IPCR(base, QuadSPI_IPCR_SEQID_MASK, QuadSPI_IPCR_SEQID(value)))
#define QuadSPI_BWR_IPCR_SEQID(base, value) (BME_BFI32(&QuadSPI_IPCR_REG(base), ((uint32_t)(value) << QuadSPI_IPCR_SEQID_SHIFT), QuadSPI_IPCR_SEQID_SHIFT, QuadSPI_IPCR_SEQID_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_FLSHCR - Flash Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_FLSHCR - Flash Configuration Register (RW)
 *
 * Reset value: 0x00000303U
 *
 * The Flash configuration register contains the flash device specific timings
 * that must be met by the QuadSPI controller for the device to function
 * correctly. Write: QSPI_SR[AHB_ACC] = 0 QSPI_SR[IP_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_FLSHCR register
 */
/*@{*/
#define QuadSPI_RD_FLSHCR(base)  (QuadSPI_FLSHCR_REG(base))
#define QuadSPI_WR_FLSHCR(base, value) (QuadSPI_FLSHCR_REG(base) = (value))
#define QuadSPI_RMW_FLSHCR(base, mask, value) (QuadSPI_WR_FLSHCR(base, (QuadSPI_RD_FLSHCR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_FLSHCR(base, value) (BME_OR32(&QuadSPI_FLSHCR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_FLSHCR(base, value) (BME_AND32(&QuadSPI_FLSHCR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_FLSHCR(base, value) (BME_XOR32(&QuadSPI_FLSHCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_FLSHCR bitfields
 */

/*!
 * @name Register QuadSPI_FLSHCR, field TCSS[3:0] (RW)
 *
 * Serial flash CS setup time in terms of serial flash clock cycles. The actual
 * delay between chip select and clock is defined as: TCSS= 0.5 SCK clk if N= 0/1
 * else, N+0.5 SCK clk if N>1, where N is the setting of TCSS Any update to the
 * TCSS register bits is visible on the flash interface only from the second
 * transaction following the update
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FLSHCR_TCSS field. */
#define QuadSPI_RD_FLSHCR_TCSS(base) ((QuadSPI_FLSHCR_REG(base) & QuadSPI_FLSHCR_TCSS_MASK) >> QuadSPI_FLSHCR_TCSS_SHIFT)
#define QuadSPI_BRD_FLSHCR_TCSS(base) (BME_UBFX32(&QuadSPI_FLSHCR_REG(base), QuadSPI_FLSHCR_TCSS_SHIFT, QuadSPI_FLSHCR_TCSS_WIDTH))

/*! @brief Set the TCSS field to a new value. */
#define QuadSPI_WR_FLSHCR_TCSS(base, value) (QuadSPI_RMW_FLSHCR(base, QuadSPI_FLSHCR_TCSS_MASK, QuadSPI_FLSHCR_TCSS(value)))
#define QuadSPI_BWR_FLSHCR_TCSS(base, value) (BME_BFI32(&QuadSPI_FLSHCR_REG(base), ((uint32_t)(value) << QuadSPI_FLSHCR_TCSS_SHIFT), QuadSPI_FLSHCR_TCSS_SHIFT, QuadSPI_FLSHCR_TCSS_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FLSHCR, field TCSH[11:8] (RW)
 *
 * Serial flash CS hold time in terms of serial flash clock cycles. The actual
 * delay between chip select and clock is defined as: TCSH= 1 SCK clk if N= 0/1
 * else, N SCK clk if N>1, where N is the setting of TCSH
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FLSHCR_TCSH field. */
#define QuadSPI_RD_FLSHCR_TCSH(base) ((QuadSPI_FLSHCR_REG(base) & QuadSPI_FLSHCR_TCSH_MASK) >> QuadSPI_FLSHCR_TCSH_SHIFT)
#define QuadSPI_BRD_FLSHCR_TCSH(base) (BME_UBFX32(&QuadSPI_FLSHCR_REG(base), QuadSPI_FLSHCR_TCSH_SHIFT, QuadSPI_FLSHCR_TCSH_WIDTH))

/*! @brief Set the TCSH field to a new value. */
#define QuadSPI_WR_FLSHCR_TCSH(base, value) (QuadSPI_RMW_FLSHCR(base, QuadSPI_FLSHCR_TCSH_MASK, QuadSPI_FLSHCR_TCSH(value)))
#define QuadSPI_BWR_FLSHCR_TCSH(base, value) (BME_BFI32(&QuadSPI_FLSHCR_REG(base), ((uint32_t)(value) << QuadSPI_FLSHCR_TCSH_SHIFT), QuadSPI_FLSHCR_TCSH_SHIFT, QuadSPI_FLSHCR_TCSH_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FLSHCR, field TDH[17:16] (RW)
 *
 * Serial flash Data In hold time: This helps in meeting the Data In Hold time
 * requirement of a Flash. This is valid only in DDR mode.Refer to Data input hold
 * requirement of Flash for details.
 *
 * Values:
 * - 0b00 - Data aligned with the posedge of Internal reference clock of QuadSPI
 * - 0b01 - Data aligned with 2x serial flash half clock
 * - 0b10 - Data aligned with 4x serial flash half clock
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FLSHCR_TDH field. */
#define QuadSPI_RD_FLSHCR_TDH(base) ((QuadSPI_FLSHCR_REG(base) & QuadSPI_FLSHCR_TDH_MASK) >> QuadSPI_FLSHCR_TDH_SHIFT)
#define QuadSPI_BRD_FLSHCR_TDH(base) (BME_UBFX32(&QuadSPI_FLSHCR_REG(base), QuadSPI_FLSHCR_TDH_SHIFT, QuadSPI_FLSHCR_TDH_WIDTH))

