whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the TDH field to a new value. */
#define QuadSPI_WR_FLSHCR_TDH(base, value) (QuadSPI_RMW_FLSHCR(base, QuadSPI_FLSHCR_TDH_MASK, QuadSPI_FLSHCR_TDH(value)))
#define QuadSPI_BWR_FLSHCR_TDH(base, value) (BME_BFI32(&QuadSPI_FLSHCR_REG(base), ((uint32_t)(value) << QuadSPI_FLSHCR_TDH_SHIFT), QuadSPI_FLSHCR_TDH_SHIFT, QuadSPI_FLSHCR_TDH_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_BUF0CR - Buffer0 Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BUF0CR - Buffer0 Configuration Register (RW)
 *
 * Reset value: 0x00000002U
 *
 * This register provides the configuration for any access to buffer0. An access
 * is routed to buffer0 when the master port number of the incoming AHB request
 * matches the MSTRID field of the BUF0CR. Any buffer "miss" leads to a serial
 * flash transaction being triggered as per the sequence pointed to the SEQID
 * field. Buffer0 may also be configured as a high priority buffer by setting the
 * HP_EN field of this register. Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BUF0CR register
 */
/*@{*/
#define QuadSPI_RD_BUF0CR(base)  (QuadSPI_BUF0CR_REG(base))
#define QuadSPI_WR_BUF0CR(base, value) (QuadSPI_BUF0CR_REG(base) = (value))
#define QuadSPI_RMW_BUF0CR(base, mask, value) (QuadSPI_WR_BUF0CR(base, (QuadSPI_RD_BUF0CR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BUF0CR(base, value) (BME_OR32(&QuadSPI_BUF0CR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BUF0CR(base, value) (BME_AND32(&QuadSPI_BUF0CR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BUF0CR(base, value) (BME_XOR32(&QuadSPI_BUF0CR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_BUF0CR bitfields
 */

/*!
 * @name Register QuadSPI_BUF0CR, field MSTRID[3:0] (RW)
 *
 * Master ID: The ID of the AHB master associated with BUFFER0. Any AHB access
 * with this master port number is routed to this buffer. It must be ensured that
 * the master id's associated with all buffers must be different.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF0CR_MSTRID field. */
#define QuadSPI_RD_BUF0CR_MSTRID(base) ((QuadSPI_BUF0CR_REG(base) & QuadSPI_BUF0CR_MSTRID_MASK) >> QuadSPI_BUF0CR_MSTRID_SHIFT)
#define QuadSPI_BRD_BUF0CR_MSTRID(base) (BME_UBFX32(&QuadSPI_BUF0CR_REG(base), QuadSPI_BUF0CR_MSTRID_SHIFT, QuadSPI_BUF0CR_MSTRID_WIDTH))

/*! @brief Set the MSTRID field to a new value. */
#define QuadSPI_WR_BUF0CR_MSTRID(base, value) (QuadSPI_RMW_BUF0CR(base, QuadSPI_BUF0CR_MSTRID_MASK, QuadSPI_BUF0CR_MSTRID(value)))
#define QuadSPI_BWR_BUF0CR_MSTRID(base, value) (BME_BFI32(&QuadSPI_BUF0CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF0CR_MSTRID_SHIFT), QuadSPI_BUF0CR_MSTRID_SHIFT, QuadSPI_BUF0CR_MSTRID_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_BUF0CR, field ADATSZ[14:8] (RW)
 *
 * Defines the data transfer size in 8 bytes of an AHB triggered access to
 * serial flash. For example,a value of 0x2 will set transfer size to 16bytes.When
 * ADATSZ = 0, the data size mentioned the sequence pointed to by the SEQID field
 * overrides this value. SW should ensure that this transfer size is not greater
 * than the size of this buffer.If OTFAD is enabled, the QuadSPI module prefetches
 * only those many data's from Flash such that the prefetch never crosses the 1KB
 * boundary.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF0CR_ADATSZ field. */
#define QuadSPI_RD_BUF0CR_ADATSZ(base) ((QuadSPI_BUF0CR_REG(base) & QuadSPI_BUF0CR_ADATSZ_MASK) >> QuadSPI_BUF0CR_ADATSZ_SHIFT)
#define QuadSPI_BRD_BUF0CR_ADATSZ(base) (BME_UBFX32(&QuadSPI_BUF0CR_REG(base), QuadSPI_BUF0CR_ADATSZ_SHIFT, QuadSPI_BUF0CR_ADATSZ_WIDTH))

/*! @brief Set the ADATSZ field to a new value. */
#define QuadSPI_WR_BUF0CR_ADATSZ(base, value) (QuadSPI_RMW_BUF0CR(base, QuadSPI_BUF0CR_ADATSZ_MASK, QuadSPI_BUF0CR_ADATSZ(value)))
#define QuadSPI_BWR_BUF0CR_ADATSZ(base, value) (BME_BFI32(&QuadSPI_BUF0CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF0CR_ADATSZ_SHIFT), QuadSPI_BUF0CR_ADATSZ_SHIFT, QuadSPI_BUF0CR_ADATSZ_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_BUF0CR, field HP_EN[31] (RW)
 *
 * High Priority Enable: When set, the master associated with this buffer is
 * assigned a priority higher than the rest of the masters. An access by a high
 * priority master will suspend any ongoing prefetch by another AHB master and will
 * be serviced on high priority.The high priority feature is disabled if OTFAD is
 * enabled in the system. Refer to Flexible AHB Buffersfor details.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF0CR_HP_EN field. */
#define QuadSPI_RD_BUF0CR_HP_EN(base) ((QuadSPI_BUF0CR_REG(base) & QuadSPI_BUF0CR_HP_EN_MASK) >> QuadSPI_BUF0CR_HP_EN_SHIFT)
#define QuadSPI_BRD_BUF0CR_HP_EN(base) (BME_UBFX32(&QuadSPI_BUF0CR_REG(base), QuadSPI_BUF0CR_HP_EN_SHIFT, QuadSPI_BUF0CR_HP_EN_WIDTH))

/*! @brief Set the HP_EN field to a new value. */
#define QuadSPI_WR_BUF0CR_HP_EN(base, value) (QuadSPI_RMW_BUF0CR(base, QuadSPI_BUF0CR_HP_EN_MASK, QuadSPI_BUF0CR_HP_EN(value)))
#define QuadSPI_BWR_BUF0CR_HP_EN(base, value) (BME_BFI32(&QuadSPI_BUF0CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF0CR_HP_EN_SHIFT), QuadSPI_BUF0CR_HP_EN_SHIFT, QuadSPI_BUF0CR_HP_EN_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_BUF1CR - Buffer1 Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BUF1CR - Buffer1 Configuration Register (RW)
 *
 * Reset value: 0x00000003U
 *
 * This register provides the configuration for any access to buffer1. An access
 * is routed to buffer1 when the master port number of the incoming AHB request
 * matches the MSTRID field of the BUF1CR. Any buffer "miss" leads to the buffer
 * being flushed and a serial flash transaction being triggered as per the
 * sequence pointed to by the SEQID field. Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BUF1CR register
 */
/*@{*/
#define QuadSPI_RD_BUF1CR(base)  (QuadSPI_BUF1CR_REG(base))
#define QuadSPI_WR_BUF1CR(base, value) (QuadSPI_BUF1CR_REG(base) = (value))
#define QuadSPI_RMW_BUF1CR(base, mask, value) (QuadSPI_WR_BUF1CR(base, (QuadSPI_RD_BUF1CR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BUF1CR(base, value) (BME_OR32(&QuadSPI_BUF1CR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BUF1CR(base, value) (BME_AND32(&QuadSPI_BUF1CR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BUF1CR(base, value) (BME_XOR32(&QuadSPI_BUF1CR_REG(base), (uint32_t)(value)))
/*@}*/

