whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*
 * Constants & macros for individual QuadSPI_BUF2IND bitfields
 */

/*!
 * @name Register QuadSPI_BUF2IND, field TPINDX2[31:3] (RW)
 *
 * Top index of buffer 2.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF2IND_TPINDX2 field. */
#define QuadSPI_RD_BUF2IND_TPINDX2(base) ((QuadSPI_BUF2IND_REG(base) & QuadSPI_BUF2IND_TPINDX2_MASK) >> QuadSPI_BUF2IND_TPINDX2_SHIFT)
#define QuadSPI_BRD_BUF2IND_TPINDX2(base) (QuadSPI_RD_BUF2IND_TPINDX2(base))

/*! @brief Set the TPINDX2 field to a new value. */
#define QuadSPI_WR_BUF2IND_TPINDX2(base, value) (QuadSPI_RMW_BUF2IND(base, QuadSPI_BUF2IND_TPINDX2_MASK, QuadSPI_BUF2IND_TPINDX2(value)))
#define QuadSPI_BWR_BUF2IND_TPINDX2(base, value) (QuadSPI_WR_BUF2IND_TPINDX2(base, value))
/*@}*/

/*******************************************************************************
 * QuadSPI_SFAR - Serial Flash Address Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_SFAR - Serial Flash Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The module automatically translates this address on the memory map to the
 * address on the flash itself. When operating in 24bit mode, only bits 23-0 are
 * sent to the flash, in 32bit mode, bits 27-0 are used with bits 31-28 driven to 0
 * when QSPI_SFACR[CAS] is set to 0. Say, if QSPI_SFACR[CAS] is 3 then bits 26-3
 * are sent to flash as it page address in case flash is operating in 24bit mode.
 * Total number of address bits request by flash as it page and column address
 * must not be more than 32 bit. Refer to for the mapping between the access mode
 * and the QSPI_SFAR content and to Normal Modefor details about the command
 * triggering and command execution. The software should ensure that the serial flash
 * address provided in the QSPI_SFAR register lies in the valid flash address
 * range as defined in . Write: QSPI_SR[IP_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_SFAR register
 */
/*@{*/
#define QuadSPI_RD_SFAR(base)    (QuadSPI_SFAR_REG(base))
#define QuadSPI_WR_SFAR(base, value) (QuadSPI_SFAR_REG(base) = (value))
#define QuadSPI_RMW_SFAR(base, mask, value) (QuadSPI_WR_SFAR(base, (QuadSPI_RD_SFAR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SFAR(base, value) (BME_OR32(&QuadSPI_SFAR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SFAR(base, value) (BME_AND32(&QuadSPI_SFAR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SFAR(base, value) (BME_XOR32(&QuadSPI_SFAR_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * QuadSPI_SFACR - Serial Flash Address Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_SFACR - Serial Flash Address Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This serial flash address configuration register contains the serial flash
 * specific address requirements that must be configured according to the flash
 * connected, for the controller to function properly.The module automatically
 * translates the address QSPI_SFAR on the memory map or the incoming address on the
 * AHB bus to the column address on the flash itself. Say, a flash needs 3 bits as
 * its column address than only the lower 3 bits of QSPI_SFAR/AHB address are
 * send to Flash as its column address. The software should ensure that the serial
 * flash address provided in the QSPI_SFAR register or the incoming AHB address
 * lies in the valid flash address range. Write: QSPI_SR[IP_ACC] = 0
 * QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_SFACR register
 */
/*@{*/
#define QuadSPI_RD_SFACR(base)   (QuadSPI_SFACR_REG(base))
#define QuadSPI_WR_SFACR(base, value) (QuadSPI_SFACR_REG(base) = (value))
#define QuadSPI_RMW_SFACR(base, mask, value) (QuadSPI_WR_SFACR(base, (QuadSPI_RD_SFACR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SFACR(base, value) (BME_OR32(&QuadSPI_SFACR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SFACR(base, value) (BME_AND32(&QuadSPI_SFACR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SFACR(base, value) (BME_XOR32(&QuadSPI_SFACR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SFACR bitfields
 */

/*!
 * @name Register QuadSPI_SFACR, field CAS[3:0] (RW)
 *
 * It defines the width of the column address. If the coulmn address is say
 * [2:0] of QSPI_SFAR/AHB address, then CAS must be 3. If there is no column address
 * separation in any serial flash this bit must be programmed to 0.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SFACR_CAS field. */
#define QuadSPI_RD_SFACR_CAS(base) ((QuadSPI_SFACR_REG(base) & QuadSPI_SFACR_CAS_MASK) >> QuadSPI_SFACR_CAS_SHIFT)
#define QuadSPI_BRD_SFACR_CAS(base) (BME_UBFX32(&QuadSPI_SFACR_REG(base), QuadSPI_SFACR_CAS_SHIFT, QuadSPI_SFACR_CAS_WIDTH))

/*! @brief Set the CAS field to a new value. */
#define QuadSPI_WR_SFACR_CAS(base, value) (QuadSPI_RMW_SFACR(base, QuadSPI_SFACR_CAS_MASK, QuadSPI_SFACR_CAS(value)))
#define QuadSPI_BWR_SFACR_CAS(base, value) (BME_BFI32(&QuadSPI_SFACR_REG(base), ((uint32_t)(value) << QuadSPI_SFACR_CAS_SHIFT), QuadSPI_SFACR_CAS_SHIFT, QuadSPI_SFACR_CAS_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SFACR, field WA[16] (RW)
 *
 * It defines whether the serial flash is a byte addressable flash or a word
 * addressable flash. According to this bit configuration the address is re-mapped
 * to the flash interface. Refer to Address scheme for details
 *
 * Values:
 * - 0b0 - Byte addressable serial flash mode.
 * - 0b1 - Word (2 byte) addressable serial flash mode.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SFACR_WA field. */
#define QuadSPI_RD_SFACR_WA(base) ((QuadSPI_SFACR_REG(base) & QuadSPI_SFACR_WA_MASK) >> QuadSPI_SFACR_WA_SHIFT)
#define QuadSPI_BRD_SFACR_WA(base) (BME_UBFX32(&QuadSPI_SFACR_REG(base), QuadSPI_SFACR_WA_SHIFT, QuadSPI_SFACR_WA_WIDTH))

/*! @brief Set the WA field to a new value. */
#define QuadSPI_WR_SFACR_WA(base, value) (QuadSPI_RMW_SFACR(base, QuadSPI_SFACR_WA_MASK, QuadSPI_SFACR_WA(value)))
#define QuadSPI_BWR_SFACR_WA(base, value) (BME_BFI32(&QuadSPI_SFACR_REG(base), ((uint32_t)(value) << QuadSPI_SFACR_WA_SHIFT), QuadSPI_SFACR_WA_SHIFT, QuadSPI_SFACR_WA_WIDTH))
/*@}*/

