whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * QuadSPI_SMPR - Sampling Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_SMPR - Sampling Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Sampling Register allows configuration of how the incoming data from the
 * external serial flash devices are sampled in the QuadSPI module. Write:
 * Disabled Mode
 */
/*!
 * @name Constants and macros for entire QuadSPI_SMPR register
 */
/*@{*/
#define QuadSPI_RD_SMPR(base)    (QuadSPI_SMPR_REG(base))
#define QuadSPI_WR_SMPR(base, value) (QuadSPI_SMPR_REG(base) = (value))
#define QuadSPI_RMW_SMPR(base, mask, value) (QuadSPI_WR_SMPR(base, (QuadSPI_RD_SMPR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SMPR(base, value) (BME_OR32(&QuadSPI_SMPR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SMPR(base, value) (BME_AND32(&QuadSPI_SMPR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SMPR(base, value) (BME_XOR32(&QuadSPI_SMPR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SMPR bitfields
 */

/*!
 * @name Register QuadSPI_SMPR, field HSENA[0] (RW)
 *
 * This bit enables the divide by 2 of the clock to the external serial flash
 * device for all commands,only in SDR. Refer to Serial Flash Clock Frequency
 * Limitations for details.
 *
 * Values:
 * - 0b0 - Disable divide by 2 of serial flash clock for half speed commands
 * - 0b1 - Enable divide by 2 of serial flash clock for half speed commands
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SMPR_HSENA field. */
#define QuadSPI_RD_SMPR_HSENA(base) ((QuadSPI_SMPR_REG(base) & QuadSPI_SMPR_HSENA_MASK) >> QuadSPI_SMPR_HSENA_SHIFT)
#define QuadSPI_BRD_SMPR_HSENA(base) (BME_UBFX32(&QuadSPI_SMPR_REG(base), QuadSPI_SMPR_HSENA_SHIFT, QuadSPI_SMPR_HSENA_WIDTH))

/*! @brief Set the HSENA field to a new value. */
#define QuadSPI_WR_SMPR_HSENA(base, value) (QuadSPI_RMW_SMPR(base, QuadSPI_SMPR_HSENA_MASK, QuadSPI_SMPR_HSENA(value)))
#define QuadSPI_BWR_SMPR_HSENA(base, value) (BME_BFI32(&QuadSPI_SMPR_REG(base), ((uint32_t)(value) << QuadSPI_SMPR_HSENA_SHIFT), QuadSPI_SMPR_HSENA_SHIFT, QuadSPI_SMPR_HSENA_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SMPR, field HSPHS[1] (RW)
 *
 * Only relevant when HSENA bit is set. Select the delay with respect to the
 * reference edge for the sample point valid for half speed commands:
 *
 * Values:
 * - 0b0 - Select sampling at non-inverted clock
 * - 0b1 - Select sampling at inverted clock
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SMPR_HSPHS field. */
#define QuadSPI_RD_SMPR_HSPHS(base) ((QuadSPI_SMPR_REG(base) & QuadSPI_SMPR_HSPHS_MASK) >> QuadSPI_SMPR_HSPHS_SHIFT)
#define QuadSPI_BRD_SMPR_HSPHS(base) (BME_UBFX32(&QuadSPI_SMPR_REG(base), QuadSPI_SMPR_HSPHS_SHIFT, QuadSPI_SMPR_HSPHS_WIDTH))

/*! @brief Set the HSPHS field to a new value. */
#define QuadSPI_WR_SMPR_HSPHS(base, value) (QuadSPI_RMW_SMPR(base, QuadSPI_SMPR_HSPHS_MASK, QuadSPI_SMPR_HSPHS(value)))
#define QuadSPI_BWR_SMPR_HSPHS(base, value) (BME_BFI32(&QuadSPI_SMPR_REG(base), ((uint32_t)(value) << QuadSPI_SMPR_HSPHS_SHIFT), QuadSPI_SMPR_HSPHS_SHIFT, QuadSPI_SMPR_HSPHS_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SMPR, field HSDLY[2] (RW)
 *
 * Only relevant when HSENA bit is set. Select the delay with respect to the
 * reference edge for the sample point valid for half speed commands:
 *
 * Values:
 * - 0b0 - One clock cycle delay
 * - 0b1 - Two clock cycle delay
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SMPR_HSDLY field. */
#define QuadSPI_RD_SMPR_HSDLY(base) ((QuadSPI_SMPR_REG(base) & QuadSPI_SMPR_HSDLY_MASK) >> QuadSPI_SMPR_HSDLY_SHIFT)
#define QuadSPI_BRD_SMPR_HSDLY(base) (BME_UBFX32(&QuadSPI_SMPR_REG(base), QuadSPI_SMPR_HSDLY_SHIFT, QuadSPI_SMPR_HSDLY_WIDTH))

/*! @brief Set the HSDLY field to a new value. */
#define QuadSPI_WR_SMPR_HSDLY(base, value) (QuadSPI_RMW_SMPR(base, QuadSPI_SMPR_HSDLY_MASK, QuadSPI_SMPR_HSDLY(value)))
#define QuadSPI_BWR_SMPR_HSDLY(base, value) (BME_BFI32(&QuadSPI_SMPR_REG(base), ((uint32_t)(value) << QuadSPI_SMPR_HSDLY_SHIFT), QuadSPI_SMPR_HSDLY_SHIFT, QuadSPI_SMPR_HSDLY_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SMPR, field FSPHS[5] (RW)
 *
 * Select the edge of the sampling clock valid for full speed commands:
 *
 * Values:
 * - 0b0 - Select sampling at non-inverted clock
 * - 0b1 - Select sampling at inverted clock. This bit is also used in DQS mode
 *     and ignored when using non-DQS DDR instructions.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SMPR_FSPHS field. */
#define QuadSPI_RD_SMPR_FSPHS(base) ((QuadSPI_SMPR_REG(base) & QuadSPI_SMPR_FSPHS_MASK) >> QuadSPI_SMPR_FSPHS_SHIFT)
#define QuadSPI_BRD_SMPR_FSPHS(base) (BME_UBFX32(&QuadSPI_SMPR_REG(base), QuadSPI_SMPR_FSPHS_SHIFT, QuadSPI_SMPR_FSPHS_WIDTH))

/*! @brief Set the FSPHS field to a new value. */
#define QuadSPI_WR_SMPR_FSPHS(base, value) (QuadSPI_RMW_SMPR(base, QuadSPI_SMPR_FSPHS_MASK, QuadSPI_SMPR_FSPHS(value)))
#define QuadSPI_BWR_SMPR_FSPHS(base, value) (BME_BFI32(&QuadSPI_SMPR_REG(base), ((uint32_t)(value) << QuadSPI_SMPR_FSPHS_SHIFT), QuadSPI_SMPR_FSPHS_SHIFT, QuadSPI_SMPR_FSPHS_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SMPR, field FSDLY[6] (RW)
 *
 * Values:
 * - 0b0 - One clock cycle delay
 * - 0b1 - Two clock cycles delay. This bit is also used in DQS mode and ignored
 *     when using non-DQS DDR instructions.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SMPR_FSDLY field. */
#define QuadSPI_RD_SMPR_FSDLY(base) ((QuadSPI_SMPR_REG(base) & QuadSPI_SMPR_FSDLY_MASK) >> QuadSPI_SMPR_FSDLY_SHIFT)
#define QuadSPI_BRD_SMPR_FSDLY(base) (BME_UBFX32(&QuadSPI_SMPR_REG(base), QuadSPI_SMPR_FSDLY_SHIFT, QuadSPI_SMPR_FSDLY_WIDTH))

/*! @brief Set the FSDLY field to a new value. */
#define QuadSPI_WR_SMPR_FSDLY(base, value) (QuadSPI_RMW_SMPR(base, QuadSPI_SMPR_FSDLY_MASK, QuadSPI_SMPR_FSDLY(value)))
#define QuadSPI_BWR_SMPR_FSDLY(base, value) (BME_BFI32(&QuadSPI_SMPR_REG(base), ((uint32_t)(value) << QuadSPI_SMPR_FSDLY_SHIFT), QuadSPI_SMPR_FSDLY_SHIFT, QuadSPI_SMPR_FSDLY_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SMPR, field DDRSMP[18:16] (RW)
 *
 * Select the sampling point for incoming data when serial flash is executing a
 * DDR instruction. Refer to , for details on the sampling points.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SMPR_DDRSMP field. */
#define QuadSPI_RD_SMPR_DDRSMP(base) ((QuadSPI_SMPR_REG(base) & QuadSPI_SMPR_DDRSMP_MASK) >> QuadSPI_SMPR_DDRSMP_SHIFT)
#define QuadSPI_BRD_SMPR_DDRSMP(base) (BME_UBFX32(&QuadSPI_SMPR_REG(base), QuadSPI_SMPR_DDRSMP_SHIFT, QuadSPI_SMPR_DDRSMP_WIDTH))

