whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the DDRSMP field to a new value. */
#define QuadSPI_WR_SMPR_DDRSMP(base, value) (QuadSPI_RMW_SMPR(base, QuadSPI_SMPR_DDRSMP_MASK, QuadSPI_SMPR_DDRSMP(value)))
#define QuadSPI_BWR_SMPR_DDRSMP(base, value) (BME_BFI32(&QuadSPI_SMPR_REG(base), ((uint32_t)(value) << QuadSPI_SMPR_DDRSMP_SHIFT), QuadSPI_SMPR_DDRSMP_SHIFT, QuadSPI_SMPR_DDRSMP_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_RBSR - RX Buffer Status Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_RBSR - RX Buffer Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register contains information related to the receive data buffer.
 */
/*!
 * @name Constants and macros for entire QuadSPI_RBSR register
 */
/*@{*/
#define QuadSPI_RD_RBSR(base)    (QuadSPI_RBSR_REG(base))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_RBSR bitfields
 */

/*!
 * @name Register QuadSPI_RBSR, field RDBFL[12:8] (RO)
 *
 * RX Buffer Fill Level, indicates how many entries of 4 bytes are still
 * available in the RX Buffer.For example a value of 0x2 would indicate 8bytes are
 * available.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RBSR_RDBFL field. */
#define QuadSPI_RD_RBSR_RDBFL(base) ((QuadSPI_RBSR_REG(base) & QuadSPI_RBSR_RDBFL_MASK) >> QuadSPI_RBSR_RDBFL_SHIFT)
#define QuadSPI_BRD_RBSR_RDBFL(base) (BME_UBFX32(&QuadSPI_RBSR_REG(base), QuadSPI_RBSR_RDBFL_SHIFT, QuadSPI_RBSR_RDBFL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RBSR, field RDCTR[31:16] (RO)
 *
 * Read Counter, indicates how many entries of 4 bytes have been removed from
 * the RX Buffer. For example a value of 0x2 would indicate 8 bytes have been
 * removed It is incremented by the number (QSPI_RBCT[WMRK] + 1) on RX Buffer POP
 * event. The RX Buffer can be popped using DMA or pop flag QSPI_FR[RBDF]. The
 * QSPI_RSER[RBDDE] defines which pop has to be done. For further details please refer
 * to AHB RX Data Buffer (QSPI_ARDB0 to QSPI_ARDB15) and "Data Transfer from the
 * QuadSPI Module Internal Buffers section in Flash Readsection.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RBSR_RDCTR field. */
#define QuadSPI_RD_RBSR_RDCTR(base) ((QuadSPI_RBSR_REG(base) & QuadSPI_RBSR_RDCTR_MASK) >> QuadSPI_RBSR_RDCTR_SHIFT)
#define QuadSPI_BRD_RBSR_RDCTR(base) (QuadSPI_RD_RBSR_RDCTR(base))
/*@}*/

/*******************************************************************************
 * QuadSPI_RBCT - RX Buffer Control Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_RBCT - RX Buffer Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains control data related to the receive data buffer.
 * Write: QSPI_SR[IP_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_RBCT register
 */
/*@{*/
#define QuadSPI_RD_RBCT(base)    (QuadSPI_RBCT_REG(base))
#define QuadSPI_WR_RBCT(base, value) (QuadSPI_RBCT_REG(base) = (value))
#define QuadSPI_RMW_RBCT(base, mask, value) (QuadSPI_WR_RBCT(base, (QuadSPI_RD_RBCT(base) & ~(mask)) | (value)))
#define QuadSPI_SET_RBCT(base, value) (BME_OR32(&QuadSPI_RBCT_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_RBCT(base, value) (BME_AND32(&QuadSPI_RBCT_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_RBCT(base, value) (BME_XOR32(&QuadSPI_RBCT_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_RBCT bitfields
 */

/*!
 * @name Register QuadSPI_RBCT, field WMRK[3:0] (RW)
 *
 * RX Buffer Watermark: This field determines when the readout action of the RX
 * Buffer is triggered. When the number of valid entries in the RX Buffer is
 * equal to or greater than the number given by (WMRK+1) the QSPI_SR[RXWE] flag is
 * asserted.The value should be entered as the number of 4byte entries minus 1. For
 * example a value of 0x0 would set the watermark to 4bytes, 1 to 8bytes, 2 to
 * 12bytes etc. For details, refer to DMA Usage.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RBCT_WMRK field. */
#define QuadSPI_RD_RBCT_WMRK(base) ((QuadSPI_RBCT_REG(base) & QuadSPI_RBCT_WMRK_MASK) >> QuadSPI_RBCT_WMRK_SHIFT)
#define QuadSPI_BRD_RBCT_WMRK(base) (BME_UBFX32(&QuadSPI_RBCT_REG(base), QuadSPI_RBCT_WMRK_SHIFT, QuadSPI_RBCT_WMRK_WIDTH))

/*! @brief Set the WMRK field to a new value. */
#define QuadSPI_WR_RBCT_WMRK(base, value) (QuadSPI_RMW_RBCT(base, QuadSPI_RBCT_WMRK_MASK, QuadSPI_RBCT_WMRK(value)))
#define QuadSPI_BWR_RBCT_WMRK(base, value) (BME_BFI32(&QuadSPI_RBCT_REG(base), ((uint32_t)(value) << QuadSPI_RBCT_WMRK_SHIFT), QuadSPI_RBCT_WMRK_SHIFT, QuadSPI_RBCT_WMRK_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RBCT, field RXBRD[8] (RW)
 *
 * RX Buffer Readout: This bit specifies the access scheme for the RX Buffer
 * readout.
 *
 * Values:
 * - 0b0 - RX Buffer content is read using the AHB Bus registers QSPI_ARDB0 to
 *     QSPI_ARDB15. For details, refer to Exclusive Access to Serial Flash for AHB
 *     Commands.
 * - 0b1 - RX Buffer content is read using the IP Bus registers QSPI_RBDR0 to
 *     QSPI_RBDR15.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RBCT_RXBRD field. */
#define QuadSPI_RD_RBCT_RXBRD(base) ((QuadSPI_RBCT_REG(base) & QuadSPI_RBCT_RXBRD_MASK) >> QuadSPI_RBCT_RXBRD_SHIFT)
#define QuadSPI_BRD_RBCT_RXBRD(base) (BME_UBFX32(&QuadSPI_RBCT_REG(base), QuadSPI_RBCT_RXBRD_SHIFT, QuadSPI_RBCT_RXBRD_WIDTH))

/*! @brief Set the RXBRD field to a new value. */
#define QuadSPI_WR_RBCT_RXBRD(base, value) (QuadSPI_RMW_RBCT(base, QuadSPI_RBCT_RXBRD_MASK, QuadSPI_RBCT_RXBRD(value)))
#define QuadSPI_BWR_RBCT_RXBRD(base, value) (BME_BFI32(&QuadSPI_RBCT_REG(base), ((uint32_t)(value) << QuadSPI_RBCT_RXBRD_SHIFT), QuadSPI_RBCT_RXBRD_SHIFT, QuadSPI_RBCT_RXBRD_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_TBSR - TX Buffer Status Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_TBSR - TX Buffer Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register contains information related to the transmit data buffer.
 */
/*!
 * @name Constants and macros for entire QuadSPI_TBSR register
 */
/*@{*/
#define QuadSPI_RD_TBSR(base)    (QuadSPI_TBSR_REG(base))
/*@}*/

