whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the RBDF field to a new value. */
#define QuadSPI_WR_FR_RBDF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_RBDF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_RBDF(value)))
#define QuadSPI_BWR_FR_RBDF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_RBDF_SHIFT), QuadSPI_FR_RBDF_SHIFT, QuadSPI_FR_RBDF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field RBOF[17] (W1C)
 *
 * RX Buffer Overflow Flag: Set when not all the data read from the serial flash
 * device could be pushed into the RX Buffer. The IP Command leading to this
 * condition is continued until the number of bytes according to the
 * QSPI_IPCR[IDATSZ] field has been read from the serial flash device. The content of the RX
 * Buffer is not changed.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_RBOF field. */
#define QuadSPI_RD_FR_RBOF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_RBOF_MASK) >> QuadSPI_FR_RBOF_SHIFT)
#define QuadSPI_BRD_FR_RBOF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_RBOF_SHIFT, QuadSPI_FR_RBOF_WIDTH))

/*! @brief Set the RBOF field to a new value. */
#define QuadSPI_WR_FR_RBOF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_RBOF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_RBOF(value)))
#define QuadSPI_BWR_FR_RBOF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_RBOF_SHIFT), QuadSPI_FR_RBOF_SHIFT, QuadSPI_FR_RBOF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field ILLINE[23] (W1C)
 *
 * Illegal Instruction Error Flag: Set when an illegal instruction is
 * encountered by the controller in any of the sequences. Refer to for a list of legal
 * instructions.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_ILLINE field. */
#define QuadSPI_RD_FR_ILLINE(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_ILLINE_MASK) >> QuadSPI_FR_ILLINE_SHIFT)
#define QuadSPI_BRD_FR_ILLINE(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_ILLINE_SHIFT, QuadSPI_FR_ILLINE_WIDTH))

/*! @brief Set the ILLINE field to a new value. */
#define QuadSPI_WR_FR_ILLINE(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_ILLINE(value)))
#define QuadSPI_BWR_FR_ILLINE(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_ILLINE_SHIFT), QuadSPI_FR_ILLINE_SHIFT, QuadSPI_FR_ILLINE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field TBUF[26] (W1C)
 *
 * TX Buffer Underrun Flag: Set when the module tried to pull data although TX
 * Buffer was emptyor the buffer contains less than 128bits of data. The
 * application must ensure that the buffer never goes empty during a transaction expect
 * for the last data fetch. The IP Command leading to the TX Buffer underrun is
 * continued (data sent to the serial flash device is all F in case of valid tx
 * underrun. The application must clear the TX Buffer in response to this event by
 * writing a 1 into the QSPI_MCR[CLR_TXF] bit.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_TBUF field. */
#define QuadSPI_RD_FR_TBUF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_TBUF_MASK) >> QuadSPI_FR_TBUF_SHIFT)
#define QuadSPI_BRD_FR_TBUF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_TBUF_SHIFT, QuadSPI_FR_TBUF_WIDTH))

/*! @brief Set the TBUF field to a new value. */
#define QuadSPI_WR_FR_TBUF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_TBUF(value)))
#define QuadSPI_BWR_FR_TBUF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_TBUF_SHIFT), QuadSPI_FR_TBUF_SHIFT, QuadSPI_FR_TBUF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field TBFF[27] (W1C)
 *
 * TX Buffer Fill Flag: Before writing to the TX buffer, this bit should be
 * cleared. Then this bit has to be read back. If the bit is set, the TX Buffer can
 * take more data. If the bit remains cleared, the TX buffer is full. Refer to Tx
 * Buffer Operation for details.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_TBFF field. */
#define QuadSPI_RD_FR_TBFF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_TBFF_MASK) >> QuadSPI_FR_TBFF_SHIFT)
#define QuadSPI_BRD_FR_TBFF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_TBFF_SHIFT, QuadSPI_FR_TBFF_WIDTH))

/*! @brief Set the TBFF field to a new value. */
#define QuadSPI_WR_FR_TBFF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_TBFF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_TBFF(value)))
#define QuadSPI_BWR_FR_TBFF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_TBFF_SHIFT), QuadSPI_FR_TBFF_SHIFT, QuadSPI_FR_TBFF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field DLPFF[31] (W1C)
 *
 * Data Learning Pattern Failure Flag: Set when DATA_LEARN instruction was
 * encountered in a sequence but no sampling point was found for the data learning
 * patternin case only 8 bit data learning is requested for non DQS mode. The
 * controller automatically starts sampling using the value in QSPI_SMPR[DDRSMP]. If
 * more than 8 bits data learning are requested with QSPI_MCR[DQS_EN] set to 0, and
 * the sampling point found after first 8 bit match doesn't remain same for the
 * whole instruction duration, this flag is set. In case of Data learn with DQS
 * this flag is set whenever the incoming data from flash on DQS edges doesn't
 * match the pattern in QSPI_DLPR. For details, refer to Data Learning.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_DLPFF field. */
#define QuadSPI_RD_FR_DLPFF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_DLPFF_MASK) >> QuadSPI_FR_DLPFF_SHIFT)
#define QuadSPI_BRD_FR_DLPFF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_DLPFF_SHIFT, QuadSPI_FR_DLPFF_WIDTH))

/*! @brief Set the DLPFF field to a new value. */
#define QuadSPI_WR_FR_DLPFF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_DLPFF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK), QuadSPI_FR_DLPFF(value)))
#define QuadSPI_BWR_FR_DLPFF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_DLPFF_SHIFT), QuadSPI_FR_DLPFF_SHIFT, QuadSPI_FR_DLPFF_WIDTH))
/*@}*/

