whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * QuadSPI_RSER - Interrupt and DMA Request Select and Enable Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_RSER - Interrupt and DMA Request Select and Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The QuadSPI_RSER register provides enables and selectors for the interrupts
 * in the QuadSPI module. Each flag of the QuadSPI_FR register enabled as source
 * for an interrupt prevents the QuadSPI module from entering Stop Mode or Module
 * Disable Mode when this flag is set. Write: Anytime
 */
/*!
 * @name Constants and macros for entire QuadSPI_RSER register
 */
/*@{*/
#define QuadSPI_RD_RSER(base)    (QuadSPI_RSER_REG(base))
#define QuadSPI_WR_RSER(base, value) (QuadSPI_RSER_REG(base) = (value))
#define QuadSPI_RMW_RSER(base, mask, value) (QuadSPI_WR_RSER(base, (QuadSPI_RD_RSER(base) & ~(mask)) | (value)))
#define QuadSPI_SET_RSER(base, value) (BME_OR32(&QuadSPI_RSER_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_RSER(base, value) (BME_AND32(&QuadSPI_RSER_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_RSER(base, value) (BME_XOR32(&QuadSPI_RSER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_RSER bitfields
 */

/*!
 * @name Register QuadSPI_RSER, field TFIE[0] (RW)
 *
 * Transaction Finished Interrupt Enable
 *
 * Values:
 * - 0b0 - No TFF interrupt will be generated
 * - 0b1 - TFF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_TFIE field. */
#define QuadSPI_RD_RSER_TFIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_TFIE_MASK) >> QuadSPI_RSER_TFIE_SHIFT)
#define QuadSPI_BRD_RSER_TFIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_TFIE_SHIFT, QuadSPI_RSER_TFIE_WIDTH))

/*! @brief Set the TFIE field to a new value. */
#define QuadSPI_WR_RSER_TFIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_TFIE_MASK, QuadSPI_RSER_TFIE(value)))
#define QuadSPI_BWR_RSER_TFIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_TFIE_SHIFT), QuadSPI_RSER_TFIE_SHIFT, QuadSPI_RSER_TFIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field IPGEIE[4] (RW)
 *
 * IP Command Trigger during AHB Grant Error Interrupt Enable
 *
 * Values:
 * - 0b0 - No IPGEF interrupt will be generated
 * - 0b1 - IPGEF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_IPGEIE field. */
#define QuadSPI_RD_RSER_IPGEIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_IPGEIE_MASK) >> QuadSPI_RSER_IPGEIE_SHIFT)
#define QuadSPI_BRD_RSER_IPGEIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_IPGEIE_SHIFT, QuadSPI_RSER_IPGEIE_WIDTH))

/*! @brief Set the IPGEIE field to a new value. */
#define QuadSPI_WR_RSER_IPGEIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_IPGEIE_MASK, QuadSPI_RSER_IPGEIE(value)))
#define QuadSPI_BWR_RSER_IPGEIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_IPGEIE_SHIFT), QuadSPI_RSER_IPGEIE_SHIFT, QuadSPI_RSER_IPGEIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field IPIEIE[6] (RW)
 *
 * IP Command Trigger during IP Access Error Interrupt Enable
 *
 * Values:
 * - 0b0 - No IPIEF interrupt will be generated
 * - 0b1 - IPIEF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_IPIEIE field. */
#define QuadSPI_RD_RSER_IPIEIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_IPIEIE_MASK) >> QuadSPI_RSER_IPIEIE_SHIFT)
#define QuadSPI_BRD_RSER_IPIEIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_IPIEIE_SHIFT, QuadSPI_RSER_IPIEIE_WIDTH))

/*! @brief Set the IPIEIE field to a new value. */
#define QuadSPI_WR_RSER_IPIEIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_IPIEIE_MASK, QuadSPI_RSER_IPIEIE(value)))
#define QuadSPI_BWR_RSER_IPIEIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_IPIEIE_SHIFT), QuadSPI_RSER_IPIEIE_SHIFT, QuadSPI_RSER_IPIEIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field IPAEIE[7] (RW)
 *
 * IP Command Trigger during AHB Access Error Interrupt Enable
 *
 * Values:
 * - 0b0 - No IPAEF interrupt will be generated
 * - 0b1 - IPAEF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_IPAEIE field. */
#define QuadSPI_RD_RSER_IPAEIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_IPAEIE_MASK) >> QuadSPI_RSER_IPAEIE_SHIFT)
#define QuadSPI_BRD_RSER_IPAEIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_IPAEIE_SHIFT, QuadSPI_RSER_IPAEIE_WIDTH))

/*! @brief Set the IPAEIE field to a new value. */
#define QuadSPI_WR_RSER_IPAEIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_IPAEIE_MASK, QuadSPI_RSER_IPAEIE(value)))
#define QuadSPI_BWR_RSER_IPAEIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_IPAEIE_SHIFT), QuadSPI_RSER_IPAEIE_SHIFT, QuadSPI_RSER_IPAEIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field IUEIE[11] (RW)
 *
 * IP Command Usage Error Interrupt Enable
 *
 * Values:
 * - 0b0 - No IUEF interrupt will be generated
 * - 0b1 - IUEF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_IUEIE field. */
#define QuadSPI_RD_RSER_IUEIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_IUEIE_MASK) >> QuadSPI_RSER_IUEIE_SHIFT)
#define QuadSPI_BRD_RSER_IUEIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_IUEIE_SHIFT, QuadSPI_RSER_IUEIE_WIDTH))

/*! @brief Set the IUEIE field to a new value. */
#define QuadSPI_WR_RSER_IUEIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_IUEIE_MASK, QuadSPI_RSER_IUEIE(value)))
#define QuadSPI_BWR_RSER_IUEIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_IUEIE_SHIFT), QuadSPI_RSER_IUEIE_SHIFT, QuadSPI_RSER_IUEIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field ABOIE[12] (RW)
 *
 * AHB Buffer Overflow Interrupt Enable
 *
 * Values:
 * - 0b0 - No ABOF interrupt will be generated
 * - 0b1 - ABOF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_ABOIE field. */
#define QuadSPI_RD_RSER_ABOIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_ABOIE_MASK) >> QuadSPI_RSER_ABOIE_SHIFT)
#define QuadSPI_BRD_RSER_ABOIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_ABOIE_SHIFT, QuadSPI_RSER_ABOIE_WIDTH))

/*! @brief Set the ABOIE field to a new value. */
#define QuadSPI_WR_RSER_ABOIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_ABOIE_MASK, QuadSPI_RSER_ABOIE(value)))
#define QuadSPI_BWR_RSER_ABOIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_ABOIE_SHIFT), QuadSPI_RSER_ABOIE_SHIFT, QuadSPI_RSER_ABOIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field AIBSIE[13] (RW)
 *
 * AHB Illegal Burst Size Interrupt Enable
 *
 * Values:
 * - 0b0 - No AIBSEF interrupt will be generated
 * - 0b1 - AIBSEF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_AIBSIE field. */
#define QuadSPI_RD_RSER_AIBSIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_AIBSIE_MASK) >> QuadSPI_RSER_AIBSIE_SHIFT)
#define QuadSPI_BRD_RSER_AIBSIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_AIBSIE_SHIFT, QuadSPI_RSER_AIBSIE_WIDTH))

/*! @brief Set the AIBSIE field to a new value. */
#define QuadSPI_WR_RSER_AIBSIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_AIBSIE_MASK, QuadSPI_RSER_AIBSIE(value)))
#define QuadSPI_BWR_RSER_AIBSIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_AIBSIE_SHIFT), QuadSPI_RSER_AIBSIE_SHIFT, QuadSPI_RSER_AIBSIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field AITIE[14] (RW)
 *
 * AHB Illegal transaction interrupt enable.
 *
 * Values:
 * - 0b0 - No AITEF interrupt will be generated
 * - 0b1 - AITEF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_AITIE field. */
#define QuadSPI_RD_RSER_AITIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_AITIE_MASK) >> QuadSPI_RSER_AITIE_SHIFT)
#define QuadSPI_BRD_RSER_AITIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_AITIE_SHIFT, QuadSPI_RSER_AITIE_WIDTH))

/*! @brief Set the AITIE field to a new value. */
#define QuadSPI_WR_RSER_AITIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_AITIE_MASK, QuadSPI_RSER_AITIE(value)))
#define QuadSPI_BWR_RSER_AITIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_AITIE_SHIFT), QuadSPI_RSER_AITIE_SHIFT, QuadSPI_RSER_AITIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field ABSEIE[15] (RW)
 *
 * AHB Sequence Error Interrupt Enable: Triggered by ABSEF flags of QSPI_FR
 *
 * Values:
 * - 0b0 - No ABSEF interrupt will be generated
 * - 0b1 - ABSEF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_ABSEIE field. */
#define QuadSPI_RD_RSER_ABSEIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_ABSEIE_MASK) >> QuadSPI_RSER_ABSEIE_SHIFT)
#define QuadSPI_BRD_RSER_ABSEIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_ABSEIE_SHIFT, QuadSPI_RSER_ABSEIE_WIDTH))

/*! @brief Set the ABSEIE field to a new value. */
#define QuadSPI_WR_RSER_ABSEIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_ABSEIE_MASK, QuadSPI_RSER_ABSEIE(value)))
#define QuadSPI_BWR_RSER_ABSEIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_ABSEIE_SHIFT), QuadSPI_RSER_ABSEIE_SHIFT, QuadSPI_RSER_ABSEIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field RBDIE[16] (RW)
 *
 * RX Buffer Drain Interrupt Enable: Enables generation of IRQ requests for RX
 * Buffer Drain. When this bit is set the interrupt is asserted as long as the
 * QuadSPI_SR[RBDF] flag is set.
 *
 * Values:
 * - 0b0 - No RBDF interrupt will be generated
 * - 0b1 - RBDF Interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_RBDIE field. */
#define QuadSPI_RD_RSER_RBDIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_RBDIE_MASK) >> QuadSPI_RSER_RBDIE_SHIFT)
#define QuadSPI_BRD_RSER_RBDIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_RBDIE_SHIFT, QuadSPI_RSER_RBDIE_WIDTH))

/*! @brief Set the RBDIE field to a new value. */
#define QuadSPI_WR_RSER_RBDIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_RBDIE_MASK, QuadSPI_RSER_RBDIE(value)))
#define QuadSPI_BWR_RSER_RBDIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_RBDIE_SHIFT), QuadSPI_RSER_RBDIE_SHIFT, QuadSPI_RSER_RBDIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field RBOIE[17] (RW)
 *
 * RX Buffer Overflow Interrupt Enable
 *
 * Values:
 * - 0b0 - No RBOF interrupt will be generated
 * - 0b1 - RBOF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_RBOIE field. */
#define QuadSPI_RD_RSER_RBOIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_RBOIE_MASK) >> QuadSPI_RSER_RBOIE_SHIFT)
#define QuadSPI_BRD_RSER_RBOIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_RBOIE_SHIFT, QuadSPI_RSER_RBOIE_WIDTH))

