whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the RBOIE field to a new value. */
#define QuadSPI_WR_RSER_RBOIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_RBOIE_MASK, QuadSPI_RSER_RBOIE(value)))
#define QuadSPI_BWR_RSER_RBOIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_RBOIE_SHIFT), QuadSPI_RSER_RBOIE_SHIFT, QuadSPI_RSER_RBOIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field RBDDE[21] (RW)
 *
 * RX Buffer Drain DMA Enable: Enables generation of DMA requests for RX Buffer
 * Drain. When this bit is set DMA requests are generated as long as the
 * QSPI_SR[RXWE] status bit is set.
 *
 * Values:
 * - 0b0 - No DMA request will be generated
 * - 0b1 - DMA request will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_RBDDE field. */
#define QuadSPI_RD_RSER_RBDDE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_RBDDE_MASK) >> QuadSPI_RSER_RBDDE_SHIFT)
#define QuadSPI_BRD_RSER_RBDDE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_RBDDE_SHIFT, QuadSPI_RSER_RBDDE_WIDTH))

/*! @brief Set the RBDDE field to a new value. */
#define QuadSPI_WR_RSER_RBDDE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_RBDDE_MASK, QuadSPI_RSER_RBDDE(value)))
#define QuadSPI_BWR_RSER_RBDDE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_RBDDE_SHIFT), QuadSPI_RSER_RBDDE_SHIFT, QuadSPI_RSER_RBDDE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field ILLINIE[23] (RW)
 *
 * Illegal Instruction Error Interrupt Enable. Triggered by ILLINE flag in
 * QSPI_FR
 *
 * Values:
 * - 0b0 - No ILLINE interrupt will be generated
 * - 0b1 - ILLINE interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_ILLINIE field. */
#define QuadSPI_RD_RSER_ILLINIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_ILLINIE_MASK) >> QuadSPI_RSER_ILLINIE_SHIFT)
#define QuadSPI_BRD_RSER_ILLINIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_ILLINIE_SHIFT, QuadSPI_RSER_ILLINIE_WIDTH))

/*! @brief Set the ILLINIE field to a new value. */
#define QuadSPI_WR_RSER_ILLINIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_ILLINIE_MASK, QuadSPI_RSER_ILLINIE(value)))
#define QuadSPI_BWR_RSER_ILLINIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_ILLINIE_SHIFT), QuadSPI_RSER_ILLINIE_SHIFT, QuadSPI_RSER_ILLINIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field TBFDE[25] (RW)
 *
 * Enables generation of DMA requests for TX Buffer fill. When this is set DMA
 * requests are generated as long as the QSPI_SR[TXWA] status bit is set.
 *
 * Values:
 * - 0b0 - No DMA request will be generated
 * - 0b1 - DMA request will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_TBFDE field. */
#define QuadSPI_RD_RSER_TBFDE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_TBFDE_MASK) >> QuadSPI_RSER_TBFDE_SHIFT)
#define QuadSPI_BRD_RSER_TBFDE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_TBFDE_SHIFT, QuadSPI_RSER_TBFDE_WIDTH))

/*! @brief Set the TBFDE field to a new value. */
#define QuadSPI_WR_RSER_TBFDE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_TBFDE_MASK, QuadSPI_RSER_TBFDE(value)))
#define QuadSPI_BWR_RSER_TBFDE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_TBFDE_SHIFT), QuadSPI_RSER_TBFDE_SHIFT, QuadSPI_RSER_TBFDE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field TBUIE[26] (RW)
 *
 * TX Buffer Underrun Interrupt Enable
 *
 * Values:
 * - 0b0 - No TBUF interrupt will be generated
 * - 0b1 - TBUF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_TBUIE field. */
#define QuadSPI_RD_RSER_TBUIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_TBUIE_MASK) >> QuadSPI_RSER_TBUIE_SHIFT)
#define QuadSPI_BRD_RSER_TBUIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_TBUIE_SHIFT, QuadSPI_RSER_TBUIE_WIDTH))

/*! @brief Set the TBUIE field to a new value. */
#define QuadSPI_WR_RSER_TBUIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_TBUIE_MASK, QuadSPI_RSER_TBUIE(value)))
#define QuadSPI_BWR_RSER_TBUIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_TBUIE_SHIFT), QuadSPI_RSER_TBUIE_SHIFT, QuadSPI_RSER_TBUIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field TBFIE[27] (RW)
 *
 * TX Buffer Fill Interrupt Enable
 *
 * Values:
 * - 0b0 - No TBFF interrupt will be generated
 * - 0b1 - TBFF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_TBFIE field. */
#define QuadSPI_RD_RSER_TBFIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_TBFIE_MASK) >> QuadSPI_RSER_TBFIE_SHIFT)
#define QuadSPI_BRD_RSER_TBFIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_TBFIE_SHIFT, QuadSPI_RSER_TBFIE_WIDTH))

/*! @brief Set the TBFIE field to a new value. */
#define QuadSPI_WR_RSER_TBFIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_TBFIE_MASK, QuadSPI_RSER_TBFIE(value)))
#define QuadSPI_BWR_RSER_TBFIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_TBFIE_SHIFT), QuadSPI_RSER_TBFIE_SHIFT, QuadSPI_RSER_TBFIE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_RSER, field DLPFIE[31] (RW)
 *
 * Data Learning Pattern Failure Interrupt enable . Triggered by DLPFF flag in
 * QSPI_FR register
 *
 * Values:
 * - 0b0 - No DLPFF interrupt will be generated
 * - 0b1 - DLPFF interrupt will be generated
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_RSER_DLPFIE field. */
#define QuadSPI_RD_RSER_DLPFIE(base) ((QuadSPI_RSER_REG(base) & QuadSPI_RSER_DLPFIE_MASK) >> QuadSPI_RSER_DLPFIE_SHIFT)
#define QuadSPI_BRD_RSER_DLPFIE(base) (BME_UBFX32(&QuadSPI_RSER_REG(base), QuadSPI_RSER_DLPFIE_SHIFT, QuadSPI_RSER_DLPFIE_WIDTH))

/*! @brief Set the DLPFIE field to a new value. */
#define QuadSPI_WR_RSER_DLPFIE(base, value) (QuadSPI_RMW_RSER(base, QuadSPI_RSER_DLPFIE_MASK, QuadSPI_RSER_DLPFIE(value)))
#define QuadSPI_BWR_RSER_DLPFIE(base, value) (BME_BFI32(&QuadSPI_RSER_REG(base), ((uint32_t)(value) << QuadSPI_RSER_DLPFIE_SHIFT), QuadSPI_RSER_DLPFIE_SHIFT, QuadSPI_RSER_DLPFIE_WIDTH))
/*@}*/

