whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * QuadSPI_SPNDST - Sequence Suspend Status Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_SPNDST - Sequence Suspend Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The sequence suspend status register provides information specific to any
 * suspended sequence. An AHB sequence may be suspended when a high priority AHB
 * master makes an access before the AHB sequence completes the data transfer
 * requested.
 */
/*!
 * @name Constants and macros for entire QuadSPI_SPNDST register
 */
/*@{*/
#define QuadSPI_RD_SPNDST(base)  (QuadSPI_SPNDST_REG(base))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SPNDST bitfields
 */

/*!
 * @name Register QuadSPI_SPNDST, field SUSPND[0] (RO)
 *
 * When set, it signifies that a sequence is in suspended state
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SPNDST_SUSPND field. */
#define QuadSPI_RD_SPNDST_SUSPND(base) ((QuadSPI_SPNDST_REG(base) & QuadSPI_SPNDST_SUSPND_MASK) >> QuadSPI_SPNDST_SUSPND_SHIFT)
#define QuadSPI_BRD_SPNDST_SUSPND(base) (BME_UBFX32(&QuadSPI_SPNDST_REG(base), QuadSPI_SPNDST_SUSPND_SHIFT, QuadSPI_SPNDST_SUSPND_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SPNDST, field SPDBUF[7:6] (RO)
 *
 * Suspended Buffer: Provides the suspended buffer number. Valid only when
 * SUSPND is set to 1'b1
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SPNDST_SPDBUF field. */
#define QuadSPI_RD_SPNDST_SPDBUF(base) ((QuadSPI_SPNDST_REG(base) & QuadSPI_SPNDST_SPDBUF_MASK) >> QuadSPI_SPNDST_SPDBUF_SHIFT)
#define QuadSPI_BRD_SPNDST_SPDBUF(base) (BME_UBFX32(&QuadSPI_SPNDST_REG(base), QuadSPI_SPNDST_SPDBUF_SHIFT, QuadSPI_SPNDST_SPDBUF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SPNDST, field DATLFT[14:9] (RO)
 *
 * Data left: Provides information about the amount of data left to be read in
 * the suspended sequence. Valid only when SUSPND is set to 1'b1. Value in terms
 * of 64 bits or 8 bytes
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SPNDST_DATLFT field. */
#define QuadSPI_RD_SPNDST_DATLFT(base) ((QuadSPI_SPNDST_REG(base) & QuadSPI_SPNDST_DATLFT_MASK) >> QuadSPI_SPNDST_DATLFT_SHIFT)
#define QuadSPI_BRD_SPNDST_DATLFT(base) (BME_UBFX32(&QuadSPI_SPNDST_REG(base), QuadSPI_SPNDST_DATLFT_SHIFT, QuadSPI_SPNDST_DATLFT_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_SPTRCLR - Sequence Pointer Clear Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_SPTRCLR - Sequence Pointer Clear Register (WO)
 *
 * Reset value: 0x00000000U
 *
 * The sequence pointer clear register provides bits to reset the IP and Buffer
 * sequence pointers. The sequence pointer contains the index of which
 * instruction within the LUT entry is to be executed next. For example, if the LUT entry
 * ends on a JMP_ON_CS value of 2, the index will be stored as 2. The software
 * should reset the sequence pointers whenever the sequence ID is changed by
 * updating the SEQID field in QSPI_IPCR or QSPI_BFGENCR.
 */
/*!
 * @name Constants and macros for entire QuadSPI_SPTRCLR register
 */
/*@{*/
#define QuadSPI_RD_SPTRCLR(base) (QuadSPI_SPTRCLR_REG(base))
#define QuadSPI_WR_SPTRCLR(base, value) (QuadSPI_SPTRCLR_REG(base) = (value))
#define QuadSPI_RMW_SPTRCLR(base, mask, value) (QuadSPI_WR_SPTRCLR(base, (QuadSPI_RD_SPTRCLR(base) & ~(mask)) | (value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SPTRCLR bitfields
 */

/*!
 * @name Register QuadSPI_SPTRCLR, field BFPTRC[0] (WORZ)
 *
 * Buffer Pointer Clear: 1: Clears the sequence pointer for AHB accesses as
 * defined in QuadSPI_BFGENCR. This is a self-clearing field.
 */
/*@{*/
/*! @brief Set the BFPTRC field to a new value. */
#define QuadSPI_WR_SPTRCLR_BFPTRC(base, value) (QuadSPI_RMW_SPTRCLR(base, QuadSPI_SPTRCLR_BFPTRC_MASK, QuadSPI_SPTRCLR_BFPTRC(value)))
#define QuadSPI_BWR_SPTRCLR_BFPTRC(base, value) (BME_BFI32(&QuadSPI_SPTRCLR_REG(base), ((uint32_t)(value) << QuadSPI_SPTRCLR_BFPTRC_SHIFT), QuadSPI_SPTRCLR_BFPTRC_SHIFT, QuadSPI_SPTRCLR_BFPTRC_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SPTRCLR, field IPPTRC[8] (WORZ)
 *
 * IP Pointer Clear: 1: Clears the sequence pointer for IP accesses as defined
 * in QuadSPI_IPCR This is a self-clearing field.
 */
/*@{*/
/*! @brief Set the IPPTRC field to a new value. */
#define QuadSPI_WR_SPTRCLR_IPPTRC(base, value) (QuadSPI_RMW_SPTRCLR(base, QuadSPI_SPTRCLR_IPPTRC_MASK, QuadSPI_SPTRCLR_IPPTRC(value)))
#define QuadSPI_BWR_SPTRCLR_IPPTRC(base, value) (BME_BFI32(&QuadSPI_SPTRCLR_REG(base), ((uint32_t)(value) << QuadSPI_SPTRCLR_IPPTRC_SHIFT), QuadSPI_SPTRCLR_IPPTRC_SHIFT, QuadSPI_SPTRCLR_IPPTRC_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_SFA1AD - Serial Flash A1 Top Address
 ******************************************************************************/

/*!
 * @brief QuadSPI_SFA1AD - Serial Flash A1 Top Address (RW)
 *
 * Reset value: 0x6FFFFC00U
 *
 * The QSPI_SFA1AD register provides the address mapping for the serial flash
 * A1.The difference between QSPI_SFA1AD[TPADA1] and QSPI_AMBA_BASE defines the
 * size of the memory map for serial flash A1. Write: QSPI_SR[IP_ACC] = 0
 * QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_SFA1AD register
 */
/*@{*/
#define QuadSPI_RD_SFA1AD(base)  (QuadSPI_SFA1AD_REG(base))
#define QuadSPI_WR_SFA1AD(base, value) (QuadSPI_SFA1AD_REG(base) = (value))
#define QuadSPI_RMW_SFA1AD(base, mask, value) (QuadSPI_WR_SFA1AD(base, (QuadSPI_RD_SFA1AD(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SFA1AD(base, value) (BME_OR32(&QuadSPI_SFA1AD_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SFA1AD(base, value) (BME_AND32(&QuadSPI_SFA1AD_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SFA1AD(base, value) (BME_XOR32(&QuadSPI_SFA1AD_REG(base), (uint32_t)(value)))
/*@}*/

