whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the IERR field to a new value. */
#define RTC_WR_RAR_IERR(base, value) (RTC_RMW_RAR(base, RTC_RAR_IERR_MASK, RTC_RAR_IERR(value)))
#define RTC_BWR_RAR_IERR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_IERR_SHIFT), RTC_RAR_IERR_SHIFT, RTC_RAR_IERR_WIDTH))
/*@}*/

/*
 * MK82F25615 SDHC
 *
 * Secured Digital Host Controller
 *
 * Registers defined in this header file:
 * - SDHC_DSADDR - DMA System Address register
 * - SDHC_BLKATTR - Block Attributes register
 * - SDHC_CMDARG - Command Argument register
 * - SDHC_XFERTYP - Transfer Type register
 * - SDHC_CMDRSP - Command Response 0
 * - SDHC_DATPORT - Buffer Data Port register
 * - SDHC_PRSSTAT - Present State register
 * - SDHC_PROCTL - Protocol Control register
 * - SDHC_SYSCTL - System Control register
 * - SDHC_IRQSTAT - Interrupt Status register
 * - SDHC_IRQSTATEN - Interrupt Status Enable register
 * - SDHC_IRQSIGEN - Interrupt Signal Enable register
 * - SDHC_AC12ERR - Auto CMD12 Error Status Register
 * - SDHC_HTCAPBLT - Host Controller Capabilities
 * - SDHC_WML - Watermark Level Register
 * - SDHC_FEVT - Force Event register
 * - SDHC_ADMAES - ADMA Error Status register
 * - SDHC_ADSADDR - ADMA System Addressregister
 * - SDHC_VENDOR - Vendor Specific register
 * - SDHC_MMCBOOT - MMC Boot register
 * - SDHC_HOSTVER - Host Controller Version
 */

#define SDHC_INSTANCE_COUNT (1U) /*!< Number of instances of the SDHC module. */
#define SDHC_IDX (0U) /*!< Instance number for SDHC. */

/*******************************************************************************
 * SDHC_DSADDR - DMA System Address register
 ******************************************************************************/

/*!
 * @brief SDHC_DSADDR - DMA System Address register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains the physical system memory address used for DMA
 * transfers.
 */
/*!
 * @name Constants and macros for entire SDHC_DSADDR register
 */
/*@{*/
#define SDHC_RD_DSADDR(base)     (SDHC_DSADDR_REG(base))
#define SDHC_WR_DSADDR(base, value) (SDHC_DSADDR_REG(base) = (value))
#define SDHC_RMW_DSADDR(base, mask, value) (SDHC_WR_DSADDR(base, (SDHC_RD_DSADDR(base) & ~(mask)) | (value)))
#define SDHC_SET_DSADDR(base, value) (BME_OR32(&SDHC_DSADDR_REG(base), (uint32_t)(value)))
#define SDHC_CLR_DSADDR(base, value) (BME_AND32(&SDHC_DSADDR_REG(base), (uint32_t)(~(value))))
#define SDHC_TOG_DSADDR(base, value) (BME_XOR32(&SDHC_DSADDR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_DSADDR bitfields
 */

/*!
 * @name Register SDHC_DSADDR, field DSADDR[31:2] (RW)
 *
 * Contains the 32-bit system memory address for a DMA transfer. Because the
 * address must be word (4 bytes) align, the least 2 bits are reserved, always 0.
 * When the SDHC stops a DMA transfer, this register points to the system address
 * of the next contiguous data position. It can be accessed only when no
 * transaction is executing, that is, after a transaction has stopped. Read operation
 * during transfers may return an invalid value. The host driver shall initialize
 * this register before starting a DMA transaction. After DMA has stopped, the
 * system address of the next contiguous data position can be read from this register.
 * This register is protected during a data transfer. When data lines are
 * active, write to this register is ignored. The host driver shall wait, until
 * PRSSTAT[DLA] is cleared, before writing to this register. The SDHC internal DMA does
 * not support a virtual memory system. It supports only continuous physical
 * memory access. And due to AHB burst limitations, if the burst must cross the 1 KB
 * boundary, SDHC will automatically change SEQ burst type to NSEQ. Because this
 * register supports dynamic address reflecting, when IRQSTAT[TC] bit is set, it
 * automatically alters the value of internal address counter, so SW cannot
 * change this register when IRQSTAT[TC] is set.
 */
/*@{*/
/*! @brief Read current value of the SDHC_DSADDR_DSADDR field. */
#define SDHC_RD_DSADDR_DSADDR(base) ((SDHC_DSADDR_REG(base) & SDHC_DSADDR_DSADDR_MASK) >> SDHC_DSADDR_DSADDR_SHIFT)
#define SDHC_BRD_DSADDR_DSADDR(base) (SDHC_RD_DSADDR_DSADDR(base))

/*! @brief Set the DSADDR field to a new value. */
#define SDHC_WR_DSADDR_DSADDR(base, value) (SDHC_RMW_DSADDR(base, SDHC_DSADDR_DSADDR_MASK, SDHC_DSADDR_DSADDR(value)))
#define SDHC_BWR_DSADDR_DSADDR(base, value) (SDHC_WR_DSADDR_DSADDR(base, value))
/*@}*/

/*******************************************************************************
 * SDHC_BLKATTR - Block Attributes register
 ******************************************************************************/

/*!
 * @brief SDHC_BLKATTR - Block Attributes register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is used to configure the number of data blocks and the number
 * of bytes in each block.
 */
/*!
 * @name Constants and macros for entire SDHC_BLKATTR register
 */
/*@{*/
#define SDHC_RD_BLKATTR(base)    (SDHC_BLKATTR_REG(base))
#define SDHC_WR_BLKATTR(base, value) (SDHC_BLKATTR_REG(base) = (value))
#define SDHC_RMW_BLKATTR(base, mask, value) (SDHC_WR_BLKATTR(base, (SDHC_RD_BLKATTR(base) & ~(mask)) | (value)))
#define SDHC_SET_BLKATTR(base, value) (BME_OR32(&SDHC_BLKATTR_REG(base), (uint32_t)(value)))
#define SDHC_CLR_BLKATTR(base, value) (BME_AND32(&SDHC_BLKATTR_REG(base), (uint32_t)(~(value))))
#define SDHC_TOG_BLKATTR(base, value) (BME_XOR32(&SDHC_BLKATTR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_BLKATTR bitfields
 */

/*!
 * @name Register SDHC_BLKATTR, field BLKSIZE[12:0] (RW)
 *
 * Specifies the block size for block data transfers. Values ranging from 1 byte
 * up to the maximum buffer size can be set. It can be accessed only when no
 * transaction is executing, that is, after a transaction has stopped. Read
 * operations during transfers may return an invalid value, and write operations will be
 * ignored.
 *
 * Values:
 * - 0b0000000000000 - No data transfer.
 * - 0b0000000000001 - 1 Byte
 * - 0b0000000000010 - 2 Bytes
 * - 0b0000000000011 - 3 Bytes
 * - 0b0000000000100 - 4 Bytes
 * - 0b0000111111111 - 511 Bytes
 * - 0b0001000000000 - 512 Bytes
 * - 0b0100000000000 - 2048 Bytes
 * - 0b1000000000000 - 4096 Bytes
 */
/*@{*/
/*! @brief Read current value of the SDHC_BLKATTR_BLKSIZE field. */
#define SDHC_RD_BLKATTR_BLKSIZE(base) ((SDHC_BLKATTR_REG(base) & SDHC_BLKATTR_BLKSIZE_MASK) >> SDHC_BLKATTR_BLKSIZE_SHIFT)
#define SDHC_BRD_BLKATTR_BLKSIZE(base) (SDHC_RD_BLKATTR_BLKSIZE(base))

/*! @brief Set the BLKSIZE field to a new value. */
#define SDHC_WR_BLKATTR_BLKSIZE(base, value) (SDHC_RMW_BLKATTR(base, SDHC_BLKATTR_BLKSIZE_MASK, SDHC_BLKATTR_BLKSIZE(value)))
#define SDHC_BWR_BLKATTR_BLKSIZE(base, value) (SDHC_WR_BLKATTR_BLKSIZE(base, value))
/*@}*/

/*!
 * @name Register SDHC_BLKATTR, field BLKCNT[31:16] (RW)
 *
 * This register is enabled when XFERTYP[BCEN] is set to 1 and is valid only for
 * multiple block transfers. For single block transfer, this register will
 * always read as 1. The host driver shall set this register to a value between 1 and
 * the maximum block count. The SDHC decrements the block count after each block
 * transfer and stops when the count reaches zero. Setting the block count to 0
 * results in no data blocks being transferred. This register must be accessed
 * only when no transaction is executing, that is, after transactions are stopped.
 * During data transfer, read operations on this register may return an invalid
 * value and write operations are ignored. When saving transfer content as a result
 * of a suspend command, the number of blocks yet to be transferred can be
 * determined by reading this register. The reading of this register must be applied
 * after transfer is paused by stop at block gap operation and before sending the
 * command marked as suspend. This is because when suspend command is sent out,
 * SDHC will regard the current transfer as aborted and change BLKCNT back to its
 * original value instead of keeping the dynamical indicator of remained block
 * count. When restoring transfer content prior to issuing a resume command, the
 * host driver shall restore the previously saved block count. Although the BLKCNT
 * field is 0 after reset, the read of reset value is 0x1. This is because when
 * XFERTYP[MSBSEL] is 0, indicating a single block transfer, the read value of
 * BLKCNT is always 1.
 *
 * Values:
 * - 0b0000000000000000 - Stop count.
 * - 0b0000000000000001 - 1 block
 * - 0b0000000000000010 - 2 blocks
 * - 0b1111111111111111 - 65535 blocks
 */
/*@{*/
/*! @brief Read current value of the SDHC_BLKATTR_BLKCNT field. */
#define SDHC_RD_BLKATTR_BLKCNT(base) ((SDHC_BLKATTR_REG(base) & SDHC_BLKATTR_BLKCNT_MASK) >> SDHC_BLKATTR_BLKCNT_SHIFT)
#define SDHC_BRD_BLKATTR_BLKCNT(base) (SDHC_RD_BLKATTR_BLKCNT(base))

/*! @brief Set the BLKCNT field to a new value. */
#define SDHC_WR_BLKATTR_BLKCNT(base, value) (SDHC_RMW_BLKATTR(base, SDHC_BLKATTR_BLKCNT_MASK, SDHC_BLKATTR_BLKCNT(value)))
#define SDHC_BWR_BLKATTR_BLKCNT(base, value) (SDHC_WR_BLKATTR_BLKCNT(base, value))
/*@}*/

