whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the CIE field to a new value. */
#define SDHC_WR_IRQSTAT_CIE(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_CIE(value)))
#define SDHC_BWR_IRQSTAT_CIE(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_CIE_SHIFT), SDHC_IRQSTAT_CIE_SHIFT, SDHC_IRQSTAT_CIE_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field DTOE[20] (W1C)
 *
 * Occurs when detecting one of following time-out conditions. Busy time-out for
 * R1b,R5b type Busy time-out after Write CRC status Read Data time-out
 *
 * Values:
 * - 0b0 - No error.
 * - 0b1 - Time out.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_DTOE field. */
#define SDHC_RD_IRQSTAT_DTOE(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_DTOE_MASK) >> SDHC_IRQSTAT_DTOE_SHIFT)
#define SDHC_BRD_IRQSTAT_DTOE(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_DTOE_SHIFT, SDHC_IRQSTAT_DTOE_WIDTH))

/*! @brief Set the DTOE field to a new value. */
#define SDHC_WR_IRQSTAT_DTOE(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_DTOE(value)))
#define SDHC_BWR_IRQSTAT_DTOE(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_DTOE_SHIFT), SDHC_IRQSTAT_DTOE_SHIFT, SDHC_IRQSTAT_DTOE_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field DCE[21] (W1C)
 *
 * Occurs when detecting a CRC error when transferring read data, which uses the
 * DAT line, or when detecting the Write CRC status having a value other than
 * 010.
 *
 * Values:
 * - 0b0 - No error.
 * - 0b1 - Error.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_DCE field. */
#define SDHC_RD_IRQSTAT_DCE(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_DCE_MASK) >> SDHC_IRQSTAT_DCE_SHIFT)
#define SDHC_BRD_IRQSTAT_DCE(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_DCE_SHIFT, SDHC_IRQSTAT_DCE_WIDTH))

/*! @brief Set the DCE field to a new value. */
#define SDHC_WR_IRQSTAT_DCE(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_DCE(value)))
#define SDHC_BWR_IRQSTAT_DCE(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_DCE_SHIFT), SDHC_IRQSTAT_DCE_SHIFT, SDHC_IRQSTAT_DCE_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field DEBE[22] (W1C)
 *
 * Occurs either when detecting 0 at the end bit position of read data, which
 * uses the DAT line, or at the end bit position of the CRC.
 *
 * Values:
 * - 0b0 - No error.
 * - 0b1 - Error.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_DEBE field. */
#define SDHC_RD_IRQSTAT_DEBE(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_DEBE_MASK) >> SDHC_IRQSTAT_DEBE_SHIFT)
#define SDHC_BRD_IRQSTAT_DEBE(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_DEBE_SHIFT, SDHC_IRQSTAT_DEBE_WIDTH))

/*! @brief Set the DEBE field to a new value. */
#define SDHC_WR_IRQSTAT_DEBE(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_DEBE(value)))
#define SDHC_BWR_IRQSTAT_DEBE(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_DEBE_SHIFT), SDHC_IRQSTAT_DEBE_SHIFT, SDHC_IRQSTAT_DEBE_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field AC12E[24] (W1C)
 *
 * Occurs when detecting that one of the bits in the Auto CMD12 Error Status
 * register has changed from 0 to 1. This bit is set to 1, not only when the errors
 * in Auto CMD12 occur, but also when the Auto CMD12 is not executed due to the
 * previous command error.
 *
 * Values:
 * - 0b0 - No error.
 * - 0b1 - Error.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_AC12E field. */
#define SDHC_RD_IRQSTAT_AC12E(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_AC12E_MASK) >> SDHC_IRQSTAT_AC12E_SHIFT)
#define SDHC_BRD_IRQSTAT_AC12E(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_AC12E_SHIFT, SDHC_IRQSTAT_AC12E_WIDTH))

/*! @brief Set the AC12E field to a new value. */
#define SDHC_WR_IRQSTAT_AC12E(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_AC12E(value)))
#define SDHC_BWR_IRQSTAT_AC12E(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_AC12E_SHIFT), SDHC_IRQSTAT_AC12E_SHIFT, SDHC_IRQSTAT_AC12E_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field DMAE[28] (W1C)
 *
 * Occurs when an Internal DMA transfer has failed. This bit is set to 1, when
 * some error occurs in the data transfer. This error can be caused by either
 * Simple DMA or ADMA, depending on which DMA is in use. The value in DMA System
 * Address register is the next fetch address where the error occurs. Because any
 * error corrupts the whole data block, the host driver shall restart the transfer
 * from the corrupted block boundary. The address of the block boundary can be
 * calculated either from the current DSADDR value or from the remaining number of
 * blocks and the block size.
 *
 * Values:
 * - 0b0 - No error.
 * - 0b1 - Error.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_DMAE field. */
#define SDHC_RD_IRQSTAT_DMAE(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_DMAE_MASK) >> SDHC_IRQSTAT_DMAE_SHIFT)
#define SDHC_BRD_IRQSTAT_DMAE(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_DMAE_SHIFT, SDHC_IRQSTAT_DMAE_WIDTH))

/*! @brief Set the DMAE field to a new value. */
#define SDHC_WR_IRQSTAT_DMAE(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_DMAE_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK), SDHC_IRQSTAT_DMAE(value)))
#define SDHC_BWR_IRQSTAT_DMAE(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_DMAE_SHIFT), SDHC_IRQSTAT_DMAE_SHIFT, SDHC_IRQSTAT_DMAE_WIDTH))
/*@}*/

