whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * SDHC_IRQSIGEN - Interrupt Signal Enable register
 ******************************************************************************/

/*!
 * @brief SDHC_IRQSIGEN - Interrupt Signal Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is used to select which interrupt status is indicated to the
 * host system as the interrupt. All of these status bits share the same interrupt
 * line. Setting any of these bits to 1 enables interrupt generation. The
 * corresponding status register bit will generate an interrupt when the corresponding
 * interrupt signal enable bit is set.
 */
/*!
 * @name Constants and macros for entire SDHC_IRQSIGEN register
 */
/*@{*/
#define SDHC_RD_IRQSIGEN(base)   (SDHC_IRQSIGEN_REG(base))
#define SDHC_WR_IRQSIGEN(base, value) (SDHC_IRQSIGEN_REG(base) = (value))
#define SDHC_RMW_IRQSIGEN(base, mask, value) (SDHC_WR_IRQSIGEN(base, (SDHC_RD_IRQSIGEN(base) & ~(mask)) | (value)))
#define SDHC_SET_IRQSIGEN(base, value) (BME_OR32(&SDHC_IRQSIGEN_REG(base), (uint32_t)(value)))
#define SDHC_CLR_IRQSIGEN(base, value) (BME_AND32(&SDHC_IRQSIGEN_REG(base), (uint32_t)(~(value))))
#define SDHC_TOG_IRQSIGEN(base, value) (BME_XOR32(&SDHC_IRQSIGEN_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_IRQSIGEN bitfields
 */

/*!
 * @name Register SDHC_IRQSIGEN, field CCIEN[0] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CCIEN field. */
#define SDHC_RD_IRQSIGEN_CCIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CCIEN_MASK) >> SDHC_IRQSIGEN_CCIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CCIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CCIEN_SHIFT, SDHC_IRQSIGEN_CCIEN_WIDTH))

/*! @brief Set the CCIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CCIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CCIEN_MASK, SDHC_IRQSIGEN_CCIEN(value)))
#define SDHC_BWR_IRQSIGEN_CCIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CCIEN_SHIFT), SDHC_IRQSIGEN_CCIEN_SHIFT, SDHC_IRQSIGEN_CCIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field TCIEN[1] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_TCIEN field. */
#define SDHC_RD_IRQSIGEN_TCIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_TCIEN_MASK) >> SDHC_IRQSIGEN_TCIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_TCIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_TCIEN_SHIFT, SDHC_IRQSIGEN_TCIEN_WIDTH))

/*! @brief Set the TCIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_TCIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_TCIEN_MASK, SDHC_IRQSIGEN_TCIEN(value)))
#define SDHC_BWR_IRQSIGEN_TCIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_TCIEN_SHIFT), SDHC_IRQSIGEN_TCIEN_SHIFT, SDHC_IRQSIGEN_TCIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field BGEIEN[2] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_BGEIEN field. */
#define SDHC_RD_IRQSIGEN_BGEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_BGEIEN_MASK) >> SDHC_IRQSIGEN_BGEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_BGEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_BGEIEN_SHIFT, SDHC_IRQSIGEN_BGEIEN_WIDTH))

/*! @brief Set the BGEIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_BGEIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_BGEIEN_MASK, SDHC_IRQSIGEN_BGEIEN(value)))
#define SDHC_BWR_IRQSIGEN_BGEIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_BGEIEN_SHIFT), SDHC_IRQSIGEN_BGEIEN_SHIFT, SDHC_IRQSIGEN_BGEIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field DINTIEN[3] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_DINTIEN field. */
#define SDHC_RD_IRQSIGEN_DINTIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_DINTIEN_MASK) >> SDHC_IRQSIGEN_DINTIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_DINTIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_DINTIEN_SHIFT, SDHC_IRQSIGEN_DINTIEN_WIDTH))

/*! @brief Set the DINTIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_DINTIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_DINTIEN_MASK, SDHC_IRQSIGEN_DINTIEN(value)))
#define SDHC_BWR_IRQSIGEN_DINTIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_DINTIEN_SHIFT), SDHC_IRQSIGEN_DINTIEN_SHIFT, SDHC_IRQSIGEN_DINTIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field BWRIEN[4] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_BWRIEN field. */
#define SDHC_RD_IRQSIGEN_BWRIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_BWRIEN_MASK) >> SDHC_IRQSIGEN_BWRIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_BWRIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_BWRIEN_SHIFT, SDHC_IRQSIGEN_BWRIEN_WIDTH))

/*! @brief Set the BWRIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_BWRIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_BWRIEN_MASK, SDHC_IRQSIGEN_BWRIEN(value)))
#define SDHC_BWR_IRQSIGEN_BWRIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_BWRIEN_SHIFT), SDHC_IRQSIGEN_BWRIEN_SHIFT, SDHC_IRQSIGEN_BWRIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field BRRIEN[5] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_BRRIEN field. */
#define SDHC_RD_IRQSIGEN_BRRIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_BRRIEN_MASK) >> SDHC_IRQSIGEN_BRRIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_BRRIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_BRRIEN_SHIFT, SDHC_IRQSIGEN_BRRIEN_WIDTH))

/*! @brief Set the BRRIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_BRRIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_BRRIEN_MASK, SDHC_IRQSIGEN_BRRIEN(value)))
#define SDHC_BWR_IRQSIGEN_BRRIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_BRRIEN_SHIFT), SDHC_IRQSIGEN_BRRIEN_SHIFT, SDHC_IRQSIGEN_BRRIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field CINSIEN[6] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CINSIEN field. */
#define SDHC_RD_IRQSIGEN_CINSIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CINSIEN_MASK) >> SDHC_IRQSIGEN_CINSIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CINSIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CINSIEN_SHIFT, SDHC_IRQSIGEN_CINSIEN_WIDTH))

