whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the CINSIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CINSIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CINSIEN_MASK, SDHC_IRQSIGEN_CINSIEN(value)))
#define SDHC_BWR_IRQSIGEN_CINSIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CINSIEN_SHIFT), SDHC_IRQSIGEN_CINSIEN_SHIFT, SDHC_IRQSIGEN_CINSIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field CRMIEN[7] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CRMIEN field. */
#define SDHC_RD_IRQSIGEN_CRMIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CRMIEN_MASK) >> SDHC_IRQSIGEN_CRMIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CRMIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CRMIEN_SHIFT, SDHC_IRQSIGEN_CRMIEN_WIDTH))

/*! @brief Set the CRMIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CRMIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CRMIEN_MASK, SDHC_IRQSIGEN_CRMIEN(value)))
#define SDHC_BWR_IRQSIGEN_CRMIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CRMIEN_SHIFT), SDHC_IRQSIGEN_CRMIEN_SHIFT, SDHC_IRQSIGEN_CRMIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field CINTIEN[8] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CINTIEN field. */
#define SDHC_RD_IRQSIGEN_CINTIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CINTIEN_MASK) >> SDHC_IRQSIGEN_CINTIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CINTIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CINTIEN_SHIFT, SDHC_IRQSIGEN_CINTIEN_WIDTH))

/*! @brief Set the CINTIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CINTIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CINTIEN_MASK, SDHC_IRQSIGEN_CINTIEN(value)))
#define SDHC_BWR_IRQSIGEN_CINTIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CINTIEN_SHIFT), SDHC_IRQSIGEN_CINTIEN_SHIFT, SDHC_IRQSIGEN_CINTIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field CTOEIEN[16] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CTOEIEN field. */
#define SDHC_RD_IRQSIGEN_CTOEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CTOEIEN_MASK) >> SDHC_IRQSIGEN_CTOEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CTOEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CTOEIEN_SHIFT, SDHC_IRQSIGEN_CTOEIEN_WIDTH))

/*! @brief Set the CTOEIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CTOEIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CTOEIEN_MASK, SDHC_IRQSIGEN_CTOEIEN(value)))
#define SDHC_BWR_IRQSIGEN_CTOEIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CTOEIEN_SHIFT), SDHC_IRQSIGEN_CTOEIEN_SHIFT, SDHC_IRQSIGEN_CTOEIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field CCEIEN[17] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CCEIEN field. */
#define SDHC_RD_IRQSIGEN_CCEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CCEIEN_MASK) >> SDHC_IRQSIGEN_CCEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CCEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CCEIEN_SHIFT, SDHC_IRQSIGEN_CCEIEN_WIDTH))

/*! @brief Set the CCEIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CCEIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CCEIEN_MASK, SDHC_IRQSIGEN_CCEIEN(value)))
#define SDHC_BWR_IRQSIGEN_CCEIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CCEIEN_SHIFT), SDHC_IRQSIGEN_CCEIEN_SHIFT, SDHC_IRQSIGEN_CCEIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field CEBEIEN[18] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CEBEIEN field. */
#define SDHC_RD_IRQSIGEN_CEBEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CEBEIEN_MASK) >> SDHC_IRQSIGEN_CEBEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CEBEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CEBEIEN_SHIFT, SDHC_IRQSIGEN_CEBEIEN_WIDTH))

/*! @brief Set the CEBEIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CEBEIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CEBEIEN_MASK, SDHC_IRQSIGEN_CEBEIEN(value)))
#define SDHC_BWR_IRQSIGEN_CEBEIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CEBEIEN_SHIFT), SDHC_IRQSIGEN_CEBEIEN_SHIFT, SDHC_IRQSIGEN_CEBEIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field CIEIEN[19] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_CIEIEN field. */
#define SDHC_RD_IRQSIGEN_CIEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_CIEIEN_MASK) >> SDHC_IRQSIGEN_CIEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_CIEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_CIEIEN_SHIFT, SDHC_IRQSIGEN_CIEIEN_WIDTH))

/*! @brief Set the CIEIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_CIEIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_CIEIEN_MASK, SDHC_IRQSIGEN_CIEIEN(value)))
#define SDHC_BWR_IRQSIGEN_CIEIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_CIEIEN_SHIFT), SDHC_IRQSIGEN_CIEIEN_SHIFT, SDHC_IRQSIGEN_CIEIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field DTOEIEN[20] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_DTOEIEN field. */
#define SDHC_RD_IRQSIGEN_DTOEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_DTOEIEN_MASK) >> SDHC_IRQSIGEN_DTOEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_DTOEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_DTOEIEN_SHIFT, SDHC_IRQSIGEN_DTOEIEN_WIDTH))

/*! @brief Set the DTOEIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_DTOEIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_DTOEIEN_MASK, SDHC_IRQSIGEN_DTOEIEN(value)))
#define SDHC_BWR_IRQSIGEN_DTOEIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_DTOEIEN_SHIFT), SDHC_IRQSIGEN_DTOEIEN_SHIFT, SDHC_IRQSIGEN_DTOEIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field DCEIEN[21] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_DCEIEN field. */
#define SDHC_RD_IRQSIGEN_DCEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_DCEIEN_MASK) >> SDHC_IRQSIGEN_DCEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_DCEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_DCEIEN_SHIFT, SDHC_IRQSIGEN_DCEIEN_WIDTH))

/*! @brief Set the DCEIEN field to a new value. */
#define SDHC_WR_IRQSIGEN_DCEIEN(base, value) (SDHC_RMW_IRQSIGEN(base, SDHC_IRQSIGEN_DCEIEN_MASK, SDHC_IRQSIGEN_DCEIEN(value)))
#define SDHC_BWR_IRQSIGEN_DCEIEN(base, value) (BME_BFI32(&SDHC_IRQSIGEN_REG(base), ((uint32_t)(value) << SDHC_IRQSIGEN_DCEIEN_SHIFT), SDHC_IRQSIGEN_DCEIEN_SHIFT, SDHC_IRQSIGEN_DCEIEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSIGEN, field DEBEIEN[22] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSIGEN_DEBEIEN field. */
#define SDHC_RD_IRQSIGEN_DEBEIEN(base) ((SDHC_IRQSIGEN_REG(base) & SDHC_IRQSIGEN_DEBEIEN_MASK) >> SDHC_IRQSIGEN_DEBEIEN_SHIFT)
#define SDHC_BRD_IRQSIGEN_DEBEIEN(base) (BME_UBFX32(&SDHC_IRQSIGEN_REG(base), SDHC_IRQSIGEN_DEBEIEN_SHIFT, SDHC_IRQSIGEN_DEBEIEN_WIDTH))

