whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*******************************************************************************
 * SIM_SCGC1 - System Clock Gating Control Register 1
 ******************************************************************************/

/*!
 * @brief SIM_SCGC1 - System Clock Gating Control Register 1 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC1 register
 */
/*@{*/
#define SIM_RD_SCGC1(base)       (SIM_SCGC1_REG(base))
#define SIM_WR_SCGC1(base, value) (SIM_SCGC1_REG(base) = (value))
#define SIM_RMW_SCGC1(base, mask, value) (SIM_WR_SCGC1(base, (SIM_RD_SCGC1(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC1(base, value) (BME_OR32(&SIM_SCGC1_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC1(base, value) (BME_AND32(&SIM_SCGC1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC1(base, value) (BME_XOR32(&SIM_SCGC1_REG(base), (uint32_t)(value)))
/*@}*/

/* Unified clock gate bit access macros */
#define SIM_SCGC_BIT_REG(base, index)        (*((volatile uint32_t *)&SIM_SCGC1_REG(base) + (((uint32_t)(index) >> 5) - 0U)))
#define SIM_SCGC_BIT_SHIFT(index)            ((uint32_t)(index) & ((1U << 5) - 1U))
#define SIM_RD_SCGC_BIT(base, index)         (SIM_SCGC_BIT_REG((base), (index)) & (1U << SIM_SCGC_BIT_SHIFT(index)))
#define SIM_BRD_SCGC_BIT(base, index)        (BME_UBFX32(&SIM_SCGC_BIT_REG((base), (index)), SIM_SCGC_BIT_SHIFT(index), 1))
#define SIM_WR_SCGC_BIT(base, index, value)  (SIM_SCGC_BIT_REG((base), (index)) = (SIM_SCGC_BIT_REG((base), (index)) & ~(1U << SIM_SCGC_BIT_SHIFT(index))) | ((uint32_t)(value) << SIM_SCGC_BIT_SHIFT(index)))
#define SIM_BWR_SCGC_BIT(base, index, value) (BME_BFI32(&SIM_SCGC_BIT_REG((base), (index)), ((uint32_t)(value) << SIM_SCGC_BIT_SHIFT(index)), SIM_SCGC_BIT_SHIFT(index), 1))

/*
 * Constants & macros for individual SIM_SCGC1 bitfields
 */

/*!
 * @name Register SIM_SCGC1, field I2C2[6] (RW)
 *
 * This bit controls the clock gate to the I2C2 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_I2C2 field. */
#define SIM_RD_SCGC1_I2C2(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_I2C2_MASK) >> SIM_SCGC1_I2C2_SHIFT)
#define SIM_BRD_SCGC1_I2C2(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_I2C2_SHIFT, SIM_SCGC1_I2C2_WIDTH))

/*! @brief Set the I2C2 field to a new value. */
#define SIM_WR_SCGC1_I2C2(base, value) (SIM_RMW_SCGC1(base, SIM_SCGC1_I2C2_MASK, SIM_SCGC1_I2C2(value)))
#define SIM_BWR_SCGC1_I2C2(base, value) (BME_BFI32(&SIM_SCGC1_REG(base), ((uint32_t)(value) << SIM_SCGC1_I2C2_SHIFT), SIM_SCGC1_I2C2_SHIFT, SIM_SCGC1_I2C2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC1, field I2C3[7] (RW)
 *
 * This bit controls the clock gate to the I2C3 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_I2C3 field. */
#define SIM_RD_SCGC1_I2C3(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_I2C3_MASK) >> SIM_SCGC1_I2C3_SHIFT)
#define SIM_BRD_SCGC1_I2C3(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_I2C3_SHIFT, SIM_SCGC1_I2C3_WIDTH))

/*! @brief Set the I2C3 field to a new value. */
#define SIM_WR_SCGC1_I2C3(base, value) (SIM_RMW_SCGC1(base, SIM_SCGC1_I2C3_MASK, SIM_SCGC1_I2C3(value)))
#define SIM_BWR_SCGC1_I2C3(base, value) (BME_BFI32(&SIM_SCGC1_REG(base), ((uint32_t)(value) << SIM_SCGC1_I2C3_SHIFT), SIM_SCGC1_I2C3_SHIFT, SIM_SCGC1_I2C3_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC2 - System Clock Gating Control Register 2
 ******************************************************************************/

/*!
 * @brief SIM_SCGC2 - System Clock Gating Control Register 2 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC2 register
 */
/*@{*/
#define SIM_RD_SCGC2(base)       (SIM_SCGC2_REG(base))
#define SIM_WR_SCGC2(base, value) (SIM_SCGC2_REG(base) = (value))
#define SIM_RMW_SCGC2(base, mask, value) (SIM_WR_SCGC2(base, (SIM_RD_SCGC2(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC2(base, value) (BME_OR32(&SIM_SCGC2_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC2(base, value) (BME_AND32(&SIM_SCGC2_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC2(base, value) (BME_XOR32(&SIM_SCGC2_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC2 bitfields
 */

/*!
 * @name Register SIM_SCGC2, field LPUART0[4] (RW)
 *
 * This bit controls the clock gate to the LPUART0 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_LPUART0 field. */
#define SIM_RD_SCGC2_LPUART0(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_LPUART0_MASK) >> SIM_SCGC2_LPUART0_SHIFT)
#define SIM_BRD_SCGC2_LPUART0(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_LPUART0_SHIFT, SIM_SCGC2_LPUART0_WIDTH))

/*! @brief Set the LPUART0 field to a new value. */
#define SIM_WR_SCGC2_LPUART0(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_LPUART0_MASK, SIM_SCGC2_LPUART0(value)))
#define SIM_BWR_SCGC2_LPUART0(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_LPUART0_SHIFT), SIM_SCGC2_LPUART0_SHIFT, SIM_SCGC2_LPUART0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field LPUART1[5] (RW)
 *
 * This bit controls the clock gate to the LPUART1 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_LPUART1 field. */
#define SIM_RD_SCGC2_LPUART1(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_LPUART1_MASK) >> SIM_SCGC2_LPUART1_SHIFT)
#define SIM_BRD_SCGC2_LPUART1(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_LPUART1_SHIFT, SIM_SCGC2_LPUART1_WIDTH))

/*! @brief Set the LPUART1 field to a new value. */
#define SIM_WR_SCGC2_LPUART1(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_LPUART1_MASK, SIM_SCGC2_LPUART1(value)))
#define SIM_BWR_SCGC2_LPUART1(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_LPUART1_SHIFT), SIM_SCGC2_LPUART1_SHIFT, SIM_SCGC2_LPUART1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field LPUART2[6] (RW)
 *
 * This bit controls the clock gate to the LPUART2 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_LPUART2 field. */
#define SIM_RD_SCGC2_LPUART2(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_LPUART2_MASK) >> SIM_SCGC2_LPUART2_SHIFT)
#define SIM_BRD_SCGC2_LPUART2(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_LPUART2_SHIFT, SIM_SCGC2_LPUART2_WIDTH))

/*! @brief Set the LPUART2 field to a new value. */
#define SIM_WR_SCGC2_LPUART2(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_LPUART2_MASK, SIM_SCGC2_LPUART2(value)))
#define SIM_BWR_SCGC2_LPUART2(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_LPUART2_SHIFT), SIM_SCGC2_LPUART2_SHIFT, SIM_SCGC2_LPUART2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field LPUART3[7] (RW)
 *
 * This bit controls the clock gate to the LPUART3 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_LPUART3 field. */
#define SIM_RD_SCGC2_LPUART3(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_LPUART3_MASK) >> SIM_SCGC2_LPUART3_SHIFT)
#define SIM_BRD_SCGC2_LPUART3(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_LPUART3_SHIFT, SIM_SCGC2_LPUART3_WIDTH))

/*! @brief Set the LPUART3 field to a new value. */
#define SIM_WR_SCGC2_LPUART3(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_LPUART3_MASK, SIM_SCGC2_LPUART3(value)))
#define SIM_BWR_SCGC2_LPUART3(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_LPUART3_SHIFT), SIM_SCGC2_LPUART3_SHIFT, SIM_SCGC2_LPUART3_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field TPM1[9] (RW)
 *
 * This bit controls the clock gate to the TPM1 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_TPM1 field. */
#define SIM_RD_SCGC2_TPM1(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_TPM1_MASK) >> SIM_SCGC2_TPM1_SHIFT)
#define SIM_BRD_SCGC2_TPM1(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_TPM1_SHIFT, SIM_SCGC2_TPM1_WIDTH))

