whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/devices/MK82F25615/include/MK82F25615_extension.h
/*! @brief Set the TPM1 field to a new value. */
#define SIM_WR_SCGC2_TPM1(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_TPM1_MASK, SIM_SCGC2_TPM1(value)))
#define SIM_BWR_SCGC2_TPM1(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_TPM1_SHIFT), SIM_SCGC2_TPM1_SHIFT, SIM_SCGC2_TPM1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field TPM2[10] (RW)
 *
 * This bit controls the clock gate to the TPM2 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_TPM2 field. */
#define SIM_RD_SCGC2_TPM2(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_TPM2_MASK) >> SIM_SCGC2_TPM2_SHIFT)
#define SIM_BRD_SCGC2_TPM2(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_TPM2_SHIFT, SIM_SCGC2_TPM2_WIDTH))

/*! @brief Set the TPM2 field to a new value. */
#define SIM_WR_SCGC2_TPM2(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_TPM2_MASK, SIM_SCGC2_TPM2(value)))
#define SIM_BWR_SCGC2_TPM2(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_TPM2_SHIFT), SIM_SCGC2_TPM2_SHIFT, SIM_SCGC2_TPM2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field DAC0[12] (RW)
 *
 * This bit controls the clock gate to the DAC0 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_DAC0 field. */
#define SIM_RD_SCGC2_DAC0(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_DAC0_MASK) >> SIM_SCGC2_DAC0_SHIFT)
#define SIM_BRD_SCGC2_DAC0(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_DAC0_SHIFT, SIM_SCGC2_DAC0_WIDTH))

/*! @brief Set the DAC0 field to a new value. */
#define SIM_WR_SCGC2_DAC0(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_DAC0_MASK, SIM_SCGC2_DAC0(value)))
#define SIM_BWR_SCGC2_DAC0(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_DAC0_SHIFT), SIM_SCGC2_DAC0_SHIFT, SIM_SCGC2_DAC0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field LTC[17] (RW)
 *
 * This bit controls the clock gate to the LTC module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_LTC field. */
#define SIM_RD_SCGC2_LTC(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_LTC_MASK) >> SIM_SCGC2_LTC_SHIFT)
#define SIM_BRD_SCGC2_LTC(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_LTC_SHIFT, SIM_SCGC2_LTC_WIDTH))

/*! @brief Set the LTC field to a new value. */
#define SIM_WR_SCGC2_LTC(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_LTC_MASK, SIM_SCGC2_LTC(value)))
#define SIM_BWR_SCGC2_LTC(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_LTC_SHIFT), SIM_SCGC2_LTC_SHIFT, SIM_SCGC2_LTC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field EMVSIM0[20] (RW)
 *
 * This bit controls the clock gate to the EMVSIM0 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_EMVSIM0 field. */
#define SIM_RD_SCGC2_EMVSIM0(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_EMVSIM0_MASK) >> SIM_SCGC2_EMVSIM0_SHIFT)
#define SIM_BRD_SCGC2_EMVSIM0(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_EMVSIM0_SHIFT, SIM_SCGC2_EMVSIM0_WIDTH))

/*! @brief Set the EMVSIM0 field to a new value. */
#define SIM_WR_SCGC2_EMVSIM0(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_EMVSIM0_MASK, SIM_SCGC2_EMVSIM0(value)))
#define SIM_BWR_SCGC2_EMVSIM0(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_EMVSIM0_SHIFT), SIM_SCGC2_EMVSIM0_SHIFT, SIM_SCGC2_EMVSIM0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field EMVSIM1[21] (RW)
 *
 * This bit controls the clock gate to the EMVSIM1 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_EMVSIM1 field. */
#define SIM_RD_SCGC2_EMVSIM1(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_EMVSIM1_MASK) >> SIM_SCGC2_EMVSIM1_SHIFT)
#define SIM_BRD_SCGC2_EMVSIM1(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_EMVSIM1_SHIFT, SIM_SCGC2_EMVSIM1_WIDTH))

/*! @brief Set the EMVSIM1 field to a new value. */
#define SIM_WR_SCGC2_EMVSIM1(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_EMVSIM1_MASK, SIM_SCGC2_EMVSIM1(value)))
#define SIM_BWR_SCGC2_EMVSIM1(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_EMVSIM1_SHIFT), SIM_SCGC2_EMVSIM1_SHIFT, SIM_SCGC2_EMVSIM1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field LPUART4[22] (RW)
 *
 * This bit controls the clock gate to the LPUART4 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_LPUART4 field. */
#define SIM_RD_SCGC2_LPUART4(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_LPUART4_MASK) >> SIM_SCGC2_LPUART4_SHIFT)
#define SIM_BRD_SCGC2_LPUART4(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_LPUART4_SHIFT, SIM_SCGC2_LPUART4_WIDTH))

/*! @brief Set the LPUART4 field to a new value. */
#define SIM_WR_SCGC2_LPUART4(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_LPUART4_MASK, SIM_SCGC2_LPUART4(value)))
#define SIM_BWR_SCGC2_LPUART4(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_LPUART4_SHIFT), SIM_SCGC2_LPUART4_SHIFT, SIM_SCGC2_LPUART4_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field QSPI[26] (RW)
 *
 * This bit controls the clock gate to the QuadSPI module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_QSPI field. */
#define SIM_RD_SCGC2_QSPI(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_QSPI_MASK) >> SIM_SCGC2_QSPI_SHIFT)
#define SIM_BRD_SCGC2_QSPI(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_QSPI_SHIFT, SIM_SCGC2_QSPI_WIDTH))

/*! @brief Set the QSPI field to a new value. */
#define SIM_WR_SCGC2_QSPI(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_QSPI_MASK, SIM_SCGC2_QSPI(value)))
#define SIM_BWR_SCGC2_QSPI(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_QSPI_SHIFT), SIM_SCGC2_QSPI_SHIFT, SIM_SCGC2_QSPI_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field FLEXIO[31] (RW)
 *
 * This bit controls the clock gate to the FlexIO module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_FLEXIO field. */
#define SIM_RD_SCGC2_FLEXIO(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_FLEXIO_MASK) >> SIM_SCGC2_FLEXIO_SHIFT)
#define SIM_BRD_SCGC2_FLEXIO(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_FLEXIO_SHIFT, SIM_SCGC2_FLEXIO_WIDTH))

/*! @brief Set the FLEXIO field to a new value. */
#define SIM_WR_SCGC2_FLEXIO(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_FLEXIO_MASK, SIM_SCGC2_FLEXIO(value)))
#define SIM_BWR_SCGC2_FLEXIO(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_FLEXIO_SHIFT), SIM_SCGC2_FLEXIO_SHIFT, SIM_SCGC2_FLEXIO_WIDTH))
/*@}*/

